/* automatically generated by rust-bindgen 0.69.5 */

pub type DMA_HandleTypeDef = __DMA_HandleTypeDef;
pub type MDMA_HandleTypeDef = __MDMA_HandleTypeDef;
pub type HCD_TypeDef = USB_OTG_GlobalTypeDef;
pub type HCD_InitTypeDef = USB_OTG_CfgTypeDef;
pub type HCD_HCTypeDef = USB_OTG_HCTypeDef;
pub type I2C_HandleTypeDef = __I2C_HandleTypeDef;
pub type I2S_HandleTypeDef = __I2S_HandleTypeDef;
pub type PCD_TypeDef = USB_OTG_GlobalTypeDef;
pub type PCD_InitTypeDef = USB_OTG_CfgTypeDef;
pub type PCD_EPTypeDef = USB_OTG_EPTypeDef;
pub type HAL_SD_CardStateTypeDef = u32;
pub type SPI_HandleTypeDef = __SPI_HandleTypeDef;
pub type HAL_UART_StateTypeDef = u32;
pub type UART_HandleTypeDef = __UART_HandleTypeDef;
pub type USART_HandleTypeDef = __USART_HandleTypeDef;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_TypeDef {
    pub ISR: u32,
    pub IER: u32,
    pub CR: u32,
    pub CFGR: u32,
    pub CFGR2: u32,
    pub SMPR1: u32,
    pub SMPR2: u32,
    pub PCSEL: u32,
    pub LTR1: u32,
    pub HTR1: u32,
    pub RESERVED1: u32,
    pub RESERVED2: u32,
    pub SQR1: u32,
    pub SQR2: u32,
    pub SQR3: u32,
    pub SQR4: u32,
    pub DR: u32,
    pub RESERVED3: u32,
    pub RESERVED4: u32,
    pub JSQR: u32,
    pub RESERVED5: [u32; 4usize],
    pub OFR1: u32,
    pub OFR2: u32,
    pub OFR3: u32,
    pub OFR4: u32,
    pub RESERVED6: [u32; 4usize],
    pub JDR1: u32,
    pub JDR2: u32,
    pub JDR3: u32,
    pub JDR4: u32,
    pub RESERVED7: [u32; 4usize],

pub const DMAMUX1_Channel9_BASE: u32 = 1073874980;
pub const DMAMUX1_Channel10_BASE: u32 = 1073874984;
pub const DMAMUX1_Channel11_BASE: u32 = 1073874988;
pub const DMAMUX1_Channel12_BASE: u32 = 1073874992;
pub const DMAMUX1_Channel13_BASE: u32 = 1073874996;
pub const DMAMUX1_Channel14_BASE: u32 = 1073875000;
pub const DMAMUX1_Channel15_BASE: u32 = 1073875004;
pub const DMAMUX1_RequestGenerator0_BASE: u32 = 1073875200;
pub const DMAMUX1_RequestGenerator1_BASE: u32 = 1073875204;
pub const DMAMUX1_RequestGenerator2_BASE: u32 = 1073875208;
pub const DMAMUX1_RequestGenerator3_BASE: u32 = 1073875212;
pub const DMAMUX1_RequestGenerator4_BASE: u32 = 1073875216;
pub const DMAMUX1_RequestGenerator5_BASE: u32 = 1073875220;
pub const DMAMUX1_RequestGenerator6_BASE: u32 = 1073875224;
pub const DMAMUX1_RequestGenerator7_BASE: u32 = 1073875228;
pub const DMAMUX1_ChannelStatus_BASE: u32 = 1073875072;
pub const DMAMUX1_RequestGenStatus_BASE: u32 = 1073875264;
pub const FMC_Bank1_R_BASE: u32 = 1375748096;
pub const FMC_Bank1E_R_BASE: u32 = 1375748356;
pub const FMC_Bank2_R_BASE: u32 = 1375748192;
pub const FMC_Bank3_R_BASE: u32 = 1375748224;
pub const FMC_Bank5_6_R_BASE: u32 = 1375748416;
pub const DBGMCU_BASE: u32 = 1543507968;
pub const MDMA_Channel0_BASE: u32 = 1375731776;
pub const MDMA_Channel1_BASE: u32 = 1375731840;
pub const MDMA_Channel2_BASE: u32 = 1375731904;
pub const MDMA_Channel3_BASE: u32 = 1375731968;
pub const MDMA_Channel4_BASE: u32 = 1375732032;
pub const MDMA_Channel5_BASE: u32 = 1375732096;
pub const MDMA_Channel6_BASE: u32 = 1375732160;
pub const MDMA_Channel7_BASE: u32 = 1375732224;
pub const MDMA_Channel8_BASE: u32 = 1375732288;
pub const MDMA_Channel9_BASE: u32 = 1375732352;
pub const MDMA_Channel10_BASE: u32 = 1375732416;
pub const MDMA_Channel11_BASE: u32 = 1375732480;
pub const MDMA_Channel12_BASE: u32 = 1375732544;
pub const MDMA_Channel13_BASE: u32 = 1375732608;
pub const MDMA_Channel14_BASE: u32 = 1375732672;
pub const MDMA_Channel15_BASE: u32 = 1375732736;
pub const RAMECC1_Monitor1_BASE: u32 = 1375768608;
pub const RAMECC1_Monitor2_BASE: u32 = 1375768640;
pub const RAMECC1_Monitor3_BASE: u32 = 1375768672;
pub const RAMECC1_Monitor4_BASE: u32 = 1375768704;
pub const RAMECC1_Monitor5_BASE: u32 = 1375768736;
pub const RAMECC2_Monitor1_BASE: u32 = 1208102944;
pub const RAMECC2_Monitor2_BASE: u32 = 1208102976;
pub const RAMECC2_Monitor3_BASE: u32 = 1208103008;
pub const RAMECC2_Monitor4_BASE: u32 = 1208103040;
pub const RAMECC2_Monitor5_BASE: u32 = 1208103072;
pub const RAMECC3_Monitor1_BASE: u32 = 1476554784;
pub const RAMECC3_Monitor2_BASE: u32 = 1476554816;
pub const USB_OTG_HS_PERIPH_BASE: u32 = 1074003968;
pub const USB_OTG_FS_PERIPH_BASE: u32 = 1074266112;
#[test]
fn bindgen_test_layout_ADC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_TypeDef>(),
        204usize,
        concat!("Size of: ", stringify!(ADC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(IER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CFGR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CFGR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SMPR1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SMPR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SMPR2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SMPR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PCSEL) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(PCSEL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LTR1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(LTR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HTR1) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(HTR1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SQR1) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SQR2) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SQR3) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SQR4) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JSQR) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JSQR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OFR1) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(OFR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OFR2) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(OFR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OFR3) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(OFR3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OFR4) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(OFR4)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED6) as usize - ptr as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED6)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JDR1) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JDR2) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JDR3) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JDR4) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR4)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED7) as usize - ptr as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED7)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AWD2CR) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(AWD2CR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AWD3CR) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(AWD3CR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED8) as usize - ptr as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED8)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED9) as usize - ptr as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED9)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LTR2) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(LTR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HTR2) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(HTR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LTR3) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(LTR3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HTR3) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(HTR3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DIFSEL) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(DIFSEL)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CALFACT) as usize - ptr as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CALFACT)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CALFACT2) as usize - ptr as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CALFACT2)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_GlobalTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_GlobalTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_GlobalTypeDef>(),
        256usize,
        concat!("Size of: ", stringify!(FDCAN_GlobalTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_GlobalTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_GlobalTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CREL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(CREL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ENDN) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(ENDN)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DBTP) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(DBTP)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TEST) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TEST)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RWD) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RWD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCCR) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(CCCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NBTP) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(NBTP)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TSCC) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TSCC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TSCV) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TSCV)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TOCC) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TOCC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TOCV) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TOCV)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ECR) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(ECR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PSR) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(PSR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TDCR) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TDCR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IR) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(IR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IE) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(IE)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ILS) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(ILS)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ILE) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(ILE)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GFC) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(GFC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SIDFC) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(SIDFC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).XIDFC) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(XIDFC)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).XIDAM) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(XIDAM)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HPMS) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(HPMS)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NDAT1) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(NDAT1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NDAT2) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(NDAT2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXF0C) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RXF0C)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXF0S) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RXF0S)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXF0A) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RXF0A)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXBC) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RXBC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXF1C) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RXF1C)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXF1S) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RXF1S)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXF1A) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RXF1A)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXESC) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RXESC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXBC) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXBC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXFQS) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXFQS)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXESC) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXESC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXBRP) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXBRP)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXBAR) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXBAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXBCR) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXBCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXBTO) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXBTO)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXBCF) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXBCF)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXBTIE) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXBTIE)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXBCIE) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXBCIE)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED6) as usize - ptr as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RESERVED6)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXEFC) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXEFC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXEFS) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXEFS)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXEFA) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(TXEFA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED7) as usize - ptr as usize
        },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_GlobalTypeDef),
            "::",
            stringify!(RESERVED7)
        )
    );
}
#[test]
fn bindgen_test_layout_TTCAN_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<TTCAN_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<TTCAN_TypeDef>(),
        516usize,
        concat!("Size of: ", stringify!(TTCAN_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<TTCAN_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(TTCAN_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTTMC) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTTMC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTRMC) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTRMC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTOCF) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTOCF)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTMLM) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTMLM)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TURCF) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TURCF)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTOCN) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTOCN)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTGTP) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTGTP)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTTMK) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTTMK)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTIR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTIR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTIE) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTIE)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTILS) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTILS)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTOST) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTOST)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TURNA) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TURNA)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTLGT) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTLGT)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTCTC) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTCTC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTCPT) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTCPT)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTCSM) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTCSM)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTTS) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(TTCAN_TypeDef),
            "::",
            stringify!(TTTS)
        )
    );
}
#[test]
fn bindgen_test_layout_CRC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<CRC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CRC_TypeDef>(),
        24usize,
        concat!("Size of: ", stringify!(CRC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<CRC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(CRC_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IDR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(IDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INIT) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(INIT)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).POL) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(POL)
        )
    );
}
#[test]
fn bindgen_test_layout_DAC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DAC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DAC_TypeDef>(),
        80usize,
        concat!("Size of: ", stringify!(DAC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DAC_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SWTRIGR) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SWTRIGR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12R1) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12R1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12L1) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12L1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DHR8R1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR8R1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12R2) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12R2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12L2) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12L2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DHR8R2) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR8R2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12RD) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12RD)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12LD) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12LD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DHR8RD) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR8RD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOR1) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DOR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOR2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DOR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MCR) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(MCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHSR1) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SHSR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHSR2) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SHSR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHHR) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SHHR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHRR) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SHRR)
        )
    );
}
#[test]
fn bindgen_test_layout_DCMI_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DCMI_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DCMI_TypeDef>(),
        44usize,
        concat!("Size of: ", stringify!(DCMI_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DCMI_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DCMI_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RISR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(RISR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(IER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MISR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(MISR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ESCR) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(ESCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ESUR) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(ESUR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CWSTRTR) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(CWSTRTR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CWSIZER) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(CWSIZER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_TypeDef),
            "::",
            stringify!(DR)
        )
    );
}
#[test]
fn bindgen_test_layout_DMAMUX_Channel_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMAMUX_Channel_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMAMUX_Channel_TypeDef>(),
        4usize,
        concat!("Size of: ", stringify!(DMAMUX_Channel_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAMUX_Channel_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAMUX_Channel_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAMUX_Channel_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
}
#[test]
fn bindgen_test_layout_DMAMUX_ChannelStatus_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMAMUX_ChannelStatus_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMAMUX_ChannelStatus_TypeDef>(),
        8usize,
        concat!("Size of: ", stringify!(DMAMUX_ChannelStatus_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAMUX_ChannelStatus_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAMUX_ChannelStatus_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAMUX_ChannelStatus_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAMUX_ChannelStatus_TypeDef),
            "::",
            stringify!(CFR)
        )
    );
}
#[test]
fn bindgen_test_layout_DMAMUX_RequestGen_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMAMUX_RequestGen_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMAMUX_RequestGen_TypeDef>(),
        4usize,
        concat!("Size of: ", stringify!(DMAMUX_RequestGen_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAMUX_RequestGen_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAMUX_RequestGen_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RGCR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAMUX_RequestGen_TypeDef),
            "::",
            stringify!(RGCR)
        )
    );
}
#[test]
fn bindgen_test_layout_DMAMUX_RequestGenStatus_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMAMUX_RequestGenStatus_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMAMUX_RequestGenStatus_TypeDef>(),
        8usize,
        concat!("Size of: ", stringify!(DMAMUX_RequestGenStatus_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAMUX_RequestGenStatus_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAMUX_RequestGenStatus_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RGSR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAMUX_RequestGenStatus_TypeDef),
            "::",
            stringify!(RGSR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RGCFR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAMUX_RequestGenStatus_TypeDef),
            "::",
            stringify!(RGCFR)
        )
    );
}
#[test]
fn bindgen_test_layout_MDMA_Channel_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<MDMA_Channel_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<MDMA_Channel_TypeDef>(),
        56usize,
        concat!("Size of: ", stringify!(MDMA_Channel_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<MDMA_Channel_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(MDMA_Channel_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CISR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CISR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CIFCR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CIFCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CESR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CESR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTCR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CTCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CBNDTR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CBNDTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSAR) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CSAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CDAR) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CDAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CBRUR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CBRUR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CLAR) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CLAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTBR) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CTBR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMAR) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CMAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMDR) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_Channel_TypeDef),
            "::",
            stringify!(CMDR)
        )
    );
}
#[test]
fn bindgen_test_layout_FMC_Bank5_6_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FMC_Bank5_6_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FMC_Bank5_6_TypeDef>(),
        28usize,
        concat!("Size of: ", stringify!(FMC_Bank5_6_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FMC_Bank5_6_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FMC_Bank5_6_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDCR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank5_6_TypeDef),
            "::",
            stringify!(SDCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDTR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank5_6_TypeDef),
            "::",
            stringify!(SDTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDCMR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank5_6_TypeDef),
            "::",
            stringify!(SDCMR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDRTR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank5_6_TypeDef),
            "::",
            stringify!(SDRTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDSR) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank5_6_TypeDef),
            "::",
            stringify!(SDSR)
        )
    );
}
#[test]
fn bindgen_test_layout_GPIO_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<GPIO_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<GPIO_TypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(GPIO_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<GPIO_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(GPIO_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MODER) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(MODER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OTYPER) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(OTYPER)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OSPEEDR) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(OSPEEDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PUPDR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(PUPDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IDR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(IDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ODR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(ODR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BSRR) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(BSRR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LCKR) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(LCKR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(AFR)
        )
    );
}
#[test]
fn bindgen_test_layout_I2C_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<I2C_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<I2C_TypeDef>(),
        44usize,
        concat!("Size of: ", stringify!(I2C_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<I2C_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(I2C_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OAR1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(OAR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OAR2) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(OAR2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TIMINGR) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(TIMINGR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TIMEOUTR) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(TIMEOUTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PECR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(PECR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXDR) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(RXDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXDR) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(TXDR)
        )
    );
}
#[test]
fn bindgen_test_layout_IWDG_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<IWDG_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<IWDG_TypeDef>(),
        20usize,
        concat!("Size of: ", stringify!(IWDG_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<IWDG_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(IWDG_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).KR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(KR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(PR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RLR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(RLR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WINR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(WINR)
        )
    );
}
#[test]
fn bindgen_test_layout_RTC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<RTC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<RTC_TypeDef>(),
        208usize,
        concat!("Size of: ", stringify!(RTC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<RTC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(RTC_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PRER) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(PRER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WUTR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(WUTR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(RESERVED)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ALRMAR) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ALRMBR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMBR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WPR) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(WPR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SSR) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(SSR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHIFTR) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(SHIFTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TSTR) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TSTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TSDR) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TSDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TSSSR) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TSSSR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CALR) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(CALR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TAMPCR) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TAMPCR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ALRMASSR) as usize - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMASSR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ALRMBSSR) as usize - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMBSSR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OR) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(OR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP0R) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP0R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP1R) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP1R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP2R) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP2R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP3R) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP3R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP4R) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP4R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP5R) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP5R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP6R) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP6R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP7R) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP7R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP8R) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP8R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP9R) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP9R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP10R) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP10R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP11R) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP11R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP12R) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP12R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP13R) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP13R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP14R) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP14R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP15R) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP15R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP16R) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP16R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP17R) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP17R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP18R) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP18R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP19R) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP19R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP20R) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP20R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP21R) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP21R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP22R) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP22R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP23R) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP23R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP24R) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP24R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP25R) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP25R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP26R) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP26R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP27R) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP27R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP28R) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP28R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP29R) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP29R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP30R) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP30R)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP31R) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP31R)
        )
    );
}
#[test]
fn bindgen_test_layout_SDMMC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<SDMMC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDMMC_TypeDef>(),
        1024usize,
        concat!("Size of: ", stringify!(SDMMC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SDMMC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SDMMC_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).POWER) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(POWER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CLKCR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(CLKCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ARG) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(ARG)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMD) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(CMD)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESPCMD) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESPCMD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESP1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESP1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESP2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESP2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESP3) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESP3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESP4) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESP4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DTIMER) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(DTIMER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DLEN) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(DLEN)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DCTRL) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(DCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DCOUNT) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(DCOUNT)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).STA) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(STA)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MASK) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(MASK)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ACKTIME) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(ACKTIME)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IDMACTRL) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(IDMACTRL)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IDMABSIZE) as usize - ptr as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(IDMABSIZE)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IDMABASE0) as usize - ptr as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(IDMABASE0)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IDMABASE1) as usize - ptr as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(IDMABASE1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FIFO) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(FIFO)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IPVR) as usize - ptr as usize },
        1020usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(IPVR)
        )
    );
}
#[test]
fn bindgen_test_layout_SPI_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<SPI_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SPI_TypeDef>(),
        84usize,
        concat!("Size of: ", stringify!(SPI_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SPI_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SPI_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFG1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CFG1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFG2) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CFG2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(IER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IFCR) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(IFCR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXDR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(TXDR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXDR) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(RXDR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCPOLY) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CRCPOLY)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXCRC) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(TXCRC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXCRC) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(RXCRC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UDRDR) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(UDRDR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).I2SCFGR) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(I2SCFGR)
        )
    );
}
#[test]
fn bindgen_test_layout_TIM_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<TIM_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<TIM_TypeDef>(),
        108usize,
        concat!("Size of: ", stringify!(TIM_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<TIM_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(TIM_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SMCR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(SMCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DIER) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(DIER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EGR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(EGR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCMR1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCMR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCMR2) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCMR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCER) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CNT) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CNT)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PSC) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(PSC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ARR) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(ARR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RCR) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(RCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR1) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR2) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR3) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR4) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BDTR) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(BDTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DCR) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(DCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DMAR) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(DMAR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCMR3) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCMR3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR5) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR6) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR6)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AF1) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(AF1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AF2) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(AF2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TISEL) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(TISEL)
        )
    );
}
#[test]
fn bindgen_test_layout_USART_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<USART_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<USART_TypeDef>(),
        48usize,
        concat!("Size of: ", stringify!(USART_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USART_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USART_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR3) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(CR3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BRR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(BRR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GTPR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(GTPR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RTOR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RTOR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RQR) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RQR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RDR) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TDR) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(TDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PRESC) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(PRESC)
        )
    );
}
#[test]
fn bindgen_test_layout_WWDG_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<WWDG_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<WWDG_TypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(WWDG_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<WWDG_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(WWDG_TypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WWDG_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WWDG_TypeDef),
            "::",
            stringify!(CFR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WWDG_TypeDef),
            "::",
            stringify!(SR)
        )
    );
}
#[test]
fn bindgen_test_layout_USB_OTG_GlobalTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<USB_OTG_GlobalTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_GlobalTypeDef>(),
        320usize,
        concat!("Size of: ", stringify!(USB_OTG_GlobalTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_GlobalTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_GlobalTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GOTGCTL) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GOTGCTL)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GOTGINT) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GOTGINT)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GAHBCFG) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GAHBCFG)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GUSBCFG) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GUSBCFG)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GRSTCTL) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRSTCTL)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GINTSTS) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GINTSTS)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GINTMSK) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GINTMSK)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GRXSTSR) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRXSTSR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GRXSTSP) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRXSTSP)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GRXFSIZ) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRXFSIZ)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DIEPTXF0_HNPTXFSIZ) as usize
                - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(DIEPTXF0_HNPTXFSIZ)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HNPTXSTS) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(HNPTXSTS)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Reserved30) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(Reserved30)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GCCFG) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GCCFG)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CID) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(CID)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GSNPSID) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GSNPSID)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GHWCFG1) as usize - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GHWCFG1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GHWCFG2) as usize - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GHWCFG2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GHWCFG3) as usize - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GHWCFG3)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Reserved6) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(Reserved6)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GLPMCFG) as usize - ptr as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GLPMCFG)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GPWRDN) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GPWRDN)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GDFIFOCFG) as usize - ptr as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GDFIFOCFG)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GADPCTL) as usize - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GADPCTL)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Reserved43) as usize - ptr as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(Reserved43)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HPTXFSIZ) as usize - ptr as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(HPTXFSIZ)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DIEPTXF) as usize - ptr as usize
        },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(DIEPTXF)
        )
    );
}
#[test]
fn bindgen_test_layout_DMA_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMA_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMA_InitTypeDef>(),
        48usize,
        concat!("Size of: ", stringify!(DMA_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMA_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMA_InitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Request) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(Request)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Direction) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(Direction)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PeriphInc) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(PeriphInc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MemInc) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(MemInc)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PeriphDataAlignment) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(PeriphDataAlignment)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MemDataAlignment) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(MemDataAlignment)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Mode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(Mode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Priority) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(Priority)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FIFOMode) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(FIFOMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FIFOThreshold) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(FIFOThreshold)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MemBurst) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(MemBurst)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PeriphBurst) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_InitTypeDef),
            "::",
            stringify!(PeriphBurst)
        )
    );
}
#[test]
fn bindgen_test_layout___DMA_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<__DMA_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__DMA_HandleTypeDef>(),
        124usize,
        concat!("Size of: ", stringify!(__DMA_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<__DMA_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(__DMA_HandleTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Instance) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(Instance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Parent) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(Parent)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferCpltCallback) as usize
                - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(XferCpltCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferHalfCpltCallback) as usize
                - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(XferHalfCpltCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferM1CpltCallback) as usize
                - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(XferM1CpltCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferM1HalfCpltCallback) as usize
                - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(XferM1HalfCpltCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferErrorCallback) as usize
                - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(XferErrorCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferAbortCallback) as usize
                - ptr as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(XferAbortCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorCode) as usize - ptr as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(ErrorCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).StreamBaseAddress) as usize
                - ptr as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(StreamBaseAddress)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).StreamIndex) as usize - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(StreamIndex)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMAmuxChannel) as usize - ptr as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(DMAmuxChannel)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMAmuxChannelStatus) as usize
                - ptr as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(DMAmuxChannelStatus)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMAmuxChannelStatusMask) as usize
                - ptr as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(DMAmuxChannelStatusMask)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMAmuxRequestGen) as usize
                - ptr as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(DMAmuxRequestGen)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMAmuxRequestGenStatus) as usize
                - ptr as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(DMAmuxRequestGenStatus)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMAmuxRequestGenStatusMask) as usize
                - ptr as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__DMA_HandleTypeDef),
            "::",
            stringify!(DMAmuxRequestGenStatusMask)
        )
    );
}
#[test]
fn bindgen_test_layout_HAL_DMA_MuxSyncConfigTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HAL_DMA_MuxSyncConfigTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HAL_DMA_MuxSyncConfigTypeDef>(),
        20usize,
        concat!("Size of: ", stringify!(HAL_DMA_MuxSyncConfigTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<HAL_DMA_MuxSyncConfigTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(HAL_DMA_MuxSyncConfigTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SyncSignalID) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMA_MuxSyncConfigTypeDef),
            "::",
            stringify!(SyncSignalID)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SyncPolarity) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMA_MuxSyncConfigTypeDef),
            "::",
            stringify!(SyncPolarity)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SyncEnable) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMA_MuxSyncConfigTypeDef),
            "::",
            stringify!(SyncEnable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).EventEnable) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMA_MuxSyncConfigTypeDef),
            "::",
            stringify!(EventEnable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RequestNumber) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMA_MuxSyncConfigTypeDef),
            "::",
            stringify!(RequestNumber)
        )
    );
}
#[test]
fn bindgen_test_layout_HAL_DMA_MuxRequestGeneratorConfigTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<
        HAL_DMA_MuxRequestGeneratorConfigTypeDef,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HAL_DMA_MuxRequestGeneratorConfigTypeDef>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(HAL_DMA_MuxRequestGeneratorConfigTypeDef)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<HAL_DMA_MuxRequestGeneratorConfigTypeDef>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(HAL_DMA_MuxRequestGeneratorConfigTypeDef)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SignalID) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMA_MuxRequestGeneratorConfigTypeDef),
            "::",
            stringify!(SignalID)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Polarity) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMA_MuxRequestGeneratorConfigTypeDef),
            "::",
            stringify!(Polarity)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RequestNumber) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMA_MuxRequestGeneratorConfigTypeDef),
            "::",
            stringify!(RequestNumber)
        )
    );
}
#[test]
fn bindgen_test_layout_MDMA_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<MDMA_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<MDMA_InitTypeDef>(),
        56usize,
        concat!("Size of: ", stringify!(MDMA_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<MDMA_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(MDMA_InitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Request) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(Request)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TransferTriggerMode) as usize
                - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(TransferTriggerMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Priority) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(Priority)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Endianness) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(Endianness)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SourceInc) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(SourceInc)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DestinationInc) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(DestinationInc)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SourceDataSize) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(SourceDataSize)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DestDataSize) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(DestDataSize)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataAlignment) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(DataAlignment)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BufferTransferLength) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(BufferTransferLength)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SourceBurst) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(SourceBurst)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DestBurst) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(DestBurst)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SourceBlockAddressOffset) as usize
                - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(SourceBlockAddressOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DestBlockAddressOffset) as usize
                - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_InitTypeDef),
            "::",
            stringify!(DestBlockAddressOffset)
        )
    );
}
#[test]
fn bindgen_test_layout_MDMA_LinkNodeTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<MDMA_LinkNodeTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<MDMA_LinkNodeTypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(MDMA_LinkNodeTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<MDMA_LinkNodeTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(MDMA_LinkNodeTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTCR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(CTCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CBNDTR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(CBNDTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSAR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(CSAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CDAR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(CDAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CBRUR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(CBRUR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CLAR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(CLAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTBR) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(CTBR)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(Reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMAR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(CMAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMDR) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeTypeDef),
            "::",
            stringify!(CMDR)
        )
    );
}
#[test]
fn bindgen_test_layout_MDMA_LinkNodeConfTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<MDMA_LinkNodeConfTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<MDMA_LinkNodeConfTypeDef>(),
        80usize,
        concat!("Size of: ", stringify!(MDMA_LinkNodeConfTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<MDMA_LinkNodeConfTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(MDMA_LinkNodeConfTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeConfTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SrcAddress) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeConfTypeDef),
            "::",
            stringify!(SrcAddress)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DstAddress) as usize - ptr as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeConfTypeDef),
            "::",
            stringify!(DstAddress)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BlockDataLength) as usize
                - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeConfTypeDef),
            "::",
            stringify!(BlockDataLength)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BlockCount) as usize - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeConfTypeDef),
            "::",
            stringify!(BlockCount)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PostRequestMaskAddress) as usize
                - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeConfTypeDef),
            "::",
            stringify!(PostRequestMaskAddress)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PostRequestMaskData) as usize
                - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(MDMA_LinkNodeConfTypeDef),
            "::",
            stringify!(PostRequestMaskData)
        )
    );
}
#[test]
fn bindgen_test_layout___MDMA_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<__MDMA_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__MDMA_HandleTypeDef>(),
        112usize,
        concat!("Size of: ", stringify!(__MDMA_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<__MDMA_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(__MDMA_HandleTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Instance) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(Instance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Parent) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(Parent)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferCpltCallback) as usize
                - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(XferCpltCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferBufferCpltCallback) as usize
                - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(XferBufferCpltCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferBlockCpltCallback) as usize
                - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(XferBlockCpltCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferRepeatBlockCpltCallback) as usize
                - ptr as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(XferRepeatBlockCpltCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferErrorCallback) as usize
                - ptr as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(XferErrorCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferAbortCallback) as usize
                - ptr as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(XferAbortCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FirstLinkedListNodeAddress) as usize
                - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(FirstLinkedListNodeAddress)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LastLinkedListNodeAddress) as usize
                - ptr as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(LastLinkedListNodeAddress)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LinkedListNodeCounter) as usize
                - ptr as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(LinkedListNodeCounter)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorCode) as usize - ptr as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(__MDMA_HandleTypeDef),
            "::",
            stringify!(ErrorCode)
        )
    );
}
#[test]
fn bindgen_test_layout_ADC_OversamplingTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_OversamplingTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_OversamplingTypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(ADC_OversamplingTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_OversamplingTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_OversamplingTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Ratio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_OversamplingTypeDef),
            "::",
            stringify!(Ratio)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RightBitShift) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_OversamplingTypeDef),
            "::",
            stringify!(RightBitShift)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TriggeredMode) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_OversamplingTypeDef),
            "::",
            stringify!(TriggeredMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OversamplingStopReset) as usize
                - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_OversamplingTypeDef),
            "::",
            stringify!(OversamplingStopReset)
        )
    );
}
#[test]
fn bindgen_test_layout_ADC_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_InitTypeDef>(),
        76usize,
        concat!("Size of: ", stringify!(ADC_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_InitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ClockPrescaler) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(ClockPrescaler)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Resolution) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(Resolution)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ScanConvMode) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(ScanConvMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).EOCSelection) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(EOCSelection)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LowPowerAutoWait) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(LowPowerAutoWait)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ContinuousConvMode) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(ContinuousConvMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NbrOfConversion) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(NbrOfConversion)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DiscontinuousConvMode) as usize
                - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(DiscontinuousConvMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NbrOfDiscConversion) as usize
                - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(NbrOfDiscConversion)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExternalTrigConv) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(ExternalTrigConv)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExternalTrigConvEdge) as usize
                - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(ExternalTrigConvEdge)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ConversionDataManagement) as usize
                - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(ConversionDataManagement)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Overrun) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(Overrun)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LeftBitShift) as usize - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(LeftBitShift)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OversamplingMode) as usize
                - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(OversamplingMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Oversampling) as usize - ptr as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InitTypeDef),
            "::",
            stringify!(Oversampling)
        )
    );
}
#[test]
fn bindgen_test_layout_ADC_ChannelConfTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_ChannelConfTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_ChannelConfTypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(ADC_ChannelConfTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_ChannelConfTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_ChannelConfTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Channel) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_ChannelConfTypeDef),
            "::",
            stringify!(Channel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Rank) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_ChannelConfTypeDef),
            "::",
            stringify!(Rank)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SamplingTime) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_ChannelConfTypeDef),
            "::",
            stringify!(SamplingTime)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SingleDiff) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_ChannelConfTypeDef),
            "::",
            stringify!(SingleDiff)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OffsetNumber) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_ChannelConfTypeDef),
            "::",
            stringify!(OffsetNumber)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Offset) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_ChannelConfTypeDef),
            "::",
            stringify!(Offset)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OffsetRightShift) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_ChannelConfTypeDef),
            "::",
            stringify!(OffsetRightShift)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OffsetSignedSaturation) as usize
                - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_ChannelConfTypeDef),
            "::",
            stringify!(OffsetSignedSaturation)
        )
    );
}
#[test]
fn bindgen_test_layout_ADC_AnalogWDGConfTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_AnalogWDGConfTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_AnalogWDGConfTypeDef>(),
        24usize,
        concat!("Size of: ", stringify!(ADC_AnalogWDGConfTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_AnalogWDGConfTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_AnalogWDGConfTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WatchdogNumber) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AnalogWDGConfTypeDef),
            "::",
            stringify!(WatchdogNumber)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WatchdogMode) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AnalogWDGConfTypeDef),
            "::",
            stringify!(WatchdogMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Channel) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AnalogWDGConfTypeDef),
            "::",
            stringify!(Channel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ITMode) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AnalogWDGConfTypeDef),
            "::",
            stringify!(ITMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HighThreshold) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AnalogWDGConfTypeDef),
            "::",
            stringify!(HighThreshold)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LowThreshold) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AnalogWDGConfTypeDef),
            "::",
            stringify!(LowThreshold)
        )
    );
}
#[test]
fn bindgen_test_layout_ADC_InjectionConfigTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_InjectionConfigTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_InjectionConfigTypeDef>(),
        8usize,
        concat!("Size of: ", stringify!(ADC_InjectionConfigTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_InjectionConfigTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_InjectionConfigTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ContextQueue) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfigTypeDef),
            "::",
            stringify!(ContextQueue)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ChannelCount) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfigTypeDef),
            "::",
            stringify!(ChannelCount)
        )
    );
}
#[test]
fn bindgen_test_layout_ADC_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_HandleTypeDef>(),
        104usize,
        concat!("Size of: ", stringify!(ADC_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_HandleTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Instance) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_HandleTypeDef),
            "::",
            stringify!(Instance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_HandleTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMA_Handle) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_HandleTypeDef),
            "::",
            stringify!(DMA_Handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorCode) as usize - ptr as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_HandleTypeDef),
            "::",
            stringify!(ErrorCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectionConfig) as usize
                - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_HandleTypeDef),
            "::",
            stringify!(InjectionConfig)
        )
    );
}
#[test]
fn bindgen_test_layout_ADC_InjOversamplingTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_InjOversamplingTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_InjOversamplingTypeDef>(),
        8usize,
        concat!("Size of: ", stringify!(ADC_InjOversamplingTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_InjOversamplingTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_InjOversamplingTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Ratio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjOversamplingTypeDef),
            "::",
            stringify!(Ratio)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RightBitShift) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjOversamplingTypeDef),
            "::",
            stringify!(RightBitShift)
        )
    );
}
#[test]
fn bindgen_test_layout_ADC_InjectionConfTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_InjectionConfTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_InjectionConfTypeDef>(),
        72usize,
        concat!("Size of: ", stringify!(ADC_InjectionConfTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_InjectionConfTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_InjectionConfTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedChannel) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedChannel)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedRank) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedRank)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedSamplingTime) as usize
                - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedSamplingTime)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedSingleDiff) as usize
                - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedSingleDiff)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedOffsetNumber) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedOffsetNumber)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedOffset) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedOffsetRightShift) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedOffsetRightShift)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedOffsetSignedSaturation)
                as usize
                - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedOffsetSignedSaturation)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedLeftBitShift) as usize
                - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedLeftBitShift)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedNbrOfConversion) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedNbrOfConversion)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjectedDiscontinuousConvMode) as usize
                - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjectedDiscontinuousConvMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AutoInjectedConv) as usize
                - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(AutoInjectedConv)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).QueueInjectedContext) as usize
                - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(QueueInjectedContext)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExternalTrigInjecConv) as usize
                - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(ExternalTrigInjecConv)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExternalTrigInjecConvEdge) as usize
                - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(ExternalTrigInjecConvEdge)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjecOversamplingMode) as usize
                - ptr as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjecOversamplingMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InjecOversampling) as usize
                - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_InjectionConfTypeDef),
            "::",
            stringify!(InjecOversampling)
        )
    );
}
#[test]
fn bindgen_test_layout_ADC_MultiModeTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_MultiModeTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_MultiModeTypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(ADC_MultiModeTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_MultiModeTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_MultiModeTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_MultiModeTypeDef),
            "::",
            stringify!(Mode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DualModeData) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_MultiModeTypeDef),
            "::",
            stringify!(DualModeData)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TwoSamplingDelay) as usize
                - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_MultiModeTypeDef),
            "::",
            stringify!(TwoSamplingDelay)
        )
    );
}
#[test]
fn bindgen_test_layout_MPU_Region_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<MPU_Region_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<MPU_Region_InitTypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(MPU_Region_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<MPU_Region_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(MPU_Region_InitTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(Enable)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Number) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(Number)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BaseAddress) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(BaseAddress)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SubRegionDisable) as usize
                - ptr as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(SubRegionDisable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TypeExtField) as usize - ptr as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(TypeExtField)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AccessPermission) as usize
                - ptr as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(AccessPermission)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DisableExec) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(DisableExec)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IsShareable) as usize - ptr as usize
        },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(IsShareable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IsCacheable) as usize - ptr as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(IsCacheable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IsBufferable) as usize - ptr as usize
        },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Region_InitTypeDef),
            "::",
            stringify!(IsBufferable)
        )
    );
}
#[test]
fn bindgen_test_layout_CRC_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<CRC_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CRC_InitTypeDef>(),
        24usize,
        concat!("Size of: ", stringify!(CRC_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<CRC_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(CRC_InitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DefaultPolynomialUse) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_InitTypeDef),
            "::",
            stringify!(DefaultPolynomialUse)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DefaultInitValueUse) as usize
                - ptr as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_InitTypeDef),
            "::",
            stringify!(DefaultInitValueUse)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GeneratingPolynomial) as usize
                - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_InitTypeDef),
            "::",
            stringify!(GeneratingPolynomial)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCLength) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_InitTypeDef),
            "::",
            stringify!(CRCLength)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InitValue) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_InitTypeDef),
            "::",
            stringify!(InitValue)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InputDataInversionMode) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_InitTypeDef),
            "::",
            stringify!(InputDataInversionMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OutputDataInversionMode) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_InitTypeDef),
            "::",
            stringify!(OutputDataInversionMode)
        )
    );
}
#[test]
fn bindgen_test_layout_CRC_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<CRC_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CRC_HandleTypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(CRC_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<CRC_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(CRC_HandleTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Instance) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_HandleTypeDef),
            "::",
            stringify!(Instance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_HandleTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InputDataFormat) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_HandleTypeDef),
            "::",
            stringify!(InputDataFormat)
        )
    );
}
#[test]
fn bindgen_test_layout_DAC_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DAC_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DAC_HandleTypeDef>(),
        24usize,
        concat!("Size of: ", stringify!(DAC_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DAC_HandleTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Instance) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_HandleTypeDef),
            "::",
            stringify!(Instance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMA_Handle1) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_HandleTypeDef),
            "::",
            stringify!(DMA_Handle1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMA_Handle2) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_HandleTypeDef),
            "::",
            stringify!(DMA_Handle2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorCode) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_HandleTypeDef),
            "::",
            stringify!(ErrorCode)
        )
    );
}
#[test]
fn bindgen_test_layout_DAC_SampleAndHoldConfTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DAC_SampleAndHoldConfTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DAC_SampleAndHoldConfTypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(DAC_SampleAndHoldConfTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_SampleAndHoldConfTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DAC_SampleAndHoldConfTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_SampleTime) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_SampleAndHoldConfTypeDef),
            "::",
            stringify!(DAC_SampleTime)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_HoldTime) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_SampleAndHoldConfTypeDef),
            "::",
            stringify!(DAC_HoldTime)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_RefreshTime) as usize
                - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_SampleAndHoldConfTypeDef),
            "::",
            stringify!(DAC_RefreshTime)
        )
    );
}
#[test]
fn bindgen_test_layout_DAC_ChannelConfTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DAC_ChannelConfTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DAC_ChannelConfTypeDef>(),
        36usize,
        concat!("Size of: ", stringify!(DAC_ChannelConfTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_ChannelConfTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DAC_ChannelConfTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_SampleAndHold) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_ChannelConfTypeDef),
            "::",
            stringify!(DAC_SampleAndHold)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_Trigger) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_ChannelConfTypeDef),
            "::",
            stringify!(DAC_Trigger)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_OutputBuffer) as usize
                - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_ChannelConfTypeDef),
            "::",
            stringify!(DAC_OutputBuffer)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_ConnectOnChipPeripheral) as usize
                - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_ChannelConfTypeDef),
            "::",
            stringify!(DAC_ConnectOnChipPeripheral)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_UserTrimming) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_ChannelConfTypeDef),
            "::",
            stringify!(DAC_UserTrimming)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_TrimmingValue) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_ChannelConfTypeDef),
            "::",
            stringify!(DAC_TrimmingValue)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DAC_SampleAndHoldConfig) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_ChannelConfTypeDef),
            "::",
            stringify!(DAC_SampleAndHoldConfig)
        )
    );
}
#[test]
fn bindgen_test_layout_DCMI_CodesInitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DCMI_CodesInitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DCMI_CodesInitTypeDef>(),
        4usize,
        concat!("Size of: ", stringify!(DCMI_CodesInitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DCMI_CodesInitTypeDef>(),
        1usize,
        concat!("Alignment of ", stringify!(DCMI_CodesInitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FrameStartCode) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_CodesInitTypeDef),
            "::",
            stringify!(FrameStartCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LineStartCode) as usize - ptr as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_CodesInitTypeDef),
            "::",
            stringify!(LineStartCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LineEndCode) as usize - ptr as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_CodesInitTypeDef),
            "::",
            stringify!(LineEndCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FrameEndCode) as usize - ptr as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_CodesInitTypeDef),
            "::",
            stringify!(FrameEndCode)
        )
    );
}
#[test]
fn bindgen_test_layout_DCMI_SyncUnmaskTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DCMI_SyncUnmaskTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DCMI_SyncUnmaskTypeDef>(),
        4usize,
        concat!("Size of: ", stringify!(DCMI_SyncUnmaskTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DCMI_SyncUnmaskTypeDef>(),
        1usize,
        concat!("Alignment of ", stringify!(DCMI_SyncUnmaskTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FrameStartUnmask) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_SyncUnmaskTypeDef),
            "::",
            stringify!(FrameStartUnmask)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LineStartUnmask) as usize
                - ptr as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_SyncUnmaskTypeDef),
            "::",
            stringify!(LineStartUnmask)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LineEndUnmask) as usize - ptr as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_SyncUnmaskTypeDef),
            "::",
            stringify!(LineEndUnmask)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FrameEndUnmask) as usize - ptr as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_SyncUnmaskTypeDef),
            "::",
            stringify!(FrameEndUnmask)
        )
    );
}
#[test]
fn bindgen_test_layout_DCMI_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DCMI_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DCMI_InitTypeDef>(),
        48usize,
        concat!("Size of: ", stringify!(DCMI_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DCMI_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DCMI_InitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SynchroMode) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(SynchroMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PCKPolarity) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(PCKPolarity)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).VSPolarity) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(VSPolarity)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HSPolarity) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(HSPolarity)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CaptureRate) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(CaptureRate)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExtendedDataMode) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(ExtendedDataMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SyncroCode) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(SyncroCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).JPEGMode) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(JPEGMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ByteSelectMode) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(ByteSelectMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ByteSelectStart) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(ByteSelectStart)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LineSelectMode) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(LineSelectMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LineSelectStart) as usize
                - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_InitTypeDef),
            "::",
            stringify!(LineSelectStart)
        )
    );
}
#[test]
fn bindgen_test_layout_DCMI_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DCMI_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DCMI_HandleTypeDef>(),
        84usize,
        concat!("Size of: ", stringify!(DCMI_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DCMI_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DCMI_HandleTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Instance) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(Instance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferCount) as usize - ptr as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(XferCount)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferSize) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(XferSize)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferTransferNumber) as usize
                - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(XferTransferNumber)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pBuffPtr) as usize - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(pBuffPtr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMA_Handle) as usize - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(DMA_Handle)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorCode) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DCMI_HandleTypeDef),
            "::",
            stringify!(ErrorCode)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_InitTypeDef>(),
        108usize,
        concat!("Size of: ", stringify!(FDCAN_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_InitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FrameFormat) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(FrameFormat)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Mode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(Mode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AutoRetransmission) as usize
                - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(AutoRetransmission)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TransmitPause) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(TransmitPause)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ProtocolException) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(ProtocolException)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NominalPrescaler) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(NominalPrescaler)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NominalSyncJumpWidth) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(NominalSyncJumpWidth)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NominalTimeSeg1) as usize
                - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(NominalTimeSeg1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NominalTimeSeg2) as usize
                - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(NominalTimeSeg2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataPrescaler) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(DataPrescaler)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataSyncJumpWidth) as usize
                - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(DataSyncJumpWidth)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataTimeSeg1) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(DataTimeSeg1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataTimeSeg2) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(DataTimeSeg2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MessageRAMOffset) as usize
                - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(MessageRAMOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).StdFiltersNbr) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(StdFiltersNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExtFiltersNbr) as usize - ptr as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(ExtFiltersNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxFifo0ElmtsNbr) as usize
                - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(RxFifo0ElmtsNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxFifo0ElmtSize) as usize
                - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(RxFifo0ElmtSize)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxFifo1ElmtsNbr) as usize
                - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(RxFifo1ElmtsNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxFifo1ElmtSize) as usize
                - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(RxFifo1ElmtSize)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxBuffersNbr) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(RxBuffersNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxBufferSize) as usize - ptr as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(RxBufferSize)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxEventsNbr) as usize - ptr as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(TxEventsNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxBuffersNbr) as usize - ptr as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(TxBuffersNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxFifoQueueElmtsNbr) as usize
                - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(TxFifoQueueElmtsNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxFifoQueueMode) as usize
                - ptr as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(TxFifoQueueMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxElmtSize) as usize - ptr as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_InitTypeDef),
            "::",
            stringify!(TxElmtSize)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_ClkCalUnitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_ClkCalUnitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_ClkCalUnitTypeDef>(),
        24usize,
        concat!("Size of: ", stringify!(FDCAN_ClkCalUnitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_ClkCalUnitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_ClkCalUnitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ClockCalibration) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ClkCalUnitTypeDef),
            "::",
            stringify!(ClockCalibration)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ClockDivider) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ClkCalUnitTypeDef),
            "::",
            stringify!(ClockDivider)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MinOscClkPeriods) as usize
                - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ClkCalUnitTypeDef),
            "::",
            stringify!(MinOscClkPeriods)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CalFieldLength) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ClkCalUnitTypeDef),
            "::",
            stringify!(CalFieldLength)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TimeQuantaPerBitTime) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ClkCalUnitTypeDef),
            "::",
            stringify!(TimeQuantaPerBitTime)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WatchdogStartValue) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ClkCalUnitTypeDef),
            "::",
            stringify!(WatchdogStartValue)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_FilterTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_FilterTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_FilterTypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(FDCAN_FilterTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_FilterTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_FilterTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IdType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_FilterTypeDef),
            "::",
            stringify!(IdType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterIndex) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_FilterTypeDef),
            "::",
            stringify!(FilterIndex)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterType) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_FilterTypeDef),
            "::",
            stringify!(FilterType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterConfig) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_FilterTypeDef),
            "::",
            stringify!(FilterConfig)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterID1) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_FilterTypeDef),
            "::",
            stringify!(FilterID1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterID2) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_FilterTypeDef),
            "::",
            stringify!(FilterID2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxBufferIndex) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_FilterTypeDef),
            "::",
            stringify!(RxBufferIndex)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IsCalibrationMsg) as usize
                - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_FilterTypeDef),
            "::",
            stringify!(IsCalibrationMsg)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_TxHeaderTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_TxHeaderTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_TxHeaderTypeDef>(),
        36usize,
        concat!("Size of: ", stringify!(FDCAN_TxHeaderTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_TxHeaderTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_TxHeaderTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Identifier) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxHeaderTypeDef),
            "::",
            stringify!(Identifier)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IdType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxHeaderTypeDef),
            "::",
            stringify!(IdType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxFrameType) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxHeaderTypeDef),
            "::",
            stringify!(TxFrameType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataLength) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxHeaderTypeDef),
            "::",
            stringify!(DataLength)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorStateIndicator) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxHeaderTypeDef),
            "::",
            stringify!(ErrorStateIndicator)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BitRateSwitch) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxHeaderTypeDef),
            "::",
            stringify!(BitRateSwitch)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FDFormat) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxHeaderTypeDef),
            "::",
            stringify!(FDFormat)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxEventFifoControl) as usize
                - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxHeaderTypeDef),
            "::",
            stringify!(TxEventFifoControl)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MessageMarker) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxHeaderTypeDef),
            "::",
            stringify!(MessageMarker)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_RxHeaderTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_RxHeaderTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_RxHeaderTypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(FDCAN_RxHeaderTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_RxHeaderTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_RxHeaderTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Identifier) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(Identifier)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IdType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(IdType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxFrameType) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(RxFrameType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataLength) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(DataLength)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorStateIndicator) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(ErrorStateIndicator)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BitRateSwitch) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(BitRateSwitch)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FDFormat) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(FDFormat)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxTimestamp) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(RxTimestamp)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterIndex) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(FilterIndex)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IsFilterMatchingFrame) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_RxHeaderTypeDef),
            "::",
            stringify!(IsFilterMatchingFrame)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_TxEventFifoTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_TxEventFifoTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_TxEventFifoTypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(FDCAN_TxEventFifoTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_TxEventFifoTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_TxEventFifoTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Identifier) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(Identifier)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IdType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(IdType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxFrameType) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(TxFrameType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataLength) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(DataLength)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorStateIndicator) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(ErrorStateIndicator)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BitRateSwitch) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(BitRateSwitch)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FDFormat) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(FDFormat)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxTimestamp) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(TxTimestamp)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MessageMarker) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(MessageMarker)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).EventType) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TxEventFifoTypeDef),
            "::",
            stringify!(EventType)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_HpMsgStatusTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_HpMsgStatusTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_HpMsgStatusTypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(FDCAN_HpMsgStatusTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_HpMsgStatusTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_HpMsgStatusTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterList) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HpMsgStatusTypeDef),
            "::",
            stringify!(FilterList)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterIndex) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HpMsgStatusTypeDef),
            "::",
            stringify!(FilterIndex)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MessageStorage) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HpMsgStatusTypeDef),
            "::",
            stringify!(MessageStorage)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MessageIndex) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HpMsgStatusTypeDef),
            "::",
            stringify!(MessageIndex)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_ProtocolStatusTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_ProtocolStatusTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_ProtocolStatusTypeDef>(),
        44usize,
        concat!("Size of: ", stringify!(FDCAN_ProtocolStatusTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_ProtocolStatusTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_ProtocolStatusTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LastErrorCode) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(LastErrorCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataLastErrorCode) as usize
                - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(DataLastErrorCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Activity) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(Activity)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorPassive) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(ErrorPassive)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Warning) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(Warning)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BusOff) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(BusOff)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxESIflag) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(RxESIflag)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxBRSflag) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(RxBRSflag)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxFDFflag) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(RxFDFflag)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ProtocolException) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(ProtocolException)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TDCvalue) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ProtocolStatusTypeDef),
            "::",
            stringify!(TDCvalue)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_ErrorCountersTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_ErrorCountersTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_ErrorCountersTypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(FDCAN_ErrorCountersTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_ErrorCountersTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_ErrorCountersTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxErrorCnt) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ErrorCountersTypeDef),
            "::",
            stringify!(TxErrorCnt)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxErrorCnt) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ErrorCountersTypeDef),
            "::",
            stringify!(RxErrorCnt)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxErrorPassive) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ErrorCountersTypeDef),
            "::",
            stringify!(RxErrorPassive)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorLogging) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_ErrorCountersTypeDef),
            "::",
            stringify!(ErrorLogging)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_TT_ConfigTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_TT_ConfigTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_TT_ConfigTypeDef>(),
        76usize,
        concat!("Size of: ", stringify!(FDCAN_TT_ConfigTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_TT_ConfigTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_TT_ConfigTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OperationMode) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(OperationMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GapEnable) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(GapEnable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TimeMaster) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(TimeMaster)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SyncDevLimit) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(SyncDevLimit)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InitRefTrigOffset) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(InitRefTrigOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExternalClkSync) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(ExternalClkSync)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AppWdgLimit) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(AppWdgLimit)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GlobalTimeFilter) as usize
                - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(GlobalTimeFilter)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ClockCalibration) as usize
                - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(ClockCalibration)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).EvtTrigPolarity) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(EvtTrigPolarity)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BasicCyclesNbr) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(BasicCyclesNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CycleStartSync) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(CycleStartSync)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxEnableWindow) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(TxEnableWindow)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExpTxTrigNbr) as usize - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(ExpTxTrigNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TURNumerator) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(TURNumerator)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TURDenominator) as usize - ptr as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(TURDenominator)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TriggerMemoryNbr) as usize
                - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(TriggerMemoryNbr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).StopWatchTrigSel) as usize
                - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(StopWatchTrigSel)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).EventTrigSel) as usize - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TT_ConfigTypeDef),
            "::",
            stringify!(EventTrigSel)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_TriggerTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_TriggerTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_TriggerTypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(FDCAN_TriggerTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_TriggerTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_TriggerTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TriggerIndex) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(TriggerIndex)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TimeMark) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(TimeMark)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RepeatFactor) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(RepeatFactor)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).StartCycle) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(StartCycle)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TmEventInt) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(TmEventInt)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TmEventExt) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(TmEventExt)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TriggerType) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(TriggerType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterType) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(FilterType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxBufferIndex) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(TxBufferIndex)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FilterIndex) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TriggerTypeDef),
            "::",
            stringify!(FilterIndex)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_TTOperationStatusTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_TTOperationStatusTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_TTOperationStatusTypeDef>(),
        56usize,
        concat!("Size of: ", stringify!(FDCAN_TTOperationStatusTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_TTOperationStatusTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_TTOperationStatusTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorLevel) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(ErrorLevel)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MasterState) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(MasterState)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SyncState) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(SyncState)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GTimeQuality) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(GTimeQuality)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ClockQuality) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(ClockQuality)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RefTrigOffset) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(RefTrigOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GTimeDiscPending) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(GTimeDiscPending)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GapFinished) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(GapFinished)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MasterPriority) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(MasterPriority)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GapStarted) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(GapStarted)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WaitForEvt) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(WaitForEvt)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AppWdgEvt) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(AppWdgEvt)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ECSPending) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(ECSPending)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PhaseLock) as usize - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_TTOperationStatusTypeDef),
            "::",
            stringify!(PhaseLock)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_MsgRamAddressTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_MsgRamAddressTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_MsgRamAddressTypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(FDCAN_MsgRamAddressTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_MsgRamAddressTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_MsgRamAddressTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).StandardFilterSA) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(StandardFilterSA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExtendedFilterSA) as usize
                - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(ExtendedFilterSA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxFIFO0SA) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(RxFIFO0SA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxFIFO1SA) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(RxFIFO1SA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RxBufferSA) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(RxBufferSA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxEventFIFOSA) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(TxEventFIFOSA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxBufferSA) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(TxBufferSA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TxFIFOQSA) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(TxFIFOQSA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TTMemorySA) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(TTMemorySA)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).EndAddress) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_MsgRamAddressTypeDef),
            "::",
            stringify!(EndAddress)
        )
    );
}
#[test]
fn bindgen_test_layout_FDCAN_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_HandleTypeDef>(),
        172usize,
        concat!("Size of: ", stringify!(FDCAN_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FDCAN_HandleTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Instance) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HandleTypeDef),
            "::",
            stringify!(Instance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ttcan) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HandleTypeDef),
            "::",
            stringify!(ttcan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HandleTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).msgRam) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HandleTypeDef),
            "::",
            stringify!(msgRam)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).LatestTxFifoQRequest) as usize
                - ptr as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HandleTypeDef),
            "::",
            stringify!(LatestTxFifoQRequest)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorCode) as usize - ptr as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(FDCAN_HandleTypeDef),
            "::",
            stringify!(ErrorCode)
        )
    );
}
#[test]
fn bindgen_test_layout_FLASH_EraseInitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FLASH_EraseInitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FLASH_EraseInitTypeDef>(),
        20usize,
        concat!("Size of: ", stringify!(FLASH_EraseInitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FLASH_EraseInitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FLASH_EraseInitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TypeErase) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_EraseInitTypeDef),
            "::",
            stringify!(TypeErase)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Banks) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_EraseInitTypeDef),
            "::",
            stringify!(Banks)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Sector) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_EraseInitTypeDef),
            "::",
            stringify!(Sector)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NbSectors) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_EraseInitTypeDef),
            "::",
            stringify!(NbSectors)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).VoltageRange) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_EraseInitTypeDef),
            "::",
            stringify!(VoltageRange)
        )
    );
}
#[test]
fn bindgen_test_layout_FLASH_OBProgramInitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FLASH_OBProgramInitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FLASH_OBProgramInitTypeDef>(),
        68usize,
        concat!("Size of: ", stringify!(FLASH_OBProgramInitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FLASH_OBProgramInitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FLASH_OBProgramInitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OptionType) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(OptionType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WRPState) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(WRPState)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WRPSector) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(WRPSector)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RDPLevel) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(RDPLevel)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BORLevel) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(BORLevel)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).USERType) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(USERType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).USERConfig) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(USERConfig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Banks) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(Banks)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PCROPConfig) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(PCROPConfig)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PCROPStartAddr) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(PCROPStartAddr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PCROPEndAddr) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(PCROPEndAddr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BootConfig) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(BootConfig)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BootAddr0) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(BootAddr0)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BootAddr1) as usize - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(BootAddr1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SecureAreaConfig) as usize
                - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(SecureAreaConfig)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SecureAreaStartAddr) as usize
                - ptr as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(SecureAreaStartAddr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SecureAreaEndAddr) as usize
                - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_OBProgramInitTypeDef),
            "::",
            stringify!(SecureAreaEndAddr)
        )
    );
}
#[test]
fn bindgen_test_layout_FLASH_CRCInitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FLASH_CRCInitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FLASH_CRCInitTypeDef>(),
        28usize,
        concat!("Size of: ", stringify!(FLASH_CRCInitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FLASH_CRCInitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FLASH_CRCInitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TypeCRC) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_CRCInitTypeDef),
            "::",
            stringify!(TypeCRC)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BurstSize) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_CRCInitTypeDef),
            "::",
            stringify!(BurstSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Bank) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_CRCInitTypeDef),
            "::",
            stringify!(Bank)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Sector) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_CRCInitTypeDef),
            "::",
            stringify!(Sector)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NbSectors) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_CRCInitTypeDef),
            "::",
            stringify!(NbSectors)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCStartAddr) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_CRCInitTypeDef),
            "::",
            stringify!(CRCStartAddr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCEndAddr) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_CRCInitTypeDef),
            "::",
            stringify!(CRCEndAddr)
        )
    );
}
#[test]
fn bindgen_test_layout_GPIO_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<GPIO_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<GPIO_InitTypeDef>(),
        20usize,
        concat!("Size of: ", stringify!(GPIO_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<GPIO_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(GPIO_InitTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Pin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_InitTypeDef),
            "::",
            stringify!(Pin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Mode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_InitTypeDef),
            "::",
            stringify!(Mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Pull) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_InitTypeDef),
            "::",
            stringify!(Pull)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Speed) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_InitTypeDef),
            "::",
            stringify!(Speed)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Alternate) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_InitTypeDef),
            "::",
            stringify!(Alternate)
        )
    );
}
#[test]
fn bindgen_test_layout_HASH_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HASH_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HASH_InitTypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(HASH_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<HASH_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(HASH_InitTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataType) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_InitTypeDef),
            "::",
            stringify!(DataType)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).KeySize) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_InitTypeDef),
            "::",
            stringify!(KeySize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pKey) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_InitTypeDef),
            "::",
            stringify!(pKey)
        )
    );
}
#[test]
fn bindgen_test_layout_HASH_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HASH_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HASH_HandleTypeDef>(),
        84usize,
        concat!("Size of: ", stringify!(HASH_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<HASH_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(HASH_HandleTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pHashInBuffPtr) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(pHashInBuffPtr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pHashOutBuffPtr) as usize
                - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(pHashOutBuffPtr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pHashKeyBuffPtr) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(pHashKeyBuffPtr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pHashMsgBuffPtr) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(pHashMsgBuffPtr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HashBuffSize) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(HashBuffSize)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HashInCount) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(HashInCount)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HashITCounter) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(HashITCounter)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HashKeyCount) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(HashKeyCount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Status) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(Status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Phase) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(Phase)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmain) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(hdmain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SuspendRequest) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(SuspendRequest)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DigestCalculationDisable) as usize
                - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(DigestCalculationDisable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NbWordsAlreadyPushed) as usize
                - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(NbWordsAlreadyPushed)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorCode) as usize - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(ErrorCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Accumulation) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(HASH_HandleTypeDef),
            "::",
            stringify!(Accumulation)
        )
    );
}
#[test]
fn bindgen_test_layout_USB_OTG_CfgTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<USB_OTG_CfgTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_CfgTypeDef>(),
        52usize,
        concat!("Size of: ", stringify!(USB_OTG_CfgTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_CfgTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_CfgTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).dev_endpoints) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(dev_endpoints)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Host_channels) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(Host_channels)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).speed) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(speed)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).dma_enable) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(dma_enable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ep0_mps) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(ep0_mps)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).phy_itface) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(phy_itface)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Sof_enable) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(Sof_enable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).low_power_enable) as usize
                - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(low_power_enable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).lpm_enable) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(lpm_enable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).battery_charging_enable) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(battery_charging_enable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).vbus_sensing_enable) as usize
                - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(vbus_sensing_enable)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).use_dedicated_ep1) as usize
                - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(use_dedicated_ep1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).use_external_vbus) as usize
                - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_CfgTypeDef),
            "::",
            stringify!(use_external_vbus)
        )
    );
}
#[test]
fn bindgen_test_layout_USB_OTG_EPTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<USB_OTG_EPTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_EPTypeDef>(),
        28usize,
        concat!("Size of: ", stringify!(USB_OTG_EPTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_EPTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_EPTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_in) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(is_in)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).is_stall) as usize - ptr as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(is_stall)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).data_pid_start) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(data_pid_start)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).even_odd_frame) as usize - ptr as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(even_odd_frame)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_fifo_num) as usize - ptr as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(tx_fifo_num)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).maxpacket) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(maxpacket)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).xfer_buff) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(xfer_buff)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).dma_addr) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(dma_addr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).xfer_len) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(xfer_len)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).xfer_count) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_EPTypeDef),
            "::",
            stringify!(xfer_count)
        )
    );
}
#[test]
fn bindgen_test_layout_USB_OTG_HCTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<USB_OTG_HCTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_HCTypeDef>(),
        44usize,
        concat!("Size of: ", stringify!(USB_OTG_HCTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_HCTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_HCTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).dev_addr) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(dev_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ch_num) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(ch_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ep_num) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(ep_num)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ep_is_in) as usize - ptr as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(ep_is_in)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).speed) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(speed)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).do_ping) as usize - ptr as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(do_ping)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).process_ping) as usize - ptr as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(process_ping)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ep_type) as usize - ptr as usize
        },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(ep_type)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).max_packet) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(max_packet)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).data_pid) as usize - ptr as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(data_pid)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).xfer_buff) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(xfer_buff)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).xfer_len) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(xfer_len)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).xfer_count) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(xfer_count)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).toggle_in) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(toggle_in)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).toggle_out) as usize - ptr as usize
        },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(toggle_out)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).dma_addr) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(dma_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ErrCnt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(ErrCnt)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).urb_state) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(urb_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HCTypeDef),
            "::",
            stringify!(state)
        )
    );
}
#[test]
fn bindgen_test_layout_HCD_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HCD_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HCD_HandleTypeDef>(),
        776usize,
        concat!("Size of: ", stringify!(HCD_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<HCD_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(HCD_HandleTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Instance) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HCD_HandleTypeDef),
            "::",
            stringify!(Instance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HCD_HandleTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hc) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(HCD_HandleTypeDef),
            "::",
            stringify!(hc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(HCD_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        764usize,
        concat!(
            "Offset of field: ",
            stringify!(HCD_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorCode) as usize - ptr as usize
        },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(HCD_HandleTypeDef),
            "::",
            stringify!(ErrorCode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pData) as usize - ptr as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(HCD_HandleTypeDef),
            "::",
            stringify!(pData)
        )
    );
}
#[test]
fn bindgen_test_layout_I2C_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<I2C_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<I2C_InitTypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(I2C_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<I2C_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(I2C_InitTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Timing) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_InitTypeDef),
            "::",
            stringify!(Timing)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OwnAddress1) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_InitTypeDef),
            "::",
            stringify!(OwnAddress1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AddressingMode) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_InitTypeDef),
            "::",
            stringify!(AddressingMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DualAddressMode) as usize
                - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_InitTypeDef),
            "::",
            stringify!(DualAddressMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OwnAddress2) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_InitTypeDef),
            "::",
            stringify!(OwnAddress2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OwnAddress2Masks) as usize
                - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_InitTypeDef),
            "::",
            stringify!(OwnAddress2Masks)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).GeneralCallMode) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_InitTypeDef),
            "::",
            stringify!(GeneralCallMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NoStretchMode) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_InitTypeDef),
            "::",
            stringify!(NoStretchMode)
        )
    );
}
#[test]
fn bindgen_test_layout___I2C_HandleTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<__I2C_HandleTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__I2C_HandleTypeDef>(),
        84usize,
        concat!("Size of: ", stringify!(__I2C_HandleTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<__I2C_HandleTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(__I2C_HandleTypeDef))
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Instance) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(Instance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Init) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(Init)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pBuffPtr) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(pBuffPtr)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferSize) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(XferSize)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferCount) as usize - ptr as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(XferCount)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferOptions) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(XferOptions)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PreviousState) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(PreviousState)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).XferISR) as usize - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(XferISR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmatx) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(hdmatx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmarx) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(hdmarx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(Lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).State) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Mode) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(Mode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ErrorCode) as usize - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(ErrorCode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AddrEventCount) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__I2C_HandleTypeDef),
            "::",
            stringify!(AddrEventCount)
        )
    );
}
#[test]
fn bindgen_test_layout_I2S_InitTypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<I2S_InitTypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<I2S_InitTypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(I2S_InitTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<I2S_InitTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(I2S_InitTypeDef))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(I2S_InitTypeDef),
            "::",
            stringify!(Mode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Standard) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(I2S_InitTypeDef),
            "::",
            stringify!(Standard)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DataFormat) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(I2S_InitTypeDef),
            "::",
            stringify!(DataFormat)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MCLKOutput) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(I2S_InitTypeDef),
            "::",
            stringify!(MCLKOutput)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AudioFreq) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(I2S_InitTypeDef),
            "::",
            stringify!(AudioFreq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CPOL) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(I2S_InitTypeDef),
            "::",
            stringify!(CPOL)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FirstBit) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(I2S_InitTypeDef),
            "::",
            stringify!(FirstBit)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WSInversion) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(I2S_InitTypeDef),
            "::",
            stringify!(WSInversion)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Data24BitAlignment) as usize
                - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(I2S_InitTypeDef),
            "::",
            stringify!(Data24BitAlignment)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MasterKeepIOState) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
