/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_TypeDef {
    pub ISR: u32,
    pub IER: u32,
    pub CR: u32,
    pub CFGR: u32,
    pub CFGR2: u32,
    pub SMPR1: u32,
    pub SMPR2: u32,
    pub PCSEL: u32,
    pub LTR1: u32,
    pub HTR1: u32,
    pub RESERVED1: u32,
    pub RESERVED2: u32,
    pub SQR1: u32,
    pub SQR2: u32,
    pub SQR3: u32,
    pub SQR4: u32,
    pub DR: u32,
    pub RESERVED3: u32,
    pub RESERVED4: u32,
    pub JSQR: u32,
    pub RESERVED5: [u32; 4usize],
    pub OFR1: u32,
    pub OFR2: u32,
    pub OFR3: u32,
    pub OFR4: u32,
    pub RESERVED6: [u32; 4usize],
    pub JDR1: u32,
    pub JDR2: u32,
    pub JDR3: u32,
    pub JDR4: u32,
    pub RESERVED7: [u32; 4usize],
    pub AWD2CR: u32,
    pub AWD3CR: u32,
    pub RESERVED8: u32,
    pub RESERVED9: u32,
    pub LTR2: u32,
    pub HTR2: u32,
    pub LTR3: u32,
    pub HTR3: u32,
    pub DIFSEL: u32,
    pub CALFACT: u32,
    pub CALFACT2: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_Common_TypeDef {
    pub CSR: u32,
    pub RESERVED: u32,
    pub CCR: u32,
    pub CDR: u32,
    pub CDR2: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREFBUF_TypeDef {
    pub CSR: u32,
    pub CCR: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TTCAN_TypeDef {
    pub TTTMC: u32,
    pub TTRMC: u32,
    pub TTOCF: u32,
    pub TTMLM: u32,
    pub TURCF: u32,
    pub TTOCN: u32,
    pub TTGTP: u32,

pub const RCC_APB4LPENR_LPTIM3LPEN_Pos: u32 = 10;
pub const RCC_APB4LPENR_LPTIM3LPEN_Msk: u32 = 1024;
pub const RCC_APB4LPENR_LPTIM3LPEN: u32 = 1024;
pub const RCC_APB4LPENR_LPTIM4LPEN_Pos: u32 = 11;
pub const RCC_APB4LPENR_LPTIM4LPEN_Msk: u32 = 2048;
pub const RCC_APB4LPENR_LPTIM4LPEN: u32 = 2048;
pub const RCC_APB4LPENR_LPTIM5LPEN_Pos: u32 = 12;
pub const RCC_APB4LPENR_LPTIM5LPEN_Msk: u32 = 4096;
pub const RCC_APB4LPENR_LPTIM5LPEN: u32 = 4096;
pub const RCC_APB4LPENR_COMP12LPEN_Pos: u32 = 14;
pub const RCC_APB4LPENR_COMP12LPEN_Msk: u32 = 16384;
pub const RCC_APB4LPENR_COMP12LPEN: u32 = 16384;
pub const RCC_APB4LPENR_VREFLPEN_Pos: u32 = 15;
pub const RCC_APB4LPENR_VREFLPEN_Msk: u32 = 32768;
pub const RCC_APB4LPENR_VREFLPEN: u32 = 32768;
pub const RCC_APB4LPENR_RTCAPBLPEN_Pos: u32 = 16;
pub const RCC_APB4LPENR_RTCAPBLPEN_Msk: u32 = 65536;
pub const RCC_APB4LPENR_RTCAPBLPEN: u32 = 65536;
pub const RCC_APB4LPENR_SAI4LPEN_Pos: u32 = 21;
pub const RCC_APB4LPENR_SAI4LPEN_Msk: u32 = 2097152;
pub const RCC_APB4LPENR_SAI4LPEN: u32 = 2097152;
pub const RCC_RSR_RMVF_Pos: u32 = 16;
pub const RCC_RSR_RMVF_Msk: u32 = 65536;
pub const RCC_RSR_RMVF: u32 = 65536;
pub const RCC_RSR_CPURSTF_Pos: u32 = 17;
pub const RCC_RSR_CPURSTF_Msk: u32 = 131072;
pub const RCC_RSR_CPURSTF: u32 = 131072;
pub const RCC_RSR_D1RSTF_Pos: u32 = 19;
pub const RCC_RSR_D1RSTF_Msk: u32 = 524288;
pub const RCC_RSR_D1RSTF: u32 = 524288;
pub const RCC_RSR_D2RSTF_Pos: u32 = 20;
pub const RCC_RSR_D2RSTF_Msk: u32 = 1048576;
pub const RCC_RSR_D2RSTF: u32 = 1048576;
pub const RCC_RSR_BORRSTF_Pos: u32 = 21;
pub const RCC_RSR_BORRSTF_Msk: u32 = 2097152;
pub const RCC_RSR_BORRSTF: u32 = 2097152;
pub const RCC_RSR_PINRSTF_Pos: u32 = 22;
pub const RCC_RSR_PINRSTF_Msk: u32 = 4194304;
pub const RCC_RSR_PINRSTF: u32 = 4194304;
pub const RCC_RSR_PORRSTF_Pos: u32 = 23;
pub const RCC_RSR_PORRSTF_Msk: u32 = 8388608;
pub const RCC_RSR_PORRSTF: u32 = 8388608;
pub const RCC_RSR_SFTRSTF_Pos: u32 = 24;
pub const RCC_RSR_SFTRSTF_Msk: u32 = 16777216;
pub const RCC_RSR_SFTRSTF: u32 = 16777216;
pub const RCC_RSR_IWDG1RSTF_Pos: u32 = 26;
pub const RCC_RSR_IWDG1RSTF_Msk: u32 = 67108864;
pub const RCC_RSR_IWDG1RSTF: u32 = 67108864;
pub const RCC_RSR_WWDG1RSTF_Pos: u32 = 28;
pub const RCC_RSR_WWDG1RSTF_Msk: u32 = 268435456;
pub const RCC_RSR_WWDG1RSTF: u32 = 268435456;
pub const RCC_RSR_LPWRRSTF_Pos: u32 = 30;
pub const RCC_RSR_LPWRRSTF_Msk: u32 = 1073741824;
pub const RCC_RSR_LPWRRSTF: u32 = 1073741824;
#[test]
fn bindgen_test_layout_ADC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_TypeDef>(),
        204usize,
        "Size of ADC_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_TypeDef>(),
        4usize,
        "Alignment of ADC_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        0usize,
        "Offset of field: ADC_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        4usize,
        "Offset of field: ADC_TypeDef::IER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        8usize,
        "Offset of field: ADC_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        12usize,
        "Offset of field: ADC_TypeDef::CFGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR2) as usize - ptr as usize },
        16usize,
        "Offset of field: ADC_TypeDef::CFGR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SMPR1) as usize - ptr as usize },
        20usize,
        "Offset of field: ADC_TypeDef::SMPR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SMPR2) as usize - ptr as usize },
        24usize,
        "Offset of field: ADC_TypeDef::SMPR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PCSEL) as usize - ptr as usize },
        28usize,
        "Offset of field: ADC_TypeDef::PCSEL"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LTR1) as usize - ptr as usize },
        32usize,
        "Offset of field: ADC_TypeDef::LTR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HTR1) as usize - ptr as usize },
        36usize,
        "Offset of field: ADC_TypeDef::HTR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        40usize,
        "Offset of field: ADC_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        44usize,
        "Offset of field: ADC_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SQR1) as usize - ptr as usize },
        48usize,
        "Offset of field: ADC_TypeDef::SQR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SQR2) as usize - ptr as usize },
        52usize,
        "Offset of field: ADC_TypeDef::SQR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SQR3) as usize - ptr as usize },
        56usize,
        "Offset of field: ADC_TypeDef::SQR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SQR4) as usize - ptr as usize },
        60usize,
        "Offset of field: ADC_TypeDef::SQR4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        64usize,
        "Offset of field: ADC_TypeDef::DR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize
        },
        68usize,
        "Offset of field: ADC_TypeDef::RESERVED3"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize
        },
        72usize,
        "Offset of field: ADC_TypeDef::RESERVED4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JSQR) as usize - ptr as usize },
        76usize,
        "Offset of field: ADC_TypeDef::JSQR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize
        },
        80usize,
        "Offset of field: ADC_TypeDef::RESERVED5"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OFR1) as usize - ptr as usize },
        96usize,
        "Offset of field: ADC_TypeDef::OFR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OFR2) as usize - ptr as usize },
        100usize,
        "Offset of field: ADC_TypeDef::OFR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OFR3) as usize - ptr as usize },
        104usize,
        "Offset of field: ADC_TypeDef::OFR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OFR4) as usize - ptr as usize },
        108usize,
        "Offset of field: ADC_TypeDef::OFR4"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED6) as usize - ptr as usize
        },
        112usize,
        "Offset of field: ADC_TypeDef::RESERVED6"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JDR1) as usize - ptr as usize },
        128usize,
        "Offset of field: ADC_TypeDef::JDR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JDR2) as usize - ptr as usize },
        132usize,
        "Offset of field: ADC_TypeDef::JDR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JDR3) as usize - ptr as usize },
        136usize,
        "Offset of field: ADC_TypeDef::JDR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).JDR4) as usize - ptr as usize },
        140usize,
        "Offset of field: ADC_TypeDef::JDR4"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED7) as usize - ptr as usize
        },
        144usize,
        "Offset of field: ADC_TypeDef::RESERVED7"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AWD2CR) as usize - ptr as usize },
        160usize,
        "Offset of field: ADC_TypeDef::AWD2CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AWD3CR) as usize - ptr as usize },
        164usize,
        "Offset of field: ADC_TypeDef::AWD3CR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED8) as usize - ptr as usize
        },
        168usize,
        "Offset of field: ADC_TypeDef::RESERVED8"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED9) as usize - ptr as usize
        },
        172usize,
        "Offset of field: ADC_TypeDef::RESERVED9"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LTR2) as usize - ptr as usize },
        176usize,
        "Offset of field: ADC_TypeDef::LTR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HTR2) as usize - ptr as usize },
        180usize,
        "Offset of field: ADC_TypeDef::HTR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LTR3) as usize - ptr as usize },
        184usize,
        "Offset of field: ADC_TypeDef::LTR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HTR3) as usize - ptr as usize },
        188usize,
        "Offset of field: ADC_TypeDef::HTR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DIFSEL) as usize - ptr as usize },
        192usize,
        "Offset of field: ADC_TypeDef::DIFSEL"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CALFACT) as usize - ptr as usize
        },
        196usize,
        "Offset of field: ADC_TypeDef::CALFACT"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CALFACT2) as usize - ptr as usize
        },
        200usize,
        "Offset of field: ADC_TypeDef::CALFACT2"
    );
}
#[test]
fn bindgen_test_layout_ADC_Common_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_Common_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_Common_TypeDef>(),
        20usize,
        "Size of ADC_Common_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_Common_TypeDef>(),
        4usize,
        "Alignment of ADC_Common_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSR) as usize - ptr as usize },
        0usize,
        "Offset of field: ADC_Common_TypeDef::CSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED) as usize - ptr as usize
        },
        4usize,
        "Offset of field: ADC_Common_TypeDef::RESERVED"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        8usize,
        "Offset of field: ADC_Common_TypeDef::CCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CDR) as usize - ptr as usize },
        12usize,
        "Offset of field: ADC_Common_TypeDef::CDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CDR2) as usize - ptr as usize },
        16usize,
        "Offset of field: ADC_Common_TypeDef::CDR2"
    );
}
#[test]
fn bindgen_test_layout_VREFBUF_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<VREFBUF_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<VREFBUF_TypeDef>(),
        8usize,
        "Size of VREFBUF_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<VREFBUF_TypeDef>(),
        4usize,
        "Alignment of VREFBUF_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSR) as usize - ptr as usize },
        0usize,
        "Offset of field: VREFBUF_TypeDef::CSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        4usize,
        "Offset of field: VREFBUF_TypeDef::CCR"
    );
}
#[test]
fn bindgen_test_layout_TTCAN_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<TTCAN_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<TTCAN_TypeDef>(),
        516usize,
        "Size of TTCAN_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<TTCAN_TypeDef>(),
        4usize,
        "Alignment of TTCAN_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTTMC) as usize - ptr as usize },
        0usize,
        "Offset of field: TTCAN_TypeDef::TTTMC"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTRMC) as usize - ptr as usize },
        4usize,
        "Offset of field: TTCAN_TypeDef::TTRMC"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTOCF) as usize - ptr as usize },
        8usize,
        "Offset of field: TTCAN_TypeDef::TTOCF"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTMLM) as usize - ptr as usize },
        12usize,
        "Offset of field: TTCAN_TypeDef::TTMLM"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TURCF) as usize - ptr as usize },
        16usize,
        "Offset of field: TTCAN_TypeDef::TURCF"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTOCN) as usize - ptr as usize },
        20usize,
        "Offset of field: TTCAN_TypeDef::TTOCN"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTGTP) as usize - ptr as usize },
        24usize,
        "Offset of field: TTCAN_TypeDef::TTGTP"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTTMK) as usize - ptr as usize },
        28usize,
        "Offset of field: TTCAN_TypeDef::TTTMK"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTIR) as usize - ptr as usize },
        32usize,
        "Offset of field: TTCAN_TypeDef::TTIR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTIE) as usize - ptr as usize },
        36usize,
        "Offset of field: TTCAN_TypeDef::TTIE"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTILS) as usize - ptr as usize },
        40usize,
        "Offset of field: TTCAN_TypeDef::TTILS"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTOST) as usize - ptr as usize },
        44usize,
        "Offset of field: TTCAN_TypeDef::TTOST"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TURNA) as usize - ptr as usize },
        48usize,
        "Offset of field: TTCAN_TypeDef::TURNA"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTLGT) as usize - ptr as usize },
        52usize,
        "Offset of field: TTCAN_TypeDef::TTLGT"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTCTC) as usize - ptr as usize },
        56usize,
        "Offset of field: TTCAN_TypeDef::TTCTC"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTCPT) as usize - ptr as usize },
        60usize,
        "Offset of field: TTCAN_TypeDef::TTCPT"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTCSM) as usize - ptr as usize },
        64usize,
        "Offset of field: TTCAN_TypeDef::TTCSM"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        68usize,
        "Offset of field: TTCAN_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TTTS) as usize - ptr as usize },
        512usize,
        "Offset of field: TTCAN_TypeDef::TTTS"
    );
}
#[test]
fn bindgen_test_layout_FDCAN_ClockCalibrationUnit_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FDCAN_ClockCalibrationUnit_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FDCAN_ClockCalibrationUnit_TypeDef>(),
        24usize,
        "Size of FDCAN_ClockCalibrationUnit_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<FDCAN_ClockCalibrationUnit_TypeDef>(),
        4usize,
        "Alignment of FDCAN_ClockCalibrationUnit_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CREL) as usize - ptr as usize },
        0usize,
        "Offset of field: FDCAN_ClockCalibrationUnit_TypeDef::CREL"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCFG) as usize - ptr as usize },
        4usize,
        "Offset of field: FDCAN_ClockCalibrationUnit_TypeDef::CCFG"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSTAT) as usize - ptr as usize },
        8usize,
        "Offset of field: FDCAN_ClockCalibrationUnit_TypeDef::CSTAT"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CWD) as usize - ptr as usize },
        12usize,
        "Offset of field: FDCAN_ClockCalibrationUnit_TypeDef::CWD"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IR) as usize - ptr as usize },
        16usize,
        "Offset of field: FDCAN_ClockCalibrationUnit_TypeDef::IR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IE) as usize - ptr as usize },
        20usize,
        "Offset of field: FDCAN_ClockCalibrationUnit_TypeDef::IE"
    );
}
#[test]
fn bindgen_test_layout_CEC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<CEC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CEC_TypeDef>(),
        24usize,
        "Size of CEC_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<CEC_TypeDef>(),
        4usize,
        "Alignment of CEC_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: CEC_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        4usize,
        "Offset of field: CEC_TypeDef::CFGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXDR) as usize - ptr as usize },
        8usize,
        "Offset of field: CEC_TypeDef::TXDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXDR) as usize - ptr as usize },
        12usize,
        "Offset of field: CEC_TypeDef::RXDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        16usize,
        "Offset of field: CEC_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        20usize,
        "Offset of field: CEC_TypeDef::IER"
    );
}
#[test]
fn bindgen_test_layout_CRC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<CRC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CRC_TypeDef>(),
        24usize,
        "Size of CRC_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<CRC_TypeDef>(),
        4usize,
        "Alignment of CRC_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        0usize,
        "Offset of field: CRC_TypeDef::DR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IDR) as usize - ptr as usize },
        4usize,
        "Offset of field: CRC_TypeDef::IDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        8usize,
        "Offset of field: CRC_TypeDef::CR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        12usize,
        "Offset of field: CRC_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INIT) as usize - ptr as usize },
        16usize,
        "Offset of field: CRC_TypeDef::INIT"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).POL) as usize - ptr as usize },
        20usize,
        "Offset of field: CRC_TypeDef::POL"
    );
}
#[test]
fn bindgen_test_layout_CRS_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<CRS_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CRS_TypeDef>(),
        16usize,
        "Size of CRS_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<CRS_TypeDef>(),
        4usize,
        "Alignment of CRS_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: CRS_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        4usize,
        "Offset of field: CRS_TypeDef::CFGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        8usize,
        "Offset of field: CRS_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        12usize,
        "Offset of field: CRS_TypeDef::ICR"
    );
}
#[test]
fn bindgen_test_layout_DAC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DAC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DAC_TypeDef>(),
        80usize,
        "Size of DAC_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_TypeDef>(),
        4usize,
        "Alignment of DAC_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: DAC_TypeDef::CR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SWTRIGR) as usize - ptr as usize
        },
        4usize,
        "Offset of field: DAC_TypeDef::SWTRIGR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12R1) as usize - ptr as usize
        },
        8usize,
        "Offset of field: DAC_TypeDef::DHR12R1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12L1) as usize - ptr as usize
        },
        12usize,
        "Offset of field: DAC_TypeDef::DHR12L1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DHR8R1) as usize - ptr as usize },
        16usize,
        "Offset of field: DAC_TypeDef::DHR8R1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12R2) as usize - ptr as usize
        },
        20usize,
        "Offset of field: DAC_TypeDef::DHR12R2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12L2) as usize - ptr as usize
        },
        24usize,
        "Offset of field: DAC_TypeDef::DHR12L2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DHR8R2) as usize - ptr as usize },
        28usize,
        "Offset of field: DAC_TypeDef::DHR8R2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12RD) as usize - ptr as usize
        },
        32usize,
        "Offset of field: DAC_TypeDef::DHR12RD"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DHR12LD) as usize - ptr as usize
        },
        36usize,
        "Offset of field: DAC_TypeDef::DHR12LD"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DHR8RD) as usize - ptr as usize },
        40usize,
        "Offset of field: DAC_TypeDef::DHR8RD"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOR1) as usize - ptr as usize },
        44usize,
        "Offset of field: DAC_TypeDef::DOR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOR2) as usize - ptr as usize },
        48usize,
        "Offset of field: DAC_TypeDef::DOR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        52usize,
        "Offset of field: DAC_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        56usize,
        "Offset of field: DAC_TypeDef::CCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MCR) as usize - ptr as usize },
        60usize,
        "Offset of field: DAC_TypeDef::MCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHSR1) as usize - ptr as usize },
        64usize,
        "Offset of field: DAC_TypeDef::SHSR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHSR2) as usize - ptr as usize },
        68usize,
        "Offset of field: DAC_TypeDef::SHSR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHHR) as usize - ptr as usize },
        72usize,
        "Offset of field: DAC_TypeDef::SHHR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHRR) as usize - ptr as usize },
        76usize,
        "Offset of field: DAC_TypeDef::SHRR"
    );
}
#[test]
fn bindgen_test_layout_DFSDM_Filter_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DFSDM_Filter_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DFSDM_Filter_TypeDef>(),
        60usize,
        "Size of DFSDM_Filter_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DFSDM_Filter_TypeDef>(),
        4usize,
        "Alignment of DFSDM_Filter_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FLTCR1) as usize - ptr as usize },
        0usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTCR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FLTCR2) as usize - ptr as usize },
        4usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTCR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FLTISR) as usize - ptr as usize },
        8usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FLTICR) as usize - ptr as usize },
        12usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTICR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTJCHGR) as usize - ptr as usize
        },
        16usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTJCHGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FLTFCR) as usize - ptr as usize },
        20usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTFCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTJDATAR) as usize - ptr as usize
        },
        24usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTJDATAR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTRDATAR) as usize - ptr as usize
        },
        28usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTRDATAR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTAWHTR) as usize - ptr as usize
        },
        32usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTAWHTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTAWLTR) as usize - ptr as usize
        },
        36usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTAWLTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTAWSR) as usize - ptr as usize
        },
        40usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTAWSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTAWCFR) as usize - ptr as usize
        },
        44usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTAWCFR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTEXMAX) as usize - ptr as usize
        },
        48usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTEXMAX"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTEXMIN) as usize - ptr as usize
        },
        52usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTEXMIN"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTCNVTIMR) as usize - ptr as usize
        },
        56usize,
        "Offset of field: DFSDM_Filter_TypeDef::FLTCNVTIMR"
    );
}
#[test]
fn bindgen_test_layout_DFSDM_Channel_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DFSDM_Channel_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DFSDM_Channel_TypeDef>(),
        20usize,
        "Size of DFSDM_Channel_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DFSDM_Channel_TypeDef>(),
        4usize,
        "Alignment of DFSDM_Channel_TypeDef"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CHCFGR1) as usize - ptr as usize
        },
        0usize,
        "Offset of field: DFSDM_Channel_TypeDef::CHCFGR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CHCFGR2) as usize - ptr as usize
        },
        4usize,
        "Offset of field: DFSDM_Channel_TypeDef::CHCFGR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CHAWSCDR) as usize - ptr as usize
        },
        8usize,
        "Offset of field: DFSDM_Channel_TypeDef::CHAWSCDR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CHWDATAR) as usize - ptr as usize
        },
        12usize,
        "Offset of field: DFSDM_Channel_TypeDef::CHWDATAR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CHDATINR) as usize - ptr as usize
        },
        16usize,
        "Offset of field: DFSDM_Channel_TypeDef::CHDATINR"
    );
}
#[test]
fn bindgen_test_layout_DBGMCU_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DBGMCU_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DBGMCU_TypeDef>(),
        88usize,
        "Size of DBGMCU_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DBGMCU_TypeDef>(),
        4usize,
        "Alignment of DBGMCU_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IDCODE) as usize - ptr as usize },
        0usize,
        "Offset of field: DBGMCU_TypeDef::IDCODE"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        4usize,
        "Offset of field: DBGMCU_TypeDef::CR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize
        },
        8usize,
        "Offset of field: DBGMCU_TypeDef::RESERVED4"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB3FZ1) as usize - ptr as usize
        },
        52usize,
        "Offset of field: DBGMCU_TypeDef::APB3FZ1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize
        },
        56usize,
        "Offset of field: DBGMCU_TypeDef::RESERVED5"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB1LFZ1) as usize - ptr as usize
        },
        60usize,
        "Offset of field: DBGMCU_TypeDef::APB1LFZ1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED6) as usize - ptr as usize
        },
        64usize,
        "Offset of field: DBGMCU_TypeDef::RESERVED6"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB1HFZ1) as usize - ptr as usize
        },
        68usize,
        "Offset of field: DBGMCU_TypeDef::APB1HFZ1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED7) as usize - ptr as usize
        },
        72usize,
        "Offset of field: DBGMCU_TypeDef::RESERVED7"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB2FZ1) as usize - ptr as usize
        },
        76usize,
        "Offset of field: DBGMCU_TypeDef::APB2FZ1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED8) as usize - ptr as usize
        },
        80usize,
        "Offset of field: DBGMCU_TypeDef::RESERVED8"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB4FZ1) as usize - ptr as usize
        },
        84usize,
        "Offset of field: DBGMCU_TypeDef::APB4FZ1"
    );
}
#[test]
fn bindgen_test_layout_DCMI_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DCMI_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DCMI_TypeDef>(),
        44usize,
        "Size of DCMI_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DCMI_TypeDef>(),
        4usize,
        "Alignment of DCMI_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: DCMI_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        4usize,
        "Offset of field: DCMI_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RISR) as usize - ptr as usize },
        8usize,
        "Offset of field: DCMI_TypeDef::RISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        12usize,
        "Offset of field: DCMI_TypeDef::IER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MISR) as usize - ptr as usize },
        16usize,
        "Offset of field: DCMI_TypeDef::MISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        20usize,
        "Offset of field: DCMI_TypeDef::ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ESCR) as usize - ptr as usize },
        24usize,
        "Offset of field: DCMI_TypeDef::ESCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ESUR) as usize - ptr as usize },
        28usize,
        "Offset of field: DCMI_TypeDef::ESUR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CWSTRTR) as usize - ptr as usize
        },
        32usize,
        "Offset of field: DCMI_TypeDef::CWSTRTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CWSIZER) as usize - ptr as usize
        },
        36usize,
        "Offset of field: DCMI_TypeDef::CWSIZER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        40usize,
        "Offset of field: DCMI_TypeDef::DR"
    );
}
#[test]
fn bindgen_test_layout_DMA_Stream_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMA_Stream_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMA_Stream_TypeDef>(),
        24usize,
        "Size of DMA_Stream_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DMA_Stream_TypeDef>(),
        4usize,
        "Alignment of DMA_Stream_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: DMA_Stream_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NDTR) as usize - ptr as usize },
        4usize,
        "Offset of field: DMA_Stream_TypeDef::NDTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PAR) as usize - ptr as usize },
        8usize,
        "Offset of field: DMA_Stream_TypeDef::PAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).M0AR) as usize - ptr as usize },
        12usize,
        "Offset of field: DMA_Stream_TypeDef::M0AR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).M1AR) as usize - ptr as usize },
        16usize,
        "Offset of field: DMA_Stream_TypeDef::M1AR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FCR) as usize - ptr as usize },
        20usize,
        "Offset of field: DMA_Stream_TypeDef::FCR"
    );
}
#[test]
fn bindgen_test_layout_DMA_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMA_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMA_TypeDef>(),
        16usize,
        "Size of DMA_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DMA_TypeDef>(),
        4usize,
        "Alignment of DMA_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LISR) as usize - ptr as usize },
        0usize,
        "Offset of field: DMA_TypeDef::LISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HISR) as usize - ptr as usize },
        4usize,
        "Offset of field: DMA_TypeDef::HISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LIFCR) as usize - ptr as usize },
        8usize,
        "Offset of field: DMA_TypeDef::LIFCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HIFCR) as usize - ptr as usize },
        12usize,
        "Offset of field: DMA_TypeDef::HIFCR"
    );
}
#[test]
fn bindgen_test_layout_BDMA_Channel_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<BDMA_Channel_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<BDMA_Channel_TypeDef>(),
        20usize,
        "Size of BDMA_Channel_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<BDMA_Channel_TypeDef>(),
        4usize,
        "Alignment of BDMA_Channel_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        0usize,
        "Offset of field: BDMA_Channel_TypeDef::CCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CNDTR) as usize - ptr as usize },
        4usize,
        "Offset of field: BDMA_Channel_TypeDef::CNDTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CPAR) as usize - ptr as usize },
        8usize,
        "Offset of field: BDMA_Channel_TypeDef::CPAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CM0AR) as usize - ptr as usize },
        12usize,
        "Offset of field: BDMA_Channel_TypeDef::CM0AR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CM1AR) as usize - ptr as usize },
        16usize,
        "Offset of field: BDMA_Channel_TypeDef::CM1AR"
    );
}
#[test]
fn bindgen_test_layout_BDMA_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<BDMA_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<BDMA_TypeDef>(),
        8usize,
        "Size of BDMA_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<BDMA_TypeDef>(),
        4usize,
        "Alignment of BDMA_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        0usize,
        "Offset of field: BDMA_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IFCR) as usize - ptr as usize },
        4usize,
        "Offset of field: BDMA_TypeDef::IFCR"
    );
}
#[test]
fn bindgen_test_layout_DMAMUX_Channel_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMAMUX_Channel_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMAMUX_Channel_TypeDef>(),
        4usize,
        "Size of DMAMUX_Channel_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DMAMUX_Channel_TypeDef>(),
        4usize,
        "Alignment of DMAMUX_Channel_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        0usize,
        "Offset of field: DMAMUX_Channel_TypeDef::CCR"
    );
}
#[test]
fn bindgen_test_layout_DMAMUX_ChannelStatus_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMAMUX_ChannelStatus_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMAMUX_ChannelStatus_TypeDef>(),
        8usize,
        "Size of DMAMUX_ChannelStatus_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DMAMUX_ChannelStatus_TypeDef>(),
        4usize,
        "Alignment of DMAMUX_ChannelStatus_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSR) as usize - ptr as usize },
        0usize,
        "Offset of field: DMAMUX_ChannelStatus_TypeDef::CSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFR) as usize - ptr as usize },
        4usize,
        "Offset of field: DMAMUX_ChannelStatus_TypeDef::CFR"
    );
}
#[test]
fn bindgen_test_layout_DMAMUX_RequestGen_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMAMUX_RequestGen_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMAMUX_RequestGen_TypeDef>(),
        4usize,
        "Size of DMAMUX_RequestGen_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DMAMUX_RequestGen_TypeDef>(),
        4usize,
        "Alignment of DMAMUX_RequestGen_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RGCR) as usize - ptr as usize },
        0usize,
        "Offset of field: DMAMUX_RequestGen_TypeDef::RGCR"
    );
}
#[test]
fn bindgen_test_layout_DMAMUX_RequestGenStatus_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMAMUX_RequestGenStatus_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMAMUX_RequestGenStatus_TypeDef>(),
        8usize,
        "Size of DMAMUX_RequestGenStatus_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DMAMUX_RequestGenStatus_TypeDef>(),
        4usize,
        "Alignment of DMAMUX_RequestGenStatus_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RGSR) as usize - ptr as usize },
        0usize,
        "Offset of field: DMAMUX_RequestGenStatus_TypeDef::RGSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RGCFR) as usize - ptr as usize },
        4usize,
        "Offset of field: DMAMUX_RequestGenStatus_TypeDef::RGCFR"
    );
}
#[test]
fn bindgen_test_layout_MDMA_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<MDMA_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<MDMA_TypeDef>(),
        4usize,
        "Size of MDMA_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<MDMA_TypeDef>(),
        4usize,
        "Alignment of MDMA_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GISR0) as usize - ptr as usize },
        0usize,
        "Offset of field: MDMA_TypeDef::GISR0"
    );
}
#[test]
fn bindgen_test_layout_MDMA_Channel_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<MDMA_Channel_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<MDMA_Channel_TypeDef>(),
        56usize,
        "Size of MDMA_Channel_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<MDMA_Channel_TypeDef>(),
        4usize,
        "Alignment of MDMA_Channel_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CISR) as usize - ptr as usize },
        0usize,
        "Offset of field: MDMA_Channel_TypeDef::CISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CIFCR) as usize - ptr as usize },
        4usize,
        "Offset of field: MDMA_Channel_TypeDef::CIFCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CESR) as usize - ptr as usize },
        8usize,
        "Offset of field: MDMA_Channel_TypeDef::CESR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        12usize,
        "Offset of field: MDMA_Channel_TypeDef::CCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTCR) as usize - ptr as usize },
        16usize,
        "Offset of field: MDMA_Channel_TypeDef::CTCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CBNDTR) as usize - ptr as usize },
        20usize,
        "Offset of field: MDMA_Channel_TypeDef::CBNDTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSAR) as usize - ptr as usize },
        24usize,
        "Offset of field: MDMA_Channel_TypeDef::CSAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CDAR) as usize - ptr as usize },
        28usize,
        "Offset of field: MDMA_Channel_TypeDef::CDAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CBRUR) as usize - ptr as usize },
        32usize,
        "Offset of field: MDMA_Channel_TypeDef::CBRUR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CLAR) as usize - ptr as usize },
        36usize,
        "Offset of field: MDMA_Channel_TypeDef::CLAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTBR) as usize - ptr as usize },
        40usize,
        "Offset of field: MDMA_Channel_TypeDef::CTBR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        44usize,
        "Offset of field: MDMA_Channel_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMAR) as usize - ptr as usize },
        48usize,
        "Offset of field: MDMA_Channel_TypeDef::CMAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMDR) as usize - ptr as usize },
        52usize,
        "Offset of field: MDMA_Channel_TypeDef::CMDR"
    );
}
#[test]
fn bindgen_test_layout_DMA2D_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DMA2D_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DMA2D_TypeDef>(),
        3072usize,
        "Size of DMA2D_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DMA2D_TypeDef>(),
        4usize,
        "Alignment of DMA2D_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: DMA2D_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        4usize,
        "Offset of field: DMA2D_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IFCR) as usize - ptr as usize },
        8usize,
        "Offset of field: DMA2D_TypeDef::IFCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FGMAR) as usize - ptr as usize },
        12usize,
        "Offset of field: DMA2D_TypeDef::FGMAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FGOR) as usize - ptr as usize },
        16usize,
        "Offset of field: DMA2D_TypeDef::FGOR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BGMAR) as usize - ptr as usize },
        20usize,
        "Offset of field: DMA2D_TypeDef::BGMAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BGOR) as usize - ptr as usize },
        24usize,
        "Offset of field: DMA2D_TypeDef::BGOR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FGPFCCR) as usize - ptr as usize
        },
        28usize,
        "Offset of field: DMA2D_TypeDef::FGPFCCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FGCOLR) as usize - ptr as usize },
        32usize,
        "Offset of field: DMA2D_TypeDef::FGCOLR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BGPFCCR) as usize - ptr as usize
        },
        36usize,
        "Offset of field: DMA2D_TypeDef::BGPFCCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BGCOLR) as usize - ptr as usize },
        40usize,
        "Offset of field: DMA2D_TypeDef::BGCOLR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FGCMAR) as usize - ptr as usize },
        44usize,
        "Offset of field: DMA2D_TypeDef::FGCMAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BGCMAR) as usize - ptr as usize },
        48usize,
        "Offset of field: DMA2D_TypeDef::BGCMAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OPFCCR) as usize - ptr as usize },
        52usize,
        "Offset of field: DMA2D_TypeDef::OPFCCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OCOLR) as usize - ptr as usize },
        56usize,
        "Offset of field: DMA2D_TypeDef::OCOLR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OMAR) as usize - ptr as usize },
        60usize,
        "Offset of field: DMA2D_TypeDef::OMAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OOR) as usize - ptr as usize },
        64usize,
        "Offset of field: DMA2D_TypeDef::OOR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NLR) as usize - ptr as usize },
        68usize,
        "Offset of field: DMA2D_TypeDef::NLR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LWR) as usize - ptr as usize },
        72usize,
        "Offset of field: DMA2D_TypeDef::LWR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AMTCR) as usize - ptr as usize },
        76usize,
        "Offset of field: DMA2D_TypeDef::AMTCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED) as usize - ptr as usize
        },
        80usize,
        "Offset of field: DMA2D_TypeDef::RESERVED"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FGCLUT) as usize - ptr as usize },
        1024usize,
        "Offset of field: DMA2D_TypeDef::FGCLUT"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BGCLUT) as usize - ptr as usize },
        2048usize,
        "Offset of field: DMA2D_TypeDef::BGCLUT"
    );
}
#[test]
fn bindgen_test_layout_ETH_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<ETH_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ETH_TypeDef>(),
        4464usize,
        "Size of ETH_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<ETH_TypeDef>(),
        4usize,
        "Alignment of ETH_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACCR) as usize - ptr as usize },
        0usize,
        "Offset of field: ETH_TypeDef::MACCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACECR) as usize - ptr as usize },
        4usize,
        "Offset of field: ETH_TypeDef::MACECR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACPFR) as usize - ptr as usize },
        8usize,
        "Offset of field: ETH_TypeDef::MACPFR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACWTR) as usize - ptr as usize },
        12usize,
        "Offset of field: ETH_TypeDef::MACWTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACHT0R) as usize - ptr as usize
        },
        16usize,
        "Offset of field: ETH_TypeDef::MACHT0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACHT1R) as usize - ptr as usize
        },
        20usize,
        "Offset of field: ETH_TypeDef::MACHT1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        24usize,
        "Offset of field: ETH_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACVTR) as usize - ptr as usize },
        80usize,
        "Offset of field: ETH_TypeDef::MACVTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        84usize,
        "Offset of field: ETH_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACVHTR) as usize - ptr as usize
        },
        88usize,
        "Offset of field: ETH_TypeDef::MACVHTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize
        },
        92usize,
        "Offset of field: ETH_TypeDef::RESERVED3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACVIR) as usize - ptr as usize },
        96usize,
        "Offset of field: ETH_TypeDef::MACVIR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACIVIR) as usize - ptr as usize
        },
        100usize,
        "Offset of field: ETH_TypeDef::MACIVIR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize
        },
        104usize,
        "Offset of field: ETH_TypeDef::RESERVED4"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTFCR) as usize - ptr as usize
        },
        112usize,
        "Offset of field: ETH_TypeDef::MACTFCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize
        },
        116usize,
        "Offset of field: ETH_TypeDef::RESERVED5"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACRFCR) as usize - ptr as usize
        },
        144usize,
        "Offset of field: ETH_TypeDef::MACRFCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED6) as usize - ptr as usize
        },
        148usize,
        "Offset of field: ETH_TypeDef::RESERVED6"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACISR) as usize - ptr as usize },
        176usize,
        "Offset of field: ETH_TypeDef::MACISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACIER) as usize - ptr as usize },
        180usize,
        "Offset of field: ETH_TypeDef::MACIER"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACRXTXSR) as usize - ptr as usize
        },
        184usize,
        "Offset of field: ETH_TypeDef::MACRXTXSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED7) as usize - ptr as usize
        },
        188usize,
        "Offset of field: ETH_TypeDef::RESERVED7"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACPCSR) as usize - ptr as usize
        },
        192usize,
        "Offset of field: ETH_TypeDef::MACPCSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACRWKPFR) as usize - ptr as usize
        },
        196usize,
        "Offset of field: ETH_TypeDef::MACRWKPFR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED8) as usize - ptr as usize
        },
        200usize,
        "Offset of field: ETH_TypeDef::RESERVED8"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACLCSR) as usize - ptr as usize
        },
        208usize,
        "Offset of field: ETH_TypeDef::MACLCSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACLTCR) as usize - ptr as usize
        },
        212usize,
        "Offset of field: ETH_TypeDef::MACLTCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACLETR) as usize - ptr as usize
        },
        216usize,
        "Offset of field: ETH_TypeDef::MACLETR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MAC1USTCR) as usize - ptr as usize
        },
        220usize,
        "Offset of field: ETH_TypeDef::MAC1USTCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED9) as usize - ptr as usize
        },
        224usize,
        "Offset of field: ETH_TypeDef::RESERVED9"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACVR) as usize - ptr as usize },
        272usize,
        "Offset of field: ETH_TypeDef::MACVR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACDR) as usize - ptr as usize },
        276usize,
        "Offset of field: ETH_TypeDef::MACDR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED10) as usize - ptr as usize
        },
        280usize,
        "Offset of field: ETH_TypeDef::RESERVED10"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACHWF0R) as usize - ptr as usize
        },
        284usize,
        "Offset of field: ETH_TypeDef::MACHWF0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACHWF1R) as usize - ptr as usize
        },
        288usize,
        "Offset of field: ETH_TypeDef::MACHWF1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACHWF2R) as usize - ptr as usize
        },
        292usize,
        "Offset of field: ETH_TypeDef::MACHWF2R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED11) as usize - ptr as usize
        },
        296usize,
        "Offset of field: ETH_TypeDef::RESERVED11"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACMDIOAR) as usize - ptr as usize
        },
        512usize,
        "Offset of field: ETH_TypeDef::MACMDIOAR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACMDIODR) as usize - ptr as usize
        },
        516usize,
        "Offset of field: ETH_TypeDef::MACMDIODR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED12) as usize - ptr as usize
        },
        520usize,
        "Offset of field: ETH_TypeDef::RESERVED12"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACARPAR) as usize - ptr as usize
        },
        528usize,
        "Offset of field: ETH_TypeDef::MACARPAR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED13) as usize - ptr as usize
        },
        532usize,
        "Offset of field: ETH_TypeDef::RESERVED13"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACA0HR) as usize - ptr as usize
        },
        768usize,
        "Offset of field: ETH_TypeDef::MACA0HR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACA0LR) as usize - ptr as usize
        },
        772usize,
        "Offset of field: ETH_TypeDef::MACA0LR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACA1HR) as usize - ptr as usize
        },
        776usize,
        "Offset of field: ETH_TypeDef::MACA1HR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACA1LR) as usize - ptr as usize
        },
        780usize,
        "Offset of field: ETH_TypeDef::MACA1LR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACA2HR) as usize - ptr as usize
        },
        784usize,
        "Offset of field: ETH_TypeDef::MACA2HR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACA2LR) as usize - ptr as usize
        },
        788usize,
        "Offset of field: ETH_TypeDef::MACA2LR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACA3HR) as usize - ptr as usize
        },
        792usize,
        "Offset of field: ETH_TypeDef::MACA3HR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACA3LR) as usize - ptr as usize
        },
        796usize,
        "Offset of field: ETH_TypeDef::MACA3LR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED14) as usize - ptr as usize
        },
        800usize,
        "Offset of field: ETH_TypeDef::RESERVED14"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MMCCR) as usize - ptr as usize },
        1792usize,
        "Offset of field: ETH_TypeDef::MMCCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MMCRIR) as usize - ptr as usize },
        1796usize,
        "Offset of field: ETH_TypeDef::MMCRIR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MMCTIR) as usize - ptr as usize },
        1800usize,
        "Offset of field: ETH_TypeDef::MMCTIR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCRIMR) as usize - ptr as usize
        },
        1804usize,
        "Offset of field: ETH_TypeDef::MMCRIMR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCTIMR) as usize - ptr as usize
        },
        1808usize,
        "Offset of field: ETH_TypeDef::MMCTIMR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED15) as usize - ptr as usize
        },
        1812usize,
        "Offset of field: ETH_TypeDef::RESERVED15"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCTSCGPR) as usize - ptr as usize
        },
        1868usize,
        "Offset of field: ETH_TypeDef::MMCTSCGPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCTMCGPR) as usize - ptr as usize
        },
        1872usize,
        "Offset of field: ETH_TypeDef::MMCTMCGPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED16) as usize - ptr as usize
        },
        1876usize,
        "Offset of field: ETH_TypeDef::RESERVED16"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCTPCGR) as usize - ptr as usize
        },
        1896usize,
        "Offset of field: ETH_TypeDef::MMCTPCGR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED17) as usize - ptr as usize
        },
        1900usize,
        "Offset of field: ETH_TypeDef::RESERVED17"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCRCRCEPR) as usize - ptr as usize
        },
        1940usize,
        "Offset of field: ETH_TypeDef::MMCRCRCEPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCRAEPR) as usize - ptr as usize
        },
        1944usize,
        "Offset of field: ETH_TypeDef::MMCRAEPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED18) as usize - ptr as usize
        },
        1948usize,
        "Offset of field: ETH_TypeDef::RESERVED18"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCRUPGR) as usize - ptr as usize
        },
        1988usize,
        "Offset of field: ETH_TypeDef::MMCRUPGR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED19) as usize - ptr as usize
        },
        1992usize,
        "Offset of field: ETH_TypeDef::RESERVED19"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCTLPIMSTR) as usize - ptr as usize
        },
        2028usize,
        "Offset of field: ETH_TypeDef::MMCTLPIMSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCTLPITCR) as usize - ptr as usize
        },
        2032usize,
        "Offset of field: ETH_TypeDef::MMCTLPITCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCRLPIMSTR) as usize - ptr as usize
        },
        2036usize,
        "Offset of field: ETH_TypeDef::MMCRLPIMSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MMCRLPITCR) as usize - ptr as usize
        },
        2040usize,
        "Offset of field: ETH_TypeDef::MMCRLPITCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED20) as usize - ptr as usize
        },
        2044usize,
        "Offset of field: ETH_TypeDef::RESERVED20"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3L4C0R) as usize - ptr as usize
        },
        2304usize,
        "Offset of field: ETH_TypeDef::MACL3L4C0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL4A0R) as usize - ptr as usize
        },
        2308usize,
        "Offset of field: ETH_TypeDef::MACL4A0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED21) as usize - ptr as usize
        },
        2312usize,
        "Offset of field: ETH_TypeDef::RESERVED21"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3A0R0R) as usize - ptr as usize
        },
        2320usize,
        "Offset of field: ETH_TypeDef::MACL3A0R0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3A1R0R) as usize - ptr as usize
        },
        2324usize,
        "Offset of field: ETH_TypeDef::MACL3A1R0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3A2R0R) as usize - ptr as usize
        },
        2328usize,
        "Offset of field: ETH_TypeDef::MACL3A2R0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3A3R0R) as usize - ptr as usize
        },
        2332usize,
        "Offset of field: ETH_TypeDef::MACL3A3R0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED22) as usize - ptr as usize
        },
        2336usize,
        "Offset of field: ETH_TypeDef::RESERVED22"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3L4C1R) as usize - ptr as usize
        },
        2352usize,
        "Offset of field: ETH_TypeDef::MACL3L4C1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL4A1R) as usize - ptr as usize
        },
        2356usize,
        "Offset of field: ETH_TypeDef::MACL4A1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED23) as usize - ptr as usize
        },
        2360usize,
        "Offset of field: ETH_TypeDef::RESERVED23"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3A0R1R) as usize - ptr as usize
        },
        2368usize,
        "Offset of field: ETH_TypeDef::MACL3A0R1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3A1R1R) as usize - ptr as usize
        },
        2372usize,
        "Offset of field: ETH_TypeDef::MACL3A1R1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3A2R1R) as usize - ptr as usize
        },
        2376usize,
        "Offset of field: ETH_TypeDef::MACL3A2R1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACL3A3R1R) as usize - ptr as usize
        },
        2380usize,
        "Offset of field: ETH_TypeDef::MACL3A3R1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED24) as usize - ptr as usize
        },
        2384usize,
        "Offset of field: ETH_TypeDef::RESERVED24"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTSCR) as usize - ptr as usize
        },
        2816usize,
        "Offset of field: ETH_TypeDef::MACTSCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACSSIR) as usize - ptr as usize
        },
        2820usize,
        "Offset of field: ETH_TypeDef::MACSSIR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACSTSR) as usize - ptr as usize
        },
        2824usize,
        "Offset of field: ETH_TypeDef::MACSTSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACSTNR) as usize - ptr as usize
        },
        2828usize,
        "Offset of field: ETH_TypeDef::MACSTNR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACSTSUR) as usize - ptr as usize
        },
        2832usize,
        "Offset of field: ETH_TypeDef::MACSTSUR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACSTNUR) as usize - ptr as usize
        },
        2836usize,
        "Offset of field: ETH_TypeDef::MACSTNUR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTSAR) as usize - ptr as usize
        },
        2840usize,
        "Offset of field: ETH_TypeDef::MACTSAR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED25) as usize - ptr as usize
        },
        2844usize,
        "Offset of field: ETH_TypeDef::RESERVED25"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTSSR) as usize - ptr as usize
        },
        2848usize,
        "Offset of field: ETH_TypeDef::MACTSSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED26) as usize - ptr as usize
        },
        2852usize,
        "Offset of field: ETH_TypeDef::RESERVED26"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTTSSNR) as usize - ptr as usize
        },
        2864usize,
        "Offset of field: ETH_TypeDef::MACTTSSNR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTTSSSR) as usize - ptr as usize
        },
        2868usize,
        "Offset of field: ETH_TypeDef::MACTTSSSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED27) as usize - ptr as usize
        },
        2872usize,
        "Offset of field: ETH_TypeDef::RESERVED27"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MACACR) as usize - ptr as usize },
        2880usize,
        "Offset of field: ETH_TypeDef::MACACR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED28) as usize - ptr as usize
        },
        2884usize,
        "Offset of field: ETH_TypeDef::RESERVED28"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACATSNR) as usize - ptr as usize
        },
        2888usize,
        "Offset of field: ETH_TypeDef::MACATSNR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACATSSR) as usize - ptr as usize
        },
        2892usize,
        "Offset of field: ETH_TypeDef::MACATSSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTSIACR) as usize - ptr as usize
        },
        2896usize,
        "Offset of field: ETH_TypeDef::MACTSIACR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTSEACR) as usize - ptr as usize
        },
        2900usize,
        "Offset of field: ETH_TypeDef::MACTSEACR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTSICNR) as usize - ptr as usize
        },
        2904usize,
        "Offset of field: ETH_TypeDef::MACTSICNR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACTSECNR) as usize - ptr as usize
        },
        2908usize,
        "Offset of field: ETH_TypeDef::MACTSECNR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED29) as usize - ptr as usize
        },
        2912usize,
        "Offset of field: ETH_TypeDef::RESERVED29"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACPPSCR) as usize - ptr as usize
        },
        2928usize,
        "Offset of field: ETH_TypeDef::MACPPSCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED30) as usize - ptr as usize
        },
        2932usize,
        "Offset of field: ETH_TypeDef::RESERVED30"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACPPSTTSR) as usize - ptr as usize
        },
        2944usize,
        "Offset of field: ETH_TypeDef::MACPPSTTSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACPPSTTNR) as usize - ptr as usize
        },
        2948usize,
        "Offset of field: ETH_TypeDef::MACPPSTTNR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACPPSIR) as usize - ptr as usize
        },
        2952usize,
        "Offset of field: ETH_TypeDef::MACPPSIR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACPPSWR) as usize - ptr as usize
        },
        2956usize,
        "Offset of field: ETH_TypeDef::MACPPSWR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED31) as usize - ptr as usize
        },
        2960usize,
        "Offset of field: ETH_TypeDef::RESERVED31"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACPOCR) as usize - ptr as usize
        },
        3008usize,
        "Offset of field: ETH_TypeDef::MACPOCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACSPI0R) as usize - ptr as usize
        },
        3012usize,
        "Offset of field: ETH_TypeDef::MACSPI0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACSPI1R) as usize - ptr as usize
        },
        3016usize,
        "Offset of field: ETH_TypeDef::MACSPI1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACSPI2R) as usize - ptr as usize
        },
        3020usize,
        "Offset of field: ETH_TypeDef::MACSPI2R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MACLMIR) as usize - ptr as usize
        },
        3024usize,
        "Offset of field: ETH_TypeDef::MACLMIR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED32) as usize - ptr as usize
        },
        3028usize,
        "Offset of field: ETH_TypeDef::RESERVED32"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MTLOMR) as usize - ptr as usize },
        3072usize,
        "Offset of field: ETH_TypeDef::MTLOMR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED33) as usize - ptr as usize
        },
        3076usize,
        "Offset of field: ETH_TypeDef::RESERVED33"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MTLISR) as usize - ptr as usize },
        3104usize,
        "Offset of field: ETH_TypeDef::MTLISR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED34) as usize - ptr as usize
        },
        3108usize,
        "Offset of field: ETH_TypeDef::RESERVED34"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MTLTQOMR) as usize - ptr as usize
        },
        3328usize,
        "Offset of field: ETH_TypeDef::MTLTQOMR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MTLTQUR) as usize - ptr as usize
        },
        3332usize,
        "Offset of field: ETH_TypeDef::MTLTQUR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MTLTQDR) as usize - ptr as usize
        },
        3336usize,
        "Offset of field: ETH_TypeDef::MTLTQDR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED35) as usize - ptr as usize
        },
        3340usize,
        "Offset of field: ETH_TypeDef::RESERVED35"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MTLQICSR) as usize - ptr as usize
        },
        3372usize,
        "Offset of field: ETH_TypeDef::MTLQICSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MTLRQOMR) as usize - ptr as usize
        },
        3376usize,
        "Offset of field: ETH_TypeDef::MTLRQOMR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MTLRQMPOCR) as usize - ptr as usize
        },
        3380usize,
        "Offset of field: ETH_TypeDef::MTLRQMPOCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MTLRQDR) as usize - ptr as usize
        },
        3384usize,
        "Offset of field: ETH_TypeDef::MTLRQDR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED36) as usize - ptr as usize
        },
        3388usize,
        "Offset of field: ETH_TypeDef::RESERVED36"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DMAMR) as usize - ptr as usize },
        4096usize,
        "Offset of field: ETH_TypeDef::DMAMR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMASBMR) as usize - ptr as usize
        },
        4100usize,
        "Offset of field: ETH_TypeDef::DMASBMR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DMAISR) as usize - ptr as usize },
        4104usize,
        "Offset of field: ETH_TypeDef::DMAISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DMADSR) as usize - ptr as usize },
        4108usize,
        "Offset of field: ETH_TypeDef::DMADSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED37) as usize - ptr as usize
        },
        4112usize,
        "Offset of field: ETH_TypeDef::RESERVED37"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DMACCR) as usize - ptr as usize },
        4352usize,
        "Offset of field: ETH_TypeDef::DMACCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACTCR) as usize - ptr as usize
        },
        4356usize,
        "Offset of field: ETH_TypeDef::DMACTCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACRCR) as usize - ptr as usize
        },
        4360usize,
        "Offset of field: ETH_TypeDef::DMACRCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED38) as usize - ptr as usize
        },
        4364usize,
        "Offset of field: ETH_TypeDef::RESERVED38"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACTDLAR) as usize - ptr as usize
        },
        4372usize,
        "Offset of field: ETH_TypeDef::DMACTDLAR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED39) as usize - ptr as usize
        },
        4376usize,
        "Offset of field: ETH_TypeDef::RESERVED39"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACRDLAR) as usize - ptr as usize
        },
        4380usize,
        "Offset of field: ETH_TypeDef::DMACRDLAR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACTDTPR) as usize - ptr as usize
        },
        4384usize,
        "Offset of field: ETH_TypeDef::DMACTDTPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED40) as usize - ptr as usize
        },
        4388usize,
        "Offset of field: ETH_TypeDef::RESERVED40"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACRDTPR) as usize - ptr as usize
        },
        4392usize,
        "Offset of field: ETH_TypeDef::DMACRDTPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACTDRLR) as usize - ptr as usize
        },
        4396usize,
        "Offset of field: ETH_TypeDef::DMACTDRLR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACRDRLR) as usize - ptr as usize
        },
        4400usize,
        "Offset of field: ETH_TypeDef::DMACRDRLR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACIER) as usize - ptr as usize
        },
        4404usize,
        "Offset of field: ETH_TypeDef::DMACIER"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACRIWTR) as usize - ptr as usize
        },
        4408usize,
        "Offset of field: ETH_TypeDef::DMACRIWTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACSFCSR) as usize - ptr as usize
        },
        4412usize,
        "Offset of field: ETH_TypeDef::DMACSFCSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED41) as usize - ptr as usize
        },
        4416usize,
        "Offset of field: ETH_TypeDef::RESERVED41"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACCATDR) as usize - ptr as usize
        },
        4420usize,
        "Offset of field: ETH_TypeDef::DMACCATDR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED42) as usize - ptr as usize
        },
        4424usize,
        "Offset of field: ETH_TypeDef::RESERVED42"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACCARDR) as usize - ptr as usize
        },
        4428usize,
        "Offset of field: ETH_TypeDef::DMACCARDR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED43) as usize - ptr as usize
        },
        4432usize,
        "Offset of field: ETH_TypeDef::RESERVED43"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACCATBR) as usize - ptr as usize
        },
        4436usize,
        "Offset of field: ETH_TypeDef::DMACCATBR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED44) as usize - ptr as usize
        },
        4440usize,
        "Offset of field: ETH_TypeDef::RESERVED44"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACCARBR) as usize - ptr as usize
        },
        4444usize,
        "Offset of field: ETH_TypeDef::DMACCARBR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DMACSR) as usize - ptr as usize },
        4448usize,
        "Offset of field: ETH_TypeDef::DMACSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED45) as usize - ptr as usize
        },
        4452usize,
        "Offset of field: ETH_TypeDef::RESERVED45"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DMACMFCR) as usize - ptr as usize
        },
        4460usize,
        "Offset of field: ETH_TypeDef::DMACMFCR"
    );
}
#[test]
fn bindgen_test_layout_EXTI_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<EXTI_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<EXTI_TypeDef>(),
        172usize,
        "Size of EXTI_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<EXTI_TypeDef>(),
        4usize,
        "Alignment of EXTI_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RTSR1) as usize - ptr as usize },
        0usize,
        "Offset of field: EXTI_TypeDef::RTSR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FTSR1) as usize - ptr as usize },
        4usize,
        "Offset of field: EXTI_TypeDef::FTSR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SWIER1) as usize - ptr as usize },
        8usize,
        "Offset of field: EXTI_TypeDef::SWIER1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).D3PMR1) as usize - ptr as usize },
        12usize,
        "Offset of field: EXTI_TypeDef::D3PMR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D3PCR1L) as usize - ptr as usize
        },
        16usize,
        "Offset of field: EXTI_TypeDef::D3PCR1L"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D3PCR1H) as usize - ptr as usize
        },
        20usize,
        "Offset of field: EXTI_TypeDef::D3PCR1H"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        24usize,
        "Offset of field: EXTI_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RTSR2) as usize - ptr as usize },
        32usize,
        "Offset of field: EXTI_TypeDef::RTSR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FTSR2) as usize - ptr as usize },
        36usize,
        "Offset of field: EXTI_TypeDef::FTSR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SWIER2) as usize - ptr as usize },
        40usize,
        "Offset of field: EXTI_TypeDef::SWIER2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).D3PMR2) as usize - ptr as usize },
        44usize,
        "Offset of field: EXTI_TypeDef::D3PMR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D3PCR2L) as usize - ptr as usize
        },
        48usize,
        "Offset of field: EXTI_TypeDef::D3PCR2L"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D3PCR2H) as usize - ptr as usize
        },
        52usize,
        "Offset of field: EXTI_TypeDef::D3PCR2H"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        56usize,
        "Offset of field: EXTI_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RTSR3) as usize - ptr as usize },
        64usize,
        "Offset of field: EXTI_TypeDef::RTSR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FTSR3) as usize - ptr as usize },
        68usize,
        "Offset of field: EXTI_TypeDef::FTSR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SWIER3) as usize - ptr as usize },
        72usize,
        "Offset of field: EXTI_TypeDef::SWIER3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).D3PMR3) as usize - ptr as usize },
        76usize,
        "Offset of field: EXTI_TypeDef::D3PMR3"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D3PCR3L) as usize - ptr as usize
        },
        80usize,
        "Offset of field: EXTI_TypeDef::D3PCR3L"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D3PCR3H) as usize - ptr as usize
        },
        84usize,
        "Offset of field: EXTI_TypeDef::D3PCR3H"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize
        },
        88usize,
        "Offset of field: EXTI_TypeDef::RESERVED3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMR1) as usize - ptr as usize },
        128usize,
        "Offset of field: EXTI_TypeDef::IMR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EMR1) as usize - ptr as usize },
        132usize,
        "Offset of field: EXTI_TypeDef::EMR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PR1) as usize - ptr as usize },
        136usize,
        "Offset of field: EXTI_TypeDef::PR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize
        },
        140usize,
        "Offset of field: EXTI_TypeDef::RESERVED4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMR2) as usize - ptr as usize },
        144usize,
        "Offset of field: EXTI_TypeDef::IMR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EMR2) as usize - ptr as usize },
        148usize,
        "Offset of field: EXTI_TypeDef::EMR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PR2) as usize - ptr as usize },
        152usize,
        "Offset of field: EXTI_TypeDef::PR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize
        },
        156usize,
        "Offset of field: EXTI_TypeDef::RESERVED5"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMR3) as usize - ptr as usize },
        160usize,
        "Offset of field: EXTI_TypeDef::IMR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EMR3) as usize - ptr as usize },
        164usize,
        "Offset of field: EXTI_TypeDef::EMR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PR3) as usize - ptr as usize },
        168usize,
        "Offset of field: EXTI_TypeDef::PR3"
    );
}
#[test]
fn bindgen_test_layout_EXTI_Core_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<EXTI_Core_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<EXTI_Core_TypeDef>(),
        44usize,
        "Size of EXTI_Core_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<EXTI_Core_TypeDef>(),
        4usize,
        "Alignment of EXTI_Core_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMR1) as usize - ptr as usize },
        0usize,
        "Offset of field: EXTI_Core_TypeDef::IMR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EMR1) as usize - ptr as usize },
        4usize,
        "Offset of field: EXTI_Core_TypeDef::EMR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PR1) as usize - ptr as usize },
        8usize,
        "Offset of field: EXTI_Core_TypeDef::PR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        12usize,
        "Offset of field: EXTI_Core_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMR2) as usize - ptr as usize },
        16usize,
        "Offset of field: EXTI_Core_TypeDef::IMR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EMR2) as usize - ptr as usize },
        20usize,
        "Offset of field: EXTI_Core_TypeDef::EMR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PR2) as usize - ptr as usize },
        24usize,
        "Offset of field: EXTI_Core_TypeDef::PR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        28usize,
        "Offset of field: EXTI_Core_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMR3) as usize - ptr as usize },
        32usize,
        "Offset of field: EXTI_Core_TypeDef::IMR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EMR3) as usize - ptr as usize },
        36usize,
        "Offset of field: EXTI_Core_TypeDef::EMR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PR3) as usize - ptr as usize },
        40usize,
        "Offset of field: EXTI_Core_TypeDef::PR3"
    );
}
#[test]
fn bindgen_test_layout_FLASH_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FLASH_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FLASH_TypeDef>(),
        356usize,
        "Size of FLASH_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<FLASH_TypeDef>(),
        4usize,
        "Alignment of FLASH_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ACR) as usize - ptr as usize },
        0usize,
        "Offset of field: FLASH_TypeDef::ACR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).KEYR1) as usize - ptr as usize },
        4usize,
        "Offset of field: FLASH_TypeDef::KEYR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OPTKEYR) as usize - ptr as usize
        },
        8usize,
        "Offset of field: FLASH_TypeDef::OPTKEYR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        12usize,
        "Offset of field: FLASH_TypeDef::CR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR1) as usize - ptr as usize },
        16usize,
        "Offset of field: FLASH_TypeDef::SR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR1) as usize - ptr as usize },
        20usize,
        "Offset of field: FLASH_TypeDef::CCR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OPTCR) as usize - ptr as usize },
        24usize,
        "Offset of field: FLASH_TypeDef::OPTCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OPTSR_CUR) as usize - ptr as usize
        },
        28usize,
        "Offset of field: FLASH_TypeDef::OPTSR_CUR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OPTSR_PRG) as usize - ptr as usize
        },
        32usize,
        "Offset of field: FLASH_TypeDef::OPTSR_PRG"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OPTCCR) as usize - ptr as usize },
        36usize,
        "Offset of field: FLASH_TypeDef::OPTCCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PRAR_CUR1) as usize - ptr as usize
        },
        40usize,
        "Offset of field: FLASH_TypeDef::PRAR_CUR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PRAR_PRG1) as usize - ptr as usize
        },
        44usize,
        "Offset of field: FLASH_TypeDef::PRAR_PRG1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SCAR_CUR1) as usize - ptr as usize
        },
        48usize,
        "Offset of field: FLASH_TypeDef::SCAR_CUR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SCAR_PRG1) as usize - ptr as usize
        },
        52usize,
        "Offset of field: FLASH_TypeDef::SCAR_PRG1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WPSN_CUR1) as usize - ptr as usize
        },
        56usize,
        "Offset of field: FLASH_TypeDef::WPSN_CUR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WPSN_PRG1) as usize - ptr as usize
        },
        60usize,
        "Offset of field: FLASH_TypeDef::WPSN_PRG1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BOOT_CUR) as usize - ptr as usize
        },
        64usize,
        "Offset of field: FLASH_TypeDef::BOOT_CUR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BOOT_PRG) as usize - ptr as usize
        },
        68usize,
        "Offset of field: FLASH_TypeDef::BOOT_PRG"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        72usize,
        "Offset of field: FLASH_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CRCCR1) as usize - ptr as usize },
        80usize,
        "Offset of field: FLASH_TypeDef::CRCCR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCSADD1) as usize - ptr as usize
        },
        84usize,
        "Offset of field: FLASH_TypeDef::CRCSADD1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCEADD1) as usize - ptr as usize
        },
        88usize,
        "Offset of field: FLASH_TypeDef::CRCEADD1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCDATA) as usize - ptr as usize
        },
        92usize,
        "Offset of field: FLASH_TypeDef::CRCDATA"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ECC_FA1) as usize - ptr as usize
        },
        96usize,
        "Offset of field: FLASH_TypeDef::ECC_FA1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        100usize,
        "Offset of field: FLASH_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).KEYR2) as usize - ptr as usize },
        260usize,
        "Offset of field: FLASH_TypeDef::KEYR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        264usize,
        "Offset of field: FLASH_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        268usize,
        "Offset of field: FLASH_TypeDef::CR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR2) as usize - ptr as usize },
        272usize,
        "Offset of field: FLASH_TypeDef::SR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR2) as usize - ptr as usize },
        276usize,
        "Offset of field: FLASH_TypeDef::CCR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize
        },
        280usize,
        "Offset of field: FLASH_TypeDef::RESERVED3"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PRAR_CUR2) as usize - ptr as usize
        },
        296usize,
        "Offset of field: FLASH_TypeDef::PRAR_CUR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PRAR_PRG2) as usize - ptr as usize
        },
        300usize,
        "Offset of field: FLASH_TypeDef::PRAR_PRG2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SCAR_CUR2) as usize - ptr as usize
        },
        304usize,
        "Offset of field: FLASH_TypeDef::SCAR_CUR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SCAR_PRG2) as usize - ptr as usize
        },
        308usize,
        "Offset of field: FLASH_TypeDef::SCAR_PRG2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WPSN_CUR2) as usize - ptr as usize
        },
        312usize,
        "Offset of field: FLASH_TypeDef::WPSN_CUR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WPSN_PRG2) as usize - ptr as usize
        },
        316usize,
        "Offset of field: FLASH_TypeDef::WPSN_PRG2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize
        },
        320usize,
        "Offset of field: FLASH_TypeDef::RESERVED4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CRCCR2) as usize - ptr as usize },
        336usize,
        "Offset of field: FLASH_TypeDef::CRCCR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCSADD2) as usize - ptr as usize
        },
        340usize,
        "Offset of field: FLASH_TypeDef::CRCSADD2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCEADD2) as usize - ptr as usize
        },
        344usize,
        "Offset of field: FLASH_TypeDef::CRCEADD2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCDATA2) as usize - ptr as usize
        },
        348usize,
        "Offset of field: FLASH_TypeDef::CRCDATA2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ECC_FA2) as usize - ptr as usize
        },
        352usize,
        "Offset of field: FLASH_TypeDef::ECC_FA2"
    );
}
#[test]
fn bindgen_test_layout_FMC_Bank1_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FMC_Bank1_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FMC_Bank1_TypeDef>(),
        32usize,
        "Size of FMC_Bank1_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<FMC_Bank1_TypeDef>(),
        4usize,
        "Alignment of FMC_Bank1_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BTCR) as usize - ptr as usize },
        0usize,
        "Offset of field: FMC_Bank1_TypeDef::BTCR"
    );
}
#[test]
fn bindgen_test_layout_FMC_Bank1E_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FMC_Bank1E_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FMC_Bank1E_TypeDef>(),
        28usize,
        "Size of FMC_Bank1E_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<FMC_Bank1E_TypeDef>(),
        4usize,
        "Alignment of FMC_Bank1E_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BWTR) as usize - ptr as usize },
        0usize,
        "Offset of field: FMC_Bank1E_TypeDef::BWTR"
    );
}
#[test]
fn bindgen_test_layout_FMC_Bank2_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FMC_Bank2_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FMC_Bank2_TypeDef>(),
        24usize,
        "Size of FMC_Bank2_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<FMC_Bank2_TypeDef>(),
        4usize,
        "Alignment of FMC_Bank2_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PCR2) as usize - ptr as usize },
        0usize,
        "Offset of field: FMC_Bank2_TypeDef::PCR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR2) as usize - ptr as usize },
        4usize,
        "Offset of field: FMC_Bank2_TypeDef::SR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PMEM2) as usize - ptr as usize },
        8usize,
        "Offset of field: FMC_Bank2_TypeDef::PMEM2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PATT2) as usize - ptr as usize },
        12usize,
        "Offset of field: FMC_Bank2_TypeDef::PATT2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        16usize,
        "Offset of field: FMC_Bank2_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ECCR2) as usize - ptr as usize },
        20usize,
        "Offset of field: FMC_Bank2_TypeDef::ECCR2"
    );
}
#[test]
fn bindgen_test_layout_FMC_Bank3_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FMC_Bank3_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FMC_Bank3_TypeDef>(),
        24usize,
        "Size of FMC_Bank3_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<FMC_Bank3_TypeDef>(),
        4usize,
        "Alignment of FMC_Bank3_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PCR) as usize - ptr as usize },
        0usize,
        "Offset of field: FMC_Bank3_TypeDef::PCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        4usize,
        "Offset of field: FMC_Bank3_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PMEM) as usize - ptr as usize },
        8usize,
        "Offset of field: FMC_Bank3_TypeDef::PMEM"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PATT) as usize - ptr as usize },
        12usize,
        "Offset of field: FMC_Bank3_TypeDef::PATT"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED) as usize - ptr as usize
        },
        16usize,
        "Offset of field: FMC_Bank3_TypeDef::RESERVED"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ECCR) as usize - ptr as usize },
        20usize,
        "Offset of field: FMC_Bank3_TypeDef::ECCR"
    );
}
#[test]
fn bindgen_test_layout_FMC_Bank5_6_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<FMC_Bank5_6_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<FMC_Bank5_6_TypeDef>(),
        28usize,
        "Size of FMC_Bank5_6_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<FMC_Bank5_6_TypeDef>(),
        4usize,
        "Alignment of FMC_Bank5_6_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDCR) as usize - ptr as usize },
        0usize,
        "Offset of field: FMC_Bank5_6_TypeDef::SDCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDTR) as usize - ptr as usize },
        8usize,
        "Offset of field: FMC_Bank5_6_TypeDef::SDTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDCMR) as usize - ptr as usize },
        16usize,
        "Offset of field: FMC_Bank5_6_TypeDef::SDCMR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDRTR) as usize - ptr as usize },
        20usize,
        "Offset of field: FMC_Bank5_6_TypeDef::SDRTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SDSR) as usize - ptr as usize },
        24usize,
        "Offset of field: FMC_Bank5_6_TypeDef::SDSR"
    );
}
#[test]
fn bindgen_test_layout_GPIO_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<GPIO_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<GPIO_TypeDef>(),
        40usize,
        "Size of GPIO_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<GPIO_TypeDef>(),
        4usize,
        "Alignment of GPIO_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MODER) as usize - ptr as usize },
        0usize,
        "Offset of field: GPIO_TypeDef::MODER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OTYPER) as usize - ptr as usize },
        4usize,
        "Offset of field: GPIO_TypeDef::OTYPER"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OSPEEDR) as usize - ptr as usize
        },
        8usize,
        "Offset of field: GPIO_TypeDef::OSPEEDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PUPDR) as usize - ptr as usize },
        12usize,
        "Offset of field: GPIO_TypeDef::PUPDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IDR) as usize - ptr as usize },
        16usize,
        "Offset of field: GPIO_TypeDef::IDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ODR) as usize - ptr as usize },
        20usize,
        "Offset of field: GPIO_TypeDef::ODR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BSRR) as usize - ptr as usize },
        24usize,
        "Offset of field: GPIO_TypeDef::BSRR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LCKR) as usize - ptr as usize },
        28usize,
        "Offset of field: GPIO_TypeDef::LCKR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFR) as usize - ptr as usize },
        32usize,
        "Offset of field: GPIO_TypeDef::AFR"
    );
}
#[test]
fn bindgen_test_layout_OPAMP_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<OPAMP_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<OPAMP_TypeDef>(),
        12usize,
        "Size of OPAMP_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<OPAMP_TypeDef>(),
        4usize,
        "Alignment of OPAMP_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSR) as usize - ptr as usize },
        0usize,
        "Offset of field: OPAMP_TypeDef::CSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OTR) as usize - ptr as usize },
        4usize,
        "Offset of field: OPAMP_TypeDef::OTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HSOTR) as usize - ptr as usize },
        8usize,
        "Offset of field: OPAMP_TypeDef::HSOTR"
    );
}
#[test]
fn bindgen_test_layout_SYSCFG_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<SYSCFG_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SYSCFG_TypeDef>(),
        840usize,
        "Size of SYSCFG_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<SYSCFG_TypeDef>(),
        4usize,
        "Alignment of SYSCFG_TypeDef"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        0usize,
        "Offset of field: SYSCFG_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PMCR) as usize - ptr as usize },
        4usize,
        "Offset of field: SYSCFG_TypeDef::PMCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EXTICR) as usize - ptr as usize },
        8usize,
        "Offset of field: SYSCFG_TypeDef::EXTICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        24usize,
        "Offset of field: SYSCFG_TypeDef::CFGR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        28usize,
        "Offset of field: SYSCFG_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCCSR) as usize - ptr as usize },
        32usize,
        "Offset of field: SYSCFG_TypeDef::CCCSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCVR) as usize - ptr as usize },
        36usize,
        "Offset of field: SYSCFG_TypeDef::CCVR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCCR) as usize - ptr as usize },
        40usize,
        "Offset of field: SYSCFG_TypeDef::CCCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PWRCR) as usize - ptr as usize },
        44usize,
        "Offset of field: SYSCFG_TypeDef::PWRCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize
        },
        48usize,
        "Offset of field: SYSCFG_TypeDef::RESERVED3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PKGR) as usize - ptr as usize },
        292usize,
        "Offset of field: SYSCFG_TypeDef::PKGR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize
        },
        296usize,
        "Offset of field: SYSCFG_TypeDef::RESERVED4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR0) as usize - ptr as usize },
        768usize,
        "Offset of field: SYSCFG_TypeDef::UR0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR1) as usize - ptr as usize },
        772usize,
        "Offset of field: SYSCFG_TypeDef::UR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR2) as usize - ptr as usize },
        776usize,
        "Offset of field: SYSCFG_TypeDef::UR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR3) as usize - ptr as usize },
        780usize,
        "Offset of field: SYSCFG_TypeDef::UR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR4) as usize - ptr as usize },
        784usize,
        "Offset of field: SYSCFG_TypeDef::UR4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR5) as usize - ptr as usize },
        788usize,
        "Offset of field: SYSCFG_TypeDef::UR5"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR6) as usize - ptr as usize },
        792usize,
        "Offset of field: SYSCFG_TypeDef::UR6"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR7) as usize - ptr as usize },
        796usize,
        "Offset of field: SYSCFG_TypeDef::UR7"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR8) as usize - ptr as usize },
        800usize,
        "Offset of field: SYSCFG_TypeDef::UR8"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR9) as usize - ptr as usize },
        804usize,
        "Offset of field: SYSCFG_TypeDef::UR9"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR10) as usize - ptr as usize },
        808usize,
        "Offset of field: SYSCFG_TypeDef::UR10"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR11) as usize - ptr as usize },
        812usize,
        "Offset of field: SYSCFG_TypeDef::UR11"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR12) as usize - ptr as usize },
        816usize,
        "Offset of field: SYSCFG_TypeDef::UR12"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR13) as usize - ptr as usize },
        820usize,
        "Offset of field: SYSCFG_TypeDef::UR13"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR14) as usize - ptr as usize },
        824usize,
        "Offset of field: SYSCFG_TypeDef::UR14"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR15) as usize - ptr as usize },
        828usize,
        "Offset of field: SYSCFG_TypeDef::UR15"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR16) as usize - ptr as usize },
        832usize,
        "Offset of field: SYSCFG_TypeDef::UR16"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UR17) as usize - ptr as usize },
        836usize,
        "Offset of field: SYSCFG_TypeDef::UR17"
    );
}
#[test]
fn bindgen_test_layout_I2C_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<I2C_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<I2C_TypeDef>(),
        44usize,
        "Size of I2C_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<I2C_TypeDef>(),
        4usize,
        "Alignment of I2C_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        "Offset of field: I2C_TypeDef::CR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        "Offset of field: I2C_TypeDef::CR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OAR1) as usize - ptr as usize },
        8usize,
        "Offset of field: I2C_TypeDef::OAR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OAR2) as usize - ptr as usize },
        12usize,
        "Offset of field: I2C_TypeDef::OAR2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TIMINGR) as usize - ptr as usize
        },
        16usize,
        "Offset of field: I2C_TypeDef::TIMINGR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TIMEOUTR) as usize - ptr as usize
        },
        20usize,
        "Offset of field: I2C_TypeDef::TIMEOUTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        24usize,
        "Offset of field: I2C_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        28usize,
        "Offset of field: I2C_TypeDef::ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PECR) as usize - ptr as usize },
        32usize,
        "Offset of field: I2C_TypeDef::PECR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXDR) as usize - ptr as usize },
        36usize,
        "Offset of field: I2C_TypeDef::RXDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXDR) as usize - ptr as usize },
        40usize,
        "Offset of field: I2C_TypeDef::TXDR"
    );
}
#[test]
fn bindgen_test_layout_IWDG_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<IWDG_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<IWDG_TypeDef>(),
        20usize,
        "Size of IWDG_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<IWDG_TypeDef>(),
        4usize,
        "Alignment of IWDG_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).KR) as usize - ptr as usize },
        0usize,
        "Offset of field: IWDG_TypeDef::KR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PR) as usize - ptr as usize },
        4usize,
        "Offset of field: IWDG_TypeDef::PR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RLR) as usize - ptr as usize },
        8usize,
        "Offset of field: IWDG_TypeDef::RLR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        12usize,
        "Offset of field: IWDG_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WINR) as usize - ptr as usize },
        16usize,
        "Offset of field: IWDG_TypeDef::WINR"
    );
}
#[test]
fn bindgen_test_layout_JPEG_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<JPEG_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<JPEG_TypeDef>(),
        2048usize,
        "Size of JPEG_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<JPEG_TypeDef>(),
        4usize,
        "Alignment of JPEG_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CONFR0) as usize - ptr as usize },
        0usize,
        "Offset of field: JPEG_TypeDef::CONFR0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CONFR1) as usize - ptr as usize },
        4usize,
        "Offset of field: JPEG_TypeDef::CONFR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CONFR2) as usize - ptr as usize },
        8usize,
        "Offset of field: JPEG_TypeDef::CONFR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CONFR3) as usize - ptr as usize },
        12usize,
        "Offset of field: JPEG_TypeDef::CONFR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CONFR4) as usize - ptr as usize },
        16usize,
        "Offset of field: JPEG_TypeDef::CONFR4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CONFR5) as usize - ptr as usize },
        20usize,
        "Offset of field: JPEG_TypeDef::CONFR5"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CONFR6) as usize - ptr as usize },
        24usize,
        "Offset of field: JPEG_TypeDef::CONFR6"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CONFR7) as usize - ptr as usize },
        28usize,
        "Offset of field: JPEG_TypeDef::CONFR7"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Reserved20) as usize - ptr as usize
        },
        32usize,
        "Offset of field: JPEG_TypeDef::Reserved20"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        48usize,
        "Offset of field: JPEG_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        52usize,
        "Offset of field: JPEG_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFR) as usize - ptr as usize },
        56usize,
        "Offset of field: JPEG_TypeDef::CFR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Reserved3c) as usize - ptr as usize
        },
        60usize,
        "Offset of field: JPEG_TypeDef::Reserved3c"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DIR) as usize - ptr as usize },
        64usize,
        "Offset of field: JPEG_TypeDef::DIR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOR) as usize - ptr as usize },
        68usize,
        "Offset of field: JPEG_TypeDef::DOR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Reserved48) as usize - ptr as usize
        },
        72usize,
        "Offset of field: JPEG_TypeDef::Reserved48"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).QMEM0) as usize - ptr as usize },
        80usize,
        "Offset of field: JPEG_TypeDef::QMEM0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).QMEM1) as usize - ptr as usize },
        144usize,
        "Offset of field: JPEG_TypeDef::QMEM1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).QMEM2) as usize - ptr as usize },
        208usize,
        "Offset of field: JPEG_TypeDef::QMEM2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).QMEM3) as usize - ptr as usize },
        272usize,
        "Offset of field: JPEG_TypeDef::QMEM3"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HUFFMIN) as usize - ptr as usize
        },
        336usize,
        "Offset of field: JPEG_TypeDef::HUFFMIN"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HUFFBASE) as usize - ptr as usize
        },
        400usize,
        "Offset of field: JPEG_TypeDef::HUFFBASE"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HUFFSYMB) as usize - ptr as usize
        },
        528usize,
        "Offset of field: JPEG_TypeDef::HUFFSYMB"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DHTMEM) as usize - ptr as usize },
        864usize,
        "Offset of field: JPEG_TypeDef::DHTMEM"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Reserved4FC) as usize - ptr as usize
        },
        1276usize,
        "Offset of field: JPEG_TypeDef::Reserved4FC"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HUFFENC_AC0) as usize - ptr as usize
        },
        1280usize,
        "Offset of field: JPEG_TypeDef::HUFFENC_AC0"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HUFFENC_AC1) as usize - ptr as usize
        },
        1632usize,
        "Offset of field: JPEG_TypeDef::HUFFENC_AC1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HUFFENC_DC0) as usize - ptr as usize
        },
        1984usize,
        "Offset of field: JPEG_TypeDef::HUFFENC_DC0"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HUFFENC_DC1) as usize - ptr as usize
        },
        2016usize,
        "Offset of field: JPEG_TypeDef::HUFFENC_DC1"
    );
}
#[test]
fn bindgen_test_layout_LTDC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<LTDC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<LTDC_TypeDef>(),
        76usize,
        "Size of LTDC_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<LTDC_TypeDef>(),
        4usize,
        "Alignment of LTDC_TypeDef"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        0usize,
        "Offset of field: LTDC_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SSCR) as usize - ptr as usize },
        8usize,
        "Offset of field: LTDC_TypeDef::SSCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BPCR) as usize - ptr as usize },
        12usize,
        "Offset of field: LTDC_TypeDef::BPCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AWCR) as usize - ptr as usize },
        16usize,
        "Offset of field: LTDC_TypeDef::AWCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TWCR) as usize - ptr as usize },
        20usize,
        "Offset of field: LTDC_TypeDef::TWCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GCR) as usize - ptr as usize },
        24usize,
        "Offset of field: LTDC_TypeDef::GCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        28usize,
        "Offset of field: LTDC_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SRCR) as usize - ptr as usize },
        36usize,
        "Offset of field: LTDC_TypeDef::SRCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        40usize,
        "Offset of field: LTDC_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BCCR) as usize - ptr as usize },
        44usize,
        "Offset of field: LTDC_TypeDef::BCCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize
        },
        48usize,
        "Offset of field: LTDC_TypeDef::RESERVED3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        52usize,
        "Offset of field: LTDC_TypeDef::IER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        56usize,
        "Offset of field: LTDC_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        60usize,
        "Offset of field: LTDC_TypeDef::ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LIPCR) as usize - ptr as usize },
        64usize,
        "Offset of field: LTDC_TypeDef::LIPCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CPSR) as usize - ptr as usize },
        68usize,
        "Offset of field: LTDC_TypeDef::CPSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CDSR) as usize - ptr as usize },
        72usize,
        "Offset of field: LTDC_TypeDef::CDSR"
    );
}
#[test]
fn bindgen_test_layout_LTDC_Layer_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<LTDC_Layer_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<LTDC_Layer_TypeDef>(),
        68usize,
        "Size of LTDC_Layer_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<LTDC_Layer_TypeDef>(),
        4usize,
        "Alignment of LTDC_Layer_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: LTDC_Layer_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WHPCR) as usize - ptr as usize },
        4usize,
        "Offset of field: LTDC_Layer_TypeDef::WHPCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WVPCR) as usize - ptr as usize },
        8usize,
        "Offset of field: LTDC_Layer_TypeDef::WVPCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CKCR) as usize - ptr as usize },
        12usize,
        "Offset of field: LTDC_Layer_TypeDef::CKCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PFCR) as usize - ptr as usize },
        16usize,
        "Offset of field: LTDC_Layer_TypeDef::PFCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CACR) as usize - ptr as usize },
        20usize,
        "Offset of field: LTDC_Layer_TypeDef::CACR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DCCR) as usize - ptr as usize },
        24usize,
        "Offset of field: LTDC_Layer_TypeDef::DCCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BFCR) as usize - ptr as usize },
        28usize,
        "Offset of field: LTDC_Layer_TypeDef::BFCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        32usize,
        "Offset of field: LTDC_Layer_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFBAR) as usize - ptr as usize },
        40usize,
        "Offset of field: LTDC_Layer_TypeDef::CFBAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFBLR) as usize - ptr as usize },
        44usize,
        "Offset of field: LTDC_Layer_TypeDef::CFBLR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFBLNR) as usize - ptr as usize },
        48usize,
        "Offset of field: LTDC_Layer_TypeDef::CFBLNR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        52usize,
        "Offset of field: LTDC_Layer_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CLUTWR) as usize - ptr as usize },
        64usize,
        "Offset of field: LTDC_Layer_TypeDef::CLUTWR"
    );
}
#[test]
fn bindgen_test_layout_PWR_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<PWR_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<PWR_TypeDef>(),
        44usize,
        "Size of PWR_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<PWR_TypeDef>(),
        4usize,
        "Alignment of PWR_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        "Offset of field: PWR_TypeDef::CR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSR1) as usize - ptr as usize },
        4usize,
        "Offset of field: PWR_TypeDef::CSR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        8usize,
        "Offset of field: PWR_TypeDef::CR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR3) as usize - ptr as usize },
        12usize,
        "Offset of field: PWR_TypeDef::CR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CPUCR) as usize - ptr as usize },
        16usize,
        "Offset of field: PWR_TypeDef::CPUCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        20usize,
        "Offset of field: PWR_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).D3CR) as usize - ptr as usize },
        24usize,
        "Offset of field: PWR_TypeDef::D3CR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        28usize,
        "Offset of field: PWR_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WKUPCR) as usize - ptr as usize },
        32usize,
        "Offset of field: PWR_TypeDef::WKUPCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WKUPFR) as usize - ptr as usize },
        36usize,
        "Offset of field: PWR_TypeDef::WKUPFR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).WKUPEPR) as usize - ptr as usize
        },
        40usize,
        "Offset of field: PWR_TypeDef::WKUPEPR"
    );
}
#[test]
fn bindgen_test_layout_RCC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<RCC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<RCC_TypeDef>(),
        304usize,
        "Size of RCC_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<RCC_TypeDef>(),
        4usize,
        "Alignment of RCC_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: RCC_TypeDef::CR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).HSICFGR) as usize - ptr as usize
        },
        4usize,
        "Offset of field: RCC_TypeDef::HSICFGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CRRCR) as usize - ptr as usize },
        8usize,
        "Offset of field: RCC_TypeDef::CRRCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSICFGR) as usize - ptr as usize
        },
        12usize,
        "Offset of field: RCC_TypeDef::CSICFGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        16usize,
        "Offset of field: RCC_TypeDef::CFGR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        20usize,
        "Offset of field: RCC_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).D1CFGR) as usize - ptr as usize },
        24usize,
        "Offset of field: RCC_TypeDef::D1CFGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).D2CFGR) as usize - ptr as usize },
        28usize,
        "Offset of field: RCC_TypeDef::D2CFGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).D3CFGR) as usize - ptr as usize },
        32usize,
        "Offset of field: RCC_TypeDef::D3CFGR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        36usize,
        "Offset of field: RCC_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PLLCKSELR) as usize - ptr as usize
        },
        40usize,
        "Offset of field: RCC_TypeDef::PLLCKSELR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PLLCFGR) as usize - ptr as usize
        },
        44usize,
        "Offset of field: RCC_TypeDef::PLLCFGR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PLL1DIVR) as usize - ptr as usize
        },
        48usize,
        "Offset of field: RCC_TypeDef::PLL1DIVR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PLL1FRACR) as usize - ptr as usize
        },
        52usize,
        "Offset of field: RCC_TypeDef::PLL1FRACR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PLL2DIVR) as usize - ptr as usize
        },
        56usize,
        "Offset of field: RCC_TypeDef::PLL2DIVR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PLL2FRACR) as usize - ptr as usize
        },
        60usize,
        "Offset of field: RCC_TypeDef::PLL2FRACR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PLL3DIVR) as usize - ptr as usize
        },
        64usize,
        "Offset of field: RCC_TypeDef::PLL3DIVR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PLL3FRACR) as usize - ptr as usize
        },
        68usize,
        "Offset of field: RCC_TypeDef::PLL3FRACR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize
        },
        72usize,
        "Offset of field: RCC_TypeDef::RESERVED3"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D1CCIPR) as usize - ptr as usize
        },
        76usize,
        "Offset of field: RCC_TypeDef::D1CCIPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D2CCIP1R) as usize - ptr as usize
        },
        80usize,
        "Offset of field: RCC_TypeDef::D2CCIP1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D2CCIP2R) as usize - ptr as usize
        },
        84usize,
        "Offset of field: RCC_TypeDef::D2CCIP2R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).D3CCIPR) as usize - ptr as usize
        },
        88usize,
        "Offset of field: RCC_TypeDef::D3CCIPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize
        },
        92usize,
        "Offset of field: RCC_TypeDef::RESERVED4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CIER) as usize - ptr as usize },
        96usize,
        "Offset of field: RCC_TypeDef::CIER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CIFR) as usize - ptr as usize },
        100usize,
        "Offset of field: RCC_TypeDef::CIFR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CICR) as usize - ptr as usize },
        104usize,
        "Offset of field: RCC_TypeDef::CICR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize
        },
        108usize,
        "Offset of field: RCC_TypeDef::RESERVED5"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BDCR) as usize - ptr as usize },
        112usize,
        "Offset of field: RCC_TypeDef::BDCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSR) as usize - ptr as usize },
        116usize,
        "Offset of field: RCC_TypeDef::CSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED6) as usize - ptr as usize
        },
        120usize,
        "Offset of field: RCC_TypeDef::RESERVED6"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB3RSTR) as usize - ptr as usize
        },
        124usize,
        "Offset of field: RCC_TypeDef::AHB3RSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB1RSTR) as usize - ptr as usize
        },
        128usize,
        "Offset of field: RCC_TypeDef::AHB1RSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB2RSTR) as usize - ptr as usize
        },
        132usize,
        "Offset of field: RCC_TypeDef::AHB2RSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB4RSTR) as usize - ptr as usize
        },
        136usize,
        "Offset of field: RCC_TypeDef::AHB4RSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB3RSTR) as usize - ptr as usize
        },
        140usize,
        "Offset of field: RCC_TypeDef::APB3RSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB1LRSTR) as usize - ptr as usize
        },
        144usize,
        "Offset of field: RCC_TypeDef::APB1LRSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB1HRSTR) as usize - ptr as usize
        },
        148usize,
        "Offset of field: RCC_TypeDef::APB1HRSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB2RSTR) as usize - ptr as usize
        },
        152usize,
        "Offset of field: RCC_TypeDef::APB2RSTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB4RSTR) as usize - ptr as usize
        },
        156usize,
        "Offset of field: RCC_TypeDef::APB4RSTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GCR) as usize - ptr as usize },
        160usize,
        "Offset of field: RCC_TypeDef::GCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED8) as usize - ptr as usize
        },
        164usize,
        "Offset of field: RCC_TypeDef::RESERVED8"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).D3AMR) as usize - ptr as usize },
        168usize,
        "Offset of field: RCC_TypeDef::D3AMR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED11) as usize - ptr as usize
        },
        172usize,
        "Offset of field: RCC_TypeDef::RESERVED11"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RSR) as usize - ptr as usize },
        208usize,
        "Offset of field: RCC_TypeDef::RSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB3ENR) as usize - ptr as usize
        },
        212usize,
        "Offset of field: RCC_TypeDef::AHB3ENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB1ENR) as usize - ptr as usize
        },
        216usize,
        "Offset of field: RCC_TypeDef::AHB1ENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB2ENR) as usize - ptr as usize
        },
        220usize,
        "Offset of field: RCC_TypeDef::AHB2ENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB4ENR) as usize - ptr as usize
        },
        224usize,
        "Offset of field: RCC_TypeDef::AHB4ENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB3ENR) as usize - ptr as usize
        },
        228usize,
        "Offset of field: RCC_TypeDef::APB3ENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB1LENR) as usize - ptr as usize
        },
        232usize,
        "Offset of field: RCC_TypeDef::APB1LENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB1HENR) as usize - ptr as usize
        },
        236usize,
        "Offset of field: RCC_TypeDef::APB1HENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB2ENR) as usize - ptr as usize
        },
        240usize,
        "Offset of field: RCC_TypeDef::APB2ENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB4ENR) as usize - ptr as usize
        },
        244usize,
        "Offset of field: RCC_TypeDef::APB4ENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED12) as usize - ptr as usize
        },
        248usize,
        "Offset of field: RCC_TypeDef::RESERVED12"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB3LPENR) as usize - ptr as usize
        },
        252usize,
        "Offset of field: RCC_TypeDef::AHB3LPENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB1LPENR) as usize - ptr as usize
        },
        256usize,
        "Offset of field: RCC_TypeDef::AHB1LPENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB2LPENR) as usize - ptr as usize
        },
        260usize,
        "Offset of field: RCC_TypeDef::AHB2LPENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AHB4LPENR) as usize - ptr as usize
        },
        264usize,
        "Offset of field: RCC_TypeDef::AHB4LPENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB3LPENR) as usize - ptr as usize
        },
        268usize,
        "Offset of field: RCC_TypeDef::APB3LPENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB1LLPENR) as usize - ptr as usize
        },
        272usize,
        "Offset of field: RCC_TypeDef::APB1LLPENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB1HLPENR) as usize - ptr as usize
        },
        276usize,
        "Offset of field: RCC_TypeDef::APB1HLPENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB2LPENR) as usize - ptr as usize
        },
        280usize,
        "Offset of field: RCC_TypeDef::APB2LPENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).APB4LPENR) as usize - ptr as usize
        },
        284usize,
        "Offset of field: RCC_TypeDef::APB4LPENR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED13) as usize - ptr as usize
        },
        288usize,
        "Offset of field: RCC_TypeDef::RESERVED13"
    );
}
#[test]
fn bindgen_test_layout_RTC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<RTC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<RTC_TypeDef>(),
        208usize,
        "Size of RTC_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<RTC_TypeDef>(),
        4usize,
        "Alignment of RTC_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TR) as usize - ptr as usize },
        0usize,
        "Offset of field: RTC_TypeDef::TR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        4usize,
        "Offset of field: RTC_TypeDef::DR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        8usize,
        "Offset of field: RTC_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        12usize,
        "Offset of field: RTC_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PRER) as usize - ptr as usize },
        16usize,
        "Offset of field: RTC_TypeDef::PRER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WUTR) as usize - ptr as usize },
        20usize,
        "Offset of field: RTC_TypeDef::WUTR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED) as usize - ptr as usize
        },
        24usize,
        "Offset of field: RTC_TypeDef::RESERVED"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ALRMAR) as usize - ptr as usize },
        28usize,
        "Offset of field: RTC_TypeDef::ALRMAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ALRMBR) as usize - ptr as usize },
        32usize,
        "Offset of field: RTC_TypeDef::ALRMBR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WPR) as usize - ptr as usize },
        36usize,
        "Offset of field: RTC_TypeDef::WPR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SSR) as usize - ptr as usize },
        40usize,
        "Offset of field: RTC_TypeDef::SSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHIFTR) as usize - ptr as usize },
        44usize,
        "Offset of field: RTC_TypeDef::SHIFTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TSTR) as usize - ptr as usize },
        48usize,
        "Offset of field: RTC_TypeDef::TSTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TSDR) as usize - ptr as usize },
        52usize,
        "Offset of field: RTC_TypeDef::TSDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TSSSR) as usize - ptr as usize },
        56usize,
        "Offset of field: RTC_TypeDef::TSSSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CALR) as usize - ptr as usize },
        60usize,
        "Offset of field: RTC_TypeDef::CALR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TAMPCR) as usize - ptr as usize },
        64usize,
        "Offset of field: RTC_TypeDef::TAMPCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ALRMASSR) as usize - ptr as usize
        },
        68usize,
        "Offset of field: RTC_TypeDef::ALRMASSR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ALRMBSSR) as usize - ptr as usize
        },
        72usize,
        "Offset of field: RTC_TypeDef::ALRMBSSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OR) as usize - ptr as usize },
        76usize,
        "Offset of field: RTC_TypeDef::OR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP0R) as usize - ptr as usize },
        80usize,
        "Offset of field: RTC_TypeDef::BKP0R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP1R) as usize - ptr as usize },
        84usize,
        "Offset of field: RTC_TypeDef::BKP1R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP2R) as usize - ptr as usize },
        88usize,
        "Offset of field: RTC_TypeDef::BKP2R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP3R) as usize - ptr as usize },
        92usize,
        "Offset of field: RTC_TypeDef::BKP3R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP4R) as usize - ptr as usize },
        96usize,
        "Offset of field: RTC_TypeDef::BKP4R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP5R) as usize - ptr as usize },
        100usize,
        "Offset of field: RTC_TypeDef::BKP5R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP6R) as usize - ptr as usize },
        104usize,
        "Offset of field: RTC_TypeDef::BKP6R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP7R) as usize - ptr as usize },
        108usize,
        "Offset of field: RTC_TypeDef::BKP7R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP8R) as usize - ptr as usize },
        112usize,
        "Offset of field: RTC_TypeDef::BKP8R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP9R) as usize - ptr as usize },
        116usize,
        "Offset of field: RTC_TypeDef::BKP9R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP10R) as usize - ptr as usize },
        120usize,
        "Offset of field: RTC_TypeDef::BKP10R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP11R) as usize - ptr as usize },
        124usize,
        "Offset of field: RTC_TypeDef::BKP11R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP12R) as usize - ptr as usize },
        128usize,
        "Offset of field: RTC_TypeDef::BKP12R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP13R) as usize - ptr as usize },
        132usize,
        "Offset of field: RTC_TypeDef::BKP13R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP14R) as usize - ptr as usize },
        136usize,
        "Offset of field: RTC_TypeDef::BKP14R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP15R) as usize - ptr as usize },
        140usize,
        "Offset of field: RTC_TypeDef::BKP15R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP16R) as usize - ptr as usize },
        144usize,
        "Offset of field: RTC_TypeDef::BKP16R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP17R) as usize - ptr as usize },
        148usize,
        "Offset of field: RTC_TypeDef::BKP17R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP18R) as usize - ptr as usize },
        152usize,
        "Offset of field: RTC_TypeDef::BKP18R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP19R) as usize - ptr as usize },
        156usize,
        "Offset of field: RTC_TypeDef::BKP19R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP20R) as usize - ptr as usize },
        160usize,
        "Offset of field: RTC_TypeDef::BKP20R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP21R) as usize - ptr as usize },
        164usize,
        "Offset of field: RTC_TypeDef::BKP21R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP22R) as usize - ptr as usize },
        168usize,
        "Offset of field: RTC_TypeDef::BKP22R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP23R) as usize - ptr as usize },
        172usize,
        "Offset of field: RTC_TypeDef::BKP23R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP24R) as usize - ptr as usize },
        176usize,
        "Offset of field: RTC_TypeDef::BKP24R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP25R) as usize - ptr as usize },
        180usize,
        "Offset of field: RTC_TypeDef::BKP25R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP26R) as usize - ptr as usize },
        184usize,
        "Offset of field: RTC_TypeDef::BKP26R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP27R) as usize - ptr as usize },
        188usize,
        "Offset of field: RTC_TypeDef::BKP27R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP28R) as usize - ptr as usize },
        192usize,
        "Offset of field: RTC_TypeDef::BKP28R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP29R) as usize - ptr as usize },
        196usize,
        "Offset of field: RTC_TypeDef::BKP29R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP30R) as usize - ptr as usize },
        200usize,
        "Offset of field: RTC_TypeDef::BKP30R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BKP31R) as usize - ptr as usize },
        204usize,
        "Offset of field: RTC_TypeDef::BKP31R"
    );
}
#[test]
fn bindgen_test_layout_SAI_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<SAI_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SAI_TypeDef>(),
        76usize,
        "Size of SAI_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<SAI_TypeDef>(),
        4usize,
        "Alignment of SAI_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GCR) as usize - ptr as usize },
        0usize,
        "Offset of field: SAI_TypeDef::GCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        4usize,
        "Offset of field: SAI_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PDMCR) as usize - ptr as usize },
        68usize,
        "Offset of field: SAI_TypeDef::PDMCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PDMDLY) as usize - ptr as usize },
        72usize,
        "Offset of field: SAI_TypeDef::PDMDLY"
    );
}
#[test]
fn bindgen_test_layout_SAI_Block_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<SAI_Block_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SAI_Block_TypeDef>(),
        32usize,
        "Size of SAI_Block_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<SAI_Block_TypeDef>(),
        4usize,
        "Alignment of SAI_Block_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        "Offset of field: SAI_Block_TypeDef::CR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        "Offset of field: SAI_Block_TypeDef::CR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FRCR) as usize - ptr as usize },
        8usize,
        "Offset of field: SAI_Block_TypeDef::FRCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SLOTR) as usize - ptr as usize },
        12usize,
        "Offset of field: SAI_Block_TypeDef::SLOTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMR) as usize - ptr as usize },
        16usize,
        "Offset of field: SAI_Block_TypeDef::IMR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        20usize,
        "Offset of field: SAI_Block_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CLRFR) as usize - ptr as usize },
        24usize,
        "Offset of field: SAI_Block_TypeDef::CLRFR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        28usize,
        "Offset of field: SAI_Block_TypeDef::DR"
    );
}
#[test]
fn bindgen_test_layout_SPDIFRX_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<SPDIFRX_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SPDIFRX_TypeDef>(),
        32usize,
        "Size of SPDIFRX_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<SPDIFRX_TypeDef>(),
        4usize,
        "Alignment of SPDIFRX_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: SPDIFRX_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMR) as usize - ptr as usize },
        4usize,
        "Offset of field: SPDIFRX_TypeDef::IMR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        8usize,
        "Offset of field: SPDIFRX_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IFCR) as usize - ptr as usize },
        12usize,
        "Offset of field: SPDIFRX_TypeDef::IFCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        16usize,
        "Offset of field: SPDIFRX_TypeDef::DR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSR) as usize - ptr as usize },
        20usize,
        "Offset of field: SPDIFRX_TypeDef::CSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DIR) as usize - ptr as usize },
        24usize,
        "Offset of field: SPDIFRX_TypeDef::DIR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        28usize,
        "Offset of field: SPDIFRX_TypeDef::RESERVED2"
    );
}
#[test]
fn bindgen_test_layout_SDMMC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<SDMMC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDMMC_TypeDef>(),
        1024usize,
        "Size of SDMMC_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<SDMMC_TypeDef>(),
        4usize,
        "Alignment of SDMMC_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).POWER) as usize - ptr as usize },
        0usize,
        "Offset of field: SDMMC_TypeDef::POWER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CLKCR) as usize - ptr as usize },
        4usize,
        "Offset of field: SDMMC_TypeDef::CLKCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ARG) as usize - ptr as usize },
        8usize,
        "Offset of field: SDMMC_TypeDef::ARG"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMD) as usize - ptr as usize },
        12usize,
        "Offset of field: SDMMC_TypeDef::CMD"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESPCMD) as usize - ptr as usize
        },
        16usize,
        "Offset of field: SDMMC_TypeDef::RESPCMD"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESP1) as usize - ptr as usize },
        20usize,
        "Offset of field: SDMMC_TypeDef::RESP1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESP2) as usize - ptr as usize },
        24usize,
        "Offset of field: SDMMC_TypeDef::RESP2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESP3) as usize - ptr as usize },
        28usize,
        "Offset of field: SDMMC_TypeDef::RESP3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESP4) as usize - ptr as usize },
        32usize,
        "Offset of field: SDMMC_TypeDef::RESP4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DTIMER) as usize - ptr as usize },
        36usize,
        "Offset of field: SDMMC_TypeDef::DTIMER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DLEN) as usize - ptr as usize },
        40usize,
        "Offset of field: SDMMC_TypeDef::DLEN"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DCTRL) as usize - ptr as usize },
        44usize,
        "Offset of field: SDMMC_TypeDef::DCTRL"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DCOUNT) as usize - ptr as usize },
        48usize,
        "Offset of field: SDMMC_TypeDef::DCOUNT"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).STA) as usize - ptr as usize },
        52usize,
        "Offset of field: SDMMC_TypeDef::STA"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        56usize,
        "Offset of field: SDMMC_TypeDef::ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MASK) as usize - ptr as usize },
        60usize,
        "Offset of field: SDMMC_TypeDef::MASK"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ACKTIME) as usize - ptr as usize
        },
        64usize,
        "Offset of field: SDMMC_TypeDef::ACKTIME"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        68usize,
        "Offset of field: SDMMC_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IDMACTRL) as usize - ptr as usize
        },
        80usize,
        "Offset of field: SDMMC_TypeDef::IDMACTRL"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IDMABSIZE) as usize - ptr as usize
        },
        84usize,
        "Offset of field: SDMMC_TypeDef::IDMABSIZE"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IDMABASE0) as usize - ptr as usize
        },
        88usize,
        "Offset of field: SDMMC_TypeDef::IDMABASE0"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).IDMABASE1) as usize - ptr as usize
        },
        92usize,
        "Offset of field: SDMMC_TypeDef::IDMABASE1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        96usize,
        "Offset of field: SDMMC_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FIFO) as usize - ptr as usize },
        128usize,
        "Offset of field: SDMMC_TypeDef::FIFO"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        132usize,
        "Offset of field: SDMMC_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IPVR) as usize - ptr as usize },
        1020usize,
        "Offset of field: SDMMC_TypeDef::IPVR"
    );
}
#[test]
fn bindgen_test_layout_DLYB_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<DLYB_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DLYB_TypeDef>(),
        8usize,
        "Size of DLYB_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<DLYB_TypeDef>(),
        4usize,
        "Alignment of DLYB_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: DLYB_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        4usize,
        "Offset of field: DLYB_TypeDef::CFGR"
    );
}
#[test]
fn bindgen_test_layout_HSEM_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HSEM_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HSEM_TypeDef>(),
        328usize,
        "Size of HSEM_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<HSEM_TypeDef>(),
        4usize,
        "Alignment of HSEM_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).R) as usize - ptr as usize },
        0usize,
        "Offset of field: HSEM_TypeDef::R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RLR) as usize - ptr as usize },
        128usize,
        "Offset of field: HSEM_TypeDef::RLR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).C1IER) as usize - ptr as usize },
        256usize,
        "Offset of field: HSEM_TypeDef::C1IER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).C1ICR) as usize - ptr as usize },
        260usize,
        "Offset of field: HSEM_TypeDef::C1ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).C1ISR) as usize - ptr as usize },
        264usize,
        "Offset of field: HSEM_TypeDef::C1ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).C1MISR) as usize - ptr as usize },
        268usize,
        "Offset of field: HSEM_TypeDef::C1MISR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize
        },
        272usize,
        "Offset of field: HSEM_TypeDef::Reserved"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        320usize,
        "Offset of field: HSEM_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).KEYR) as usize - ptr as usize },
        324usize,
        "Offset of field: HSEM_TypeDef::KEYR"
    );
}
#[test]
fn bindgen_test_layout_HSEM_Common_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HSEM_Common_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HSEM_Common_TypeDef>(),
        16usize,
        "Size of HSEM_Common_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<HSEM_Common_TypeDef>(),
        4usize,
        "Alignment of HSEM_Common_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        0usize,
        "Offset of field: HSEM_Common_TypeDef::IER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        4usize,
        "Offset of field: HSEM_Common_TypeDef::ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        8usize,
        "Offset of field: HSEM_Common_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MISR) as usize - ptr as usize },
        12usize,
        "Offset of field: HSEM_Common_TypeDef::MISR"
    );
}
#[test]
fn bindgen_test_layout_SPI_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<SPI_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SPI_TypeDef>(),
        84usize,
        "Size of SPI_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<SPI_TypeDef>(),
        4usize,
        "Alignment of SPI_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        "Offset of field: SPI_TypeDef::CR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        "Offset of field: SPI_TypeDef::CR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFG1) as usize - ptr as usize },
        8usize,
        "Offset of field: SPI_TypeDef::CFG1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFG2) as usize - ptr as usize },
        12usize,
        "Offset of field: SPI_TypeDef::CFG2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        16usize,
        "Offset of field: SPI_TypeDef::IER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        20usize,
        "Offset of field: SPI_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IFCR) as usize - ptr as usize },
        24usize,
        "Offset of field: SPI_TypeDef::IFCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        28usize,
        "Offset of field: SPI_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXDR) as usize - ptr as usize },
        32usize,
        "Offset of field: SPI_TypeDef::TXDR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        36usize,
        "Offset of field: SPI_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXDR) as usize - ptr as usize },
        48usize,
        "Offset of field: SPI_TypeDef::RXDR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize
        },
        52usize,
        "Offset of field: SPI_TypeDef::RESERVED2"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CRCPOLY) as usize - ptr as usize
        },
        64usize,
        "Offset of field: SPI_TypeDef::CRCPOLY"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TXCRC) as usize - ptr as usize },
        68usize,
        "Offset of field: SPI_TypeDef::TXCRC"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RXCRC) as usize - ptr as usize },
        72usize,
        "Offset of field: SPI_TypeDef::RXCRC"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UDRDR) as usize - ptr as usize },
        76usize,
        "Offset of field: SPI_TypeDef::UDRDR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).I2SCFGR) as usize - ptr as usize
        },
        80usize,
        "Offset of field: SPI_TypeDef::I2SCFGR"
    );
}
#[test]
fn bindgen_test_layout_QUADSPI_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<QUADSPI_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<QUADSPI_TypeDef>(),
        52usize,
        "Size of QUADSPI_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<QUADSPI_TypeDef>(),
        4usize,
        "Alignment of QUADSPI_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: QUADSPI_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DCR) as usize - ptr as usize },
        4usize,
        "Offset of field: QUADSPI_TypeDef::DCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        8usize,
        "Offset of field: QUADSPI_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FCR) as usize - ptr as usize },
        12usize,
        "Offset of field: QUADSPI_TypeDef::FCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DLR) as usize - ptr as usize },
        16usize,
        "Offset of field: QUADSPI_TypeDef::DLR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        20usize,
        "Offset of field: QUADSPI_TypeDef::CCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AR) as usize - ptr as usize },
        24usize,
        "Offset of field: QUADSPI_TypeDef::AR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ABR) as usize - ptr as usize },
        28usize,
        "Offset of field: QUADSPI_TypeDef::ABR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        32usize,
        "Offset of field: QUADSPI_TypeDef::DR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PSMKR) as usize - ptr as usize },
        36usize,
        "Offset of field: QUADSPI_TypeDef::PSMKR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PSMAR) as usize - ptr as usize },
        40usize,
        "Offset of field: QUADSPI_TypeDef::PSMAR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PIR) as usize - ptr as usize },
        44usize,
        "Offset of field: QUADSPI_TypeDef::PIR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LPTR) as usize - ptr as usize },
        48usize,
        "Offset of field: QUADSPI_TypeDef::LPTR"
    );
}
#[test]
fn bindgen_test_layout_TIM_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<TIM_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<TIM_TypeDef>(),
        108usize,
        "Size of TIM_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<TIM_TypeDef>(),
        4usize,
        "Alignment of TIM_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        "Offset of field: TIM_TypeDef::CR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        "Offset of field: TIM_TypeDef::CR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SMCR) as usize - ptr as usize },
        8usize,
        "Offset of field: TIM_TypeDef::SMCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DIER) as usize - ptr as usize },
        12usize,
        "Offset of field: TIM_TypeDef::DIER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        16usize,
        "Offset of field: TIM_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EGR) as usize - ptr as usize },
        20usize,
        "Offset of field: TIM_TypeDef::EGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCMR1) as usize - ptr as usize },
        24usize,
        "Offset of field: TIM_TypeDef::CCMR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCMR2) as usize - ptr as usize },
        28usize,
        "Offset of field: TIM_TypeDef::CCMR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCER) as usize - ptr as usize },
        32usize,
        "Offset of field: TIM_TypeDef::CCER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CNT) as usize - ptr as usize },
        36usize,
        "Offset of field: TIM_TypeDef::CNT"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PSC) as usize - ptr as usize },
        40usize,
        "Offset of field: TIM_TypeDef::PSC"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ARR) as usize - ptr as usize },
        44usize,
        "Offset of field: TIM_TypeDef::ARR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RCR) as usize - ptr as usize },
        48usize,
        "Offset of field: TIM_TypeDef::RCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR1) as usize - ptr as usize },
        52usize,
        "Offset of field: TIM_TypeDef::CCR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR2) as usize - ptr as usize },
        56usize,
        "Offset of field: TIM_TypeDef::CCR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR3) as usize - ptr as usize },
        60usize,
        "Offset of field: TIM_TypeDef::CCR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR4) as usize - ptr as usize },
        64usize,
        "Offset of field: TIM_TypeDef::CCR4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BDTR) as usize - ptr as usize },
        68usize,
        "Offset of field: TIM_TypeDef::BDTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DCR) as usize - ptr as usize },
        72usize,
        "Offset of field: TIM_TypeDef::DCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DMAR) as usize - ptr as usize },
        76usize,
        "Offset of field: TIM_TypeDef::DMAR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        80usize,
        "Offset of field: TIM_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCMR3) as usize - ptr as usize },
        84usize,
        "Offset of field: TIM_TypeDef::CCMR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR5) as usize - ptr as usize },
        88usize,
        "Offset of field: TIM_TypeDef::CCR5"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR6) as usize - ptr as usize },
        92usize,
        "Offset of field: TIM_TypeDef::CCR6"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AF1) as usize - ptr as usize },
        96usize,
        "Offset of field: TIM_TypeDef::AF1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AF2) as usize - ptr as usize },
        100usize,
        "Offset of field: TIM_TypeDef::AF2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TISEL) as usize - ptr as usize },
        104usize,
        "Offset of field: TIM_TypeDef::TISEL"
    );
}
#[test]
fn bindgen_test_layout_LPTIM_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<LPTIM_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<LPTIM_TypeDef>(),
        40usize,
        "Size of LPTIM_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<LPTIM_TypeDef>(),
        4usize,
        "Alignment of LPTIM_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        0usize,
        "Offset of field: LPTIM_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        4usize,
        "Offset of field: LPTIM_TypeDef::ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        8usize,
        "Offset of field: LPTIM_TypeDef::IER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        12usize,
        "Offset of field: LPTIM_TypeDef::CFGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        16usize,
        "Offset of field: LPTIM_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMP) as usize - ptr as usize },
        20usize,
        "Offset of field: LPTIM_TypeDef::CMP"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ARR) as usize - ptr as usize },
        24usize,
        "Offset of field: LPTIM_TypeDef::ARR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CNT) as usize - ptr as usize },
        28usize,
        "Offset of field: LPTIM_TypeDef::CNT"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        32usize,
        "Offset of field: LPTIM_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR2) as usize - ptr as usize },
        36usize,
        "Offset of field: LPTIM_TypeDef::CFGR2"
    );
}
#[test]
fn bindgen_test_layout_COMPOPT_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<COMPOPT_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<COMPOPT_TypeDef>(),
        12usize,
        "Size of COMPOPT_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<COMPOPT_TypeDef>(),
        4usize,
        "Alignment of COMPOPT_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        0usize,
        "Offset of field: COMPOPT_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICFR) as usize - ptr as usize },
        4usize,
        "Offset of field: COMPOPT_TypeDef::ICFR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OR) as usize - ptr as usize },
        8usize,
        "Offset of field: COMPOPT_TypeDef::OR"
    );
}
#[test]
fn bindgen_test_layout_COMP_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<COMP_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<COMP_TypeDef>(),
        4usize,
        "Size of COMP_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<COMP_TypeDef>(),
        4usize,
        "Alignment of COMP_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        0usize,
        "Offset of field: COMP_TypeDef::CFGR"
    );
}
#[test]
fn bindgen_test_layout_COMP_Common_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<COMP_Common_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<COMP_Common_TypeDef>(),
        4usize,
        "Size of COMP_Common_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<COMP_Common_TypeDef>(),
        4usize,
        "Alignment of COMP_Common_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFGR) as usize - ptr as usize },
        0usize,
        "Offset of field: COMP_Common_TypeDef::CFGR"
    );
}
#[test]
fn bindgen_test_layout_USART_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<USART_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<USART_TypeDef>(),
        48usize,
        "Size of USART_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<USART_TypeDef>(),
        4usize,
        "Alignment of USART_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        "Offset of field: USART_TypeDef::CR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        "Offset of field: USART_TypeDef::CR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR3) as usize - ptr as usize },
        8usize,
        "Offset of field: USART_TypeDef::CR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BRR) as usize - ptr as usize },
        12usize,
        "Offset of field: USART_TypeDef::BRR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GTPR) as usize - ptr as usize },
        16usize,
        "Offset of field: USART_TypeDef::GTPR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RTOR) as usize - ptr as usize },
        20usize,
        "Offset of field: USART_TypeDef::RTOR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RQR) as usize - ptr as usize },
        24usize,
        "Offset of field: USART_TypeDef::RQR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        28usize,
        "Offset of field: USART_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        32usize,
        "Offset of field: USART_TypeDef::ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RDR) as usize - ptr as usize },
        36usize,
        "Offset of field: USART_TypeDef::RDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TDR) as usize - ptr as usize },
        40usize,
        "Offset of field: USART_TypeDef::TDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PRESC) as usize - ptr as usize },
        44usize,
        "Offset of field: USART_TypeDef::PRESC"
    );
}
#[test]
fn bindgen_test_layout_SWPMI_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<SWPMI_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SWPMI_TypeDef>(),
        40usize,
        "Size of SWPMI_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<SWPMI_TypeDef>(),
        4usize,
        "Alignment of SWPMI_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: SWPMI_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BRR) as usize - ptr as usize },
        4usize,
        "Offset of field: SWPMI_TypeDef::BRR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        8usize,
        "Offset of field: SWPMI_TypeDef::RESERVED1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        12usize,
        "Offset of field: SWPMI_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        16usize,
        "Offset of field: SWPMI_TypeDef::ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        20usize,
        "Offset of field: SWPMI_TypeDef::IER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RFL) as usize - ptr as usize },
        24usize,
        "Offset of field: SWPMI_TypeDef::RFL"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TDR) as usize - ptr as usize },
        28usize,
        "Offset of field: SWPMI_TypeDef::TDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RDR) as usize - ptr as usize },
        32usize,
        "Offset of field: SWPMI_TypeDef::RDR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OR) as usize - ptr as usize },
        36usize,
        "Offset of field: SWPMI_TypeDef::OR"
    );
}
#[test]
fn bindgen_test_layout_WWDG_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<WWDG_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<WWDG_TypeDef>(),
        12usize,
        "Size of WWDG_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<WWDG_TypeDef>(),
        4usize,
        "Alignment of WWDG_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: WWDG_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CFR) as usize - ptr as usize },
        4usize,
        "Offset of field: WWDG_TypeDef::CFR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        8usize,
        "Offset of field: WWDG_TypeDef::SR"
    );
}
#[test]
fn bindgen_test_layout_RAMECC_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<RAMECC_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<RAMECC_TypeDef>(),
        4usize,
        "Size of RAMECC_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<RAMECC_TypeDef>(),
        4usize,
        "Alignment of RAMECC_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        0usize,
        "Offset of field: RAMECC_TypeDef::IER"
    );
}
#[test]
fn bindgen_test_layout_CRYP_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<CRYP_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CRYP_TypeDef>(),
        144usize,
        "Size of CRYP_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<CRYP_TypeDef>(),
        4usize,
        "Alignment of CRYP_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: CRYP_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        4usize,
        "Offset of field: CRYP_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DIN) as usize - ptr as usize },
        8usize,
        "Offset of field: CRYP_TypeDef::DIN"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUT) as usize - ptr as usize },
        12usize,
        "Offset of field: CRYP_TypeDef::DOUT"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DMACR) as usize - ptr as usize },
        16usize,
        "Offset of field: CRYP_TypeDef::DMACR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMSCR) as usize - ptr as usize },
        20usize,
        "Offset of field: CRYP_TypeDef::IMSCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RISR) as usize - ptr as usize },
        24usize,
        "Offset of field: CRYP_TypeDef::RISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MISR) as usize - ptr as usize },
        28usize,
        "Offset of field: CRYP_TypeDef::MISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).K0LR) as usize - ptr as usize },
        32usize,
        "Offset of field: CRYP_TypeDef::K0LR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).K0RR) as usize - ptr as usize },
        36usize,
        "Offset of field: CRYP_TypeDef::K0RR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).K1LR) as usize - ptr as usize },
        40usize,
        "Offset of field: CRYP_TypeDef::K1LR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).K1RR) as usize - ptr as usize },
        44usize,
        "Offset of field: CRYP_TypeDef::K1RR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).K2LR) as usize - ptr as usize },
        48usize,
        "Offset of field: CRYP_TypeDef::K2LR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).K2RR) as usize - ptr as usize },
        52usize,
        "Offset of field: CRYP_TypeDef::K2RR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).K3LR) as usize - ptr as usize },
        56usize,
        "Offset of field: CRYP_TypeDef::K3LR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).K3RR) as usize - ptr as usize },
        60usize,
        "Offset of field: CRYP_TypeDef::K3RR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IV0LR) as usize - ptr as usize },
        64usize,
        "Offset of field: CRYP_TypeDef::IV0LR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IV0RR) as usize - ptr as usize },
        68usize,
        "Offset of field: CRYP_TypeDef::IV0RR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IV1LR) as usize - ptr as usize },
        72usize,
        "Offset of field: CRYP_TypeDef::IV1LR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IV1RR) as usize - ptr as usize },
        76usize,
        "Offset of field: CRYP_TypeDef::IV1RR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCMCCM0R) as usize - ptr as usize
        },
        80usize,
        "Offset of field: CRYP_TypeDef::CSGCMCCM0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCMCCM1R) as usize - ptr as usize
        },
        84usize,
        "Offset of field: CRYP_TypeDef::CSGCMCCM1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCMCCM2R) as usize - ptr as usize
        },
        88usize,
        "Offset of field: CRYP_TypeDef::CSGCMCCM2R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCMCCM3R) as usize - ptr as usize
        },
        92usize,
        "Offset of field: CRYP_TypeDef::CSGCMCCM3R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCMCCM4R) as usize - ptr as usize
        },
        96usize,
        "Offset of field: CRYP_TypeDef::CSGCMCCM4R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCMCCM5R) as usize - ptr as usize
        },
        100usize,
        "Offset of field: CRYP_TypeDef::CSGCMCCM5R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCMCCM6R) as usize - ptr as usize
        },
        104usize,
        "Offset of field: CRYP_TypeDef::CSGCMCCM6R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCMCCM7R) as usize - ptr as usize
        },
        108usize,
        "Offset of field: CRYP_TypeDef::CSGCMCCM7R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCM0R) as usize - ptr as usize
        },
        112usize,
        "Offset of field: CRYP_TypeDef::CSGCM0R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCM1R) as usize - ptr as usize
        },
        116usize,
        "Offset of field: CRYP_TypeDef::CSGCM1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCM2R) as usize - ptr as usize
        },
        120usize,
        "Offset of field: CRYP_TypeDef::CSGCM2R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCM3R) as usize - ptr as usize
        },
        124usize,
        "Offset of field: CRYP_TypeDef::CSGCM3R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCM4R) as usize - ptr as usize
        },
        128usize,
        "Offset of field: CRYP_TypeDef::CSGCM4R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCM5R) as usize - ptr as usize
        },
        132usize,
        "Offset of field: CRYP_TypeDef::CSGCM5R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCM6R) as usize - ptr as usize
        },
        136usize,
        "Offset of field: CRYP_TypeDef::CSGCM6R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CSGCM7R) as usize - ptr as usize
        },
        140usize,
        "Offset of field: CRYP_TypeDef::CSGCM7R"
    );
}
#[test]
fn bindgen_test_layout_HASH_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HASH_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HASH_TypeDef>(),
        464usize,
        "Size of HASH_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<HASH_TypeDef>(),
        4usize,
        "Alignment of HASH_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: HASH_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DIN) as usize - ptr as usize },
        4usize,
        "Offset of field: HASH_TypeDef::DIN"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).STR) as usize - ptr as usize },
        8usize,
        "Offset of field: HASH_TypeDef::STR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HR) as usize - ptr as usize },
        12usize,
        "Offset of field: HASH_TypeDef::HR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IMR) as usize - ptr as usize },
        32usize,
        "Offset of field: HASH_TypeDef::IMR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        36usize,
        "Offset of field: HASH_TypeDef::SR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED) as usize - ptr as usize
        },
        40usize,
        "Offset of field: HASH_TypeDef::RESERVED"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CSR) as usize - ptr as usize },
        248usize,
        "Offset of field: HASH_TypeDef::CSR"
    );
}
#[test]
fn bindgen_test_layout_HASH_DIGEST_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HASH_DIGEST_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HASH_DIGEST_TypeDef>(),
        32usize,
        "Size of HASH_DIGEST_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<HASH_DIGEST_TypeDef>(),
        4usize,
        "Alignment of HASH_DIGEST_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HR) as usize - ptr as usize },
        0usize,
        "Offset of field: HASH_DIGEST_TypeDef::HR"
    );
}
#[test]
fn bindgen_test_layout_HRTIM_Master_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HRTIM_Master_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HRTIM_Master_TypeDef>(),
        128usize,
        "Size of HRTIM_Master_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<HRTIM_Master_TypeDef>(),
        4usize,
        "Alignment of HRTIM_Master_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MCR) as usize - ptr as usize },
        0usize,
        "Offset of field: HRTIM_Master_TypeDef::MCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MISR) as usize - ptr as usize },
        4usize,
        "Offset of field: HRTIM_Master_TypeDef::MISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MICR) as usize - ptr as usize },
        8usize,
        "Offset of field: HRTIM_Master_TypeDef::MICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MDIER) as usize - ptr as usize },
        12usize,
        "Offset of field: HRTIM_Master_TypeDef::MDIER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MCNTR) as usize - ptr as usize },
        16usize,
        "Offset of field: HRTIM_Master_TypeDef::MCNTR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MPER) as usize - ptr as usize },
        20usize,
        "Offset of field: HRTIM_Master_TypeDef::MPER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MREP) as usize - ptr as usize },
        24usize,
        "Offset of field: HRTIM_Master_TypeDef::MREP"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MCMP1R) as usize - ptr as usize },
        28usize,
        "Offset of field: HRTIM_Master_TypeDef::MCMP1R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        32usize,
        "Offset of field: HRTIM_Master_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MCMP2R) as usize - ptr as usize },
        36usize,
        "Offset of field: HRTIM_Master_TypeDef::MCMP2R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MCMP3R) as usize - ptr as usize },
        40usize,
        "Offset of field: HRTIM_Master_TypeDef::MCMP3R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MCMP4R) as usize - ptr as usize },
        44usize,
        "Offset of field: HRTIM_Master_TypeDef::MCMP4R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize
        },
        48usize,
        "Offset of field: HRTIM_Master_TypeDef::RESERVED1"
    );
}
#[test]
fn bindgen_test_layout_HRTIM_Timerx_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HRTIM_Timerx_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HRTIM_Timerx_TypeDef>(),
        128usize,
        "Size of HRTIM_Timerx_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<HRTIM_Timerx_TypeDef>(),
        4usize,
        "Alignment of HRTIM_Timerx_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TIMxCR) as usize - ptr as usize },
        0usize,
        "Offset of field: HRTIM_Timerx_TypeDef::TIMxCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TIMxISR) as usize - ptr as usize
        },
        4usize,
        "Offset of field: HRTIM_Timerx_TypeDef::TIMxISR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TIMxICR) as usize - ptr as usize
        },
        8usize,
        "Offset of field: HRTIM_Timerx_TypeDef::TIMxICR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TIMxDIER) as usize - ptr as usize
        },
        12usize,
        "Offset of field: HRTIM_Timerx_TypeDef::TIMxDIER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CNTxR) as usize - ptr as usize },
        16usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CNTxR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PERxR) as usize - ptr as usize },
        20usize,
        "Offset of field: HRTIM_Timerx_TypeDef::PERxR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).REPxR) as usize - ptr as usize },
        24usize,
        "Offset of field: HRTIM_Timerx_TypeDef::REPxR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMP1xR) as usize - ptr as usize },
        28usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CMP1xR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CMP1CxR) as usize - ptr as usize
        },
        32usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CMP1CxR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMP2xR) as usize - ptr as usize },
        36usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CMP2xR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMP3xR) as usize - ptr as usize },
        40usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CMP3xR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CMP4xR) as usize - ptr as usize },
        44usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CMP4xR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CPT1xR) as usize - ptr as usize },
        48usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CPT1xR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CPT2xR) as usize - ptr as usize },
        52usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CPT2xR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DTxR) as usize - ptr as usize },
        56usize,
        "Offset of field: HRTIM_Timerx_TypeDef::DTxR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SETx1R) as usize - ptr as usize },
        60usize,
        "Offset of field: HRTIM_Timerx_TypeDef::SETx1R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RSTx1R) as usize - ptr as usize },
        64usize,
        "Offset of field: HRTIM_Timerx_TypeDef::RSTx1R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SETx2R) as usize - ptr as usize },
        68usize,
        "Offset of field: HRTIM_Timerx_TypeDef::SETx2R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RSTx2R) as usize - ptr as usize },
        72usize,
        "Offset of field: HRTIM_Timerx_TypeDef::RSTx2R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EEFxR1) as usize - ptr as usize },
        76usize,
        "Offset of field: HRTIM_Timerx_TypeDef::EEFxR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EEFxR2) as usize - ptr as usize },
        80usize,
        "Offset of field: HRTIM_Timerx_TypeDef::EEFxR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RSTxR) as usize - ptr as usize },
        84usize,
        "Offset of field: HRTIM_Timerx_TypeDef::RSTxR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CHPxR) as usize - ptr as usize },
        88usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CHPxR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CPT1xCR) as usize - ptr as usize
        },
        92usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CPT1xCR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CPT2xCR) as usize - ptr as usize
        },
        96usize,
        "Offset of field: HRTIM_Timerx_TypeDef::CPT2xCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OUTxR) as usize - ptr as usize },
        100usize,
        "Offset of field: HRTIM_Timerx_TypeDef::OUTxR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FLTxR) as usize - ptr as usize },
        104usize,
        "Offset of field: HRTIM_Timerx_TypeDef::FLTxR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        108usize,
        "Offset of field: HRTIM_Timerx_TypeDef::RESERVED0"
    );
}
#[test]
fn bindgen_test_layout_HRTIM_Common_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HRTIM_Common_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HRTIM_Common_TypeDef>(),
        116usize,
        "Size of HRTIM_Common_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<HRTIM_Common_TypeDef>(),
        4usize,
        "Alignment of HRTIM_Common_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        0usize,
        "Offset of field: HRTIM_Common_TypeDef::CR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR2) as usize - ptr as usize },
        4usize,
        "Offset of field: HRTIM_Common_TypeDef::CR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISR) as usize - ptr as usize },
        8usize,
        "Offset of field: HRTIM_Common_TypeDef::ISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICR) as usize - ptr as usize },
        12usize,
        "Offset of field: HRTIM_Common_TypeDef::ICR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IER) as usize - ptr as usize },
        16usize,
        "Offset of field: HRTIM_Common_TypeDef::IER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OENR) as usize - ptr as usize },
        20usize,
        "Offset of field: HRTIM_Common_TypeDef::OENR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ODISR) as usize - ptr as usize },
        24usize,
        "Offset of field: HRTIM_Common_TypeDef::ODISR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ODSR) as usize - ptr as usize },
        28usize,
        "Offset of field: HRTIM_Common_TypeDef::ODSR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BMCR) as usize - ptr as usize },
        32usize,
        "Offset of field: HRTIM_Common_TypeDef::BMCR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BMTRGR) as usize - ptr as usize },
        36usize,
        "Offset of field: HRTIM_Common_TypeDef::BMTRGR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BMCMPR) as usize - ptr as usize },
        40usize,
        "Offset of field: HRTIM_Common_TypeDef::BMCMPR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BMPER) as usize - ptr as usize },
        44usize,
        "Offset of field: HRTIM_Common_TypeDef::BMPER"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EECR1) as usize - ptr as usize },
        48usize,
        "Offset of field: HRTIM_Common_TypeDef::EECR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EECR2) as usize - ptr as usize },
        52usize,
        "Offset of field: HRTIM_Common_TypeDef::EECR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EECR3) as usize - ptr as usize },
        56usize,
        "Offset of field: HRTIM_Common_TypeDef::EECR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ADC1R) as usize - ptr as usize },
        60usize,
        "Offset of field: HRTIM_Common_TypeDef::ADC1R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ADC2R) as usize - ptr as usize },
        64usize,
        "Offset of field: HRTIM_Common_TypeDef::ADC2R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ADC3R) as usize - ptr as usize },
        68usize,
        "Offset of field: HRTIM_Common_TypeDef::ADC3R"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ADC4R) as usize - ptr as usize },
        72usize,
        "Offset of field: HRTIM_Common_TypeDef::ADC4R"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        76usize,
        "Offset of field: HRTIM_Common_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTINR1) as usize - ptr as usize
        },
        80usize,
        "Offset of field: HRTIM_Common_TypeDef::FLTINR1"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FLTINR2) as usize - ptr as usize
        },
        84usize,
        "Offset of field: HRTIM_Common_TypeDef::FLTINR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BDMUPR) as usize - ptr as usize },
        88usize,
        "Offset of field: HRTIM_Common_TypeDef::BDMUPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BDTAUPR) as usize - ptr as usize
        },
        92usize,
        "Offset of field: HRTIM_Common_TypeDef::BDTAUPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BDTBUPR) as usize - ptr as usize
        },
        96usize,
        "Offset of field: HRTIM_Common_TypeDef::BDTBUPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BDTCUPR) as usize - ptr as usize
        },
        100usize,
        "Offset of field: HRTIM_Common_TypeDef::BDTCUPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BDTDUPR) as usize - ptr as usize
        },
        104usize,
        "Offset of field: HRTIM_Common_TypeDef::BDTDUPR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).BDTEUPR) as usize - ptr as usize
        },
        108usize,
        "Offset of field: HRTIM_Common_TypeDef::BDTEUPR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BDMADR) as usize - ptr as usize },
        112usize,
        "Offset of field: HRTIM_Common_TypeDef::BDMADR"
    );
}
#[test]
fn bindgen_test_layout_HRTIM_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<HRTIM_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HRTIM_TypeDef>(),
        1012usize,
        "Size of HRTIM_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<HRTIM_TypeDef>(),
        4usize,
        "Alignment of HRTIM_TypeDef"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).sMasterRegs) as usize - ptr as usize
        },
        0usize,
        "Offset of field: HRTIM_TypeDef::sMasterRegs"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).sTimerxRegs) as usize - ptr as usize
        },
        128usize,
        "Offset of field: HRTIM_TypeDef::sTimerxRegs"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize
        },
        768usize,
        "Offset of field: HRTIM_TypeDef::RESERVED0"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).sCommonRegs) as usize - ptr as usize
        },
        896usize,
        "Offset of field: HRTIM_TypeDef::sCommonRegs"
    );
}
#[test]
fn bindgen_test_layout_RNG_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<RNG_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<RNG_TypeDef>(),
        12usize,
        "Size of RNG_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<RNG_TypeDef>(),
        4usize,
        "Alignment of RNG_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: RNG_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        4usize,
        "Offset of field: RNG_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DR) as usize - ptr as usize },
        8usize,
        "Offset of field: RNG_TypeDef::DR"
    );
}
#[test]
fn bindgen_test_layout_MDIOS_TypeDef() {
    const UNINIT: ::core::mem::MaybeUninit<MDIOS_TypeDef> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<MDIOS_TypeDef>(),
        512usize,
        "Size of MDIOS_TypeDef"
    );
    assert_eq!(
        ::core::mem::align_of::<MDIOS_TypeDef>(),
        4usize,
        "Alignment of MDIOS_TypeDef"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        "Offset of field: MDIOS_TypeDef::CR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WRFR) as usize - ptr as usize },
        4usize,
        "Offset of field: MDIOS_TypeDef::WRFR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CWRFR) as usize - ptr as usize },
        8usize,
        "Offset of field: MDIOS_TypeDef::CWRFR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RDFR) as usize - ptr as usize },
        12usize,
        "Offset of field: MDIOS_TypeDef::RDFR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CRDFR) as usize - ptr as usize },
        16usize,
        "Offset of field: MDIOS_TypeDef::CRDFR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        20usize,
        "Offset of field: MDIOS_TypeDef::SR"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CLRFR) as usize - ptr as usize },
        24usize,
        "Offset of field: MDIOS_TypeDef::CLRFR"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RESERVED) as usize - ptr as usize
        },
        28usize,
        "Offset of field: MDIOS_TypeDef::RESERVED"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR0) as usize - ptr as usize },
        256usize,
        "Offset of field: MDIOS_TypeDef::DINR0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR1) as usize - ptr as usize },
        260usize,
        "Offset of field: MDIOS_TypeDef::DINR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR2) as usize - ptr as usize },
        264usize,
        "Offset of field: MDIOS_TypeDef::DINR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR3) as usize - ptr as usize },
        268usize,
        "Offset of field: MDIOS_TypeDef::DINR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR4) as usize - ptr as usize },
        272usize,
        "Offset of field: MDIOS_TypeDef::DINR4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR5) as usize - ptr as usize },
        276usize,
        "Offset of field: MDIOS_TypeDef::DINR5"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR6) as usize - ptr as usize },
        280usize,
        "Offset of field: MDIOS_TypeDef::DINR6"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR7) as usize - ptr as usize },
        284usize,
        "Offset of field: MDIOS_TypeDef::DINR7"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR8) as usize - ptr as usize },
        288usize,
        "Offset of field: MDIOS_TypeDef::DINR8"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR9) as usize - ptr as usize },
        292usize,
        "Offset of field: MDIOS_TypeDef::DINR9"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR10) as usize - ptr as usize },
        296usize,
        "Offset of field: MDIOS_TypeDef::DINR10"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR11) as usize - ptr as usize },
        300usize,
        "Offset of field: MDIOS_TypeDef::DINR11"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR12) as usize - ptr as usize },
        304usize,
        "Offset of field: MDIOS_TypeDef::DINR12"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR13) as usize - ptr as usize },
        308usize,
        "Offset of field: MDIOS_TypeDef::DINR13"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR14) as usize - ptr as usize },
        312usize,
        "Offset of field: MDIOS_TypeDef::DINR14"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR15) as usize - ptr as usize },
        316usize,
        "Offset of field: MDIOS_TypeDef::DINR15"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR16) as usize - ptr as usize },
        320usize,
        "Offset of field: MDIOS_TypeDef::DINR16"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR17) as usize - ptr as usize },
        324usize,
        "Offset of field: MDIOS_TypeDef::DINR17"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR18) as usize - ptr as usize },
        328usize,
        "Offset of field: MDIOS_TypeDef::DINR18"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR19) as usize - ptr as usize },
        332usize,
        "Offset of field: MDIOS_TypeDef::DINR19"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR20) as usize - ptr as usize },
        336usize,
        "Offset of field: MDIOS_TypeDef::DINR20"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR21) as usize - ptr as usize },
        340usize,
        "Offset of field: MDIOS_TypeDef::DINR21"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR22) as usize - ptr as usize },
        344usize,
        "Offset of field: MDIOS_TypeDef::DINR22"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR23) as usize - ptr as usize },
        348usize,
        "Offset of field: MDIOS_TypeDef::DINR23"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR24) as usize - ptr as usize },
        352usize,
        "Offset of field: MDIOS_TypeDef::DINR24"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR25) as usize - ptr as usize },
        356usize,
        "Offset of field: MDIOS_TypeDef::DINR25"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR26) as usize - ptr as usize },
        360usize,
        "Offset of field: MDIOS_TypeDef::DINR26"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR27) as usize - ptr as usize },
        364usize,
        "Offset of field: MDIOS_TypeDef::DINR27"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR28) as usize - ptr as usize },
        368usize,
        "Offset of field: MDIOS_TypeDef::DINR28"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR29) as usize - ptr as usize },
        372usize,
        "Offset of field: MDIOS_TypeDef::DINR29"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR30) as usize - ptr as usize },
        376usize,
        "Offset of field: MDIOS_TypeDef::DINR30"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DINR31) as usize - ptr as usize },
        380usize,
        "Offset of field: MDIOS_TypeDef::DINR31"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR0) as usize - ptr as usize },
        384usize,
        "Offset of field: MDIOS_TypeDef::DOUTR0"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR1) as usize - ptr as usize },
        388usize,
        "Offset of field: MDIOS_TypeDef::DOUTR1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR2) as usize - ptr as usize },
        392usize,
        "Offset of field: MDIOS_TypeDef::DOUTR2"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR3) as usize - ptr as usize },
        396usize,
        "Offset of field: MDIOS_TypeDef::DOUTR3"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR4) as usize - ptr as usize },
        400usize,
        "Offset of field: MDIOS_TypeDef::DOUTR4"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR5) as usize - ptr as usize },
        404usize,
        "Offset of field: MDIOS_TypeDef::DOUTR5"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR6) as usize - ptr as usize },
        408usize,
        "Offset of field: MDIOS_TypeDef::DOUTR6"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR7) as usize - ptr as usize },
        412usize,
        "Offset of field: MDIOS_TypeDef::DOUTR7"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR8) as usize - ptr as usize },
        416usize,
        "Offset of field: MDIOS_TypeDef::DOUTR8"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DOUTR9) as usize - ptr as usize },
        420usize,
        "Offset of field: MDIOS_TypeDef::DOUTR9"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR10) as usize - ptr as usize
        },
        424usize,
        "Offset of field: MDIOS_TypeDef::DOUTR10"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR11) as usize - ptr as usize
        },
        428usize,
        "Offset of field: MDIOS_TypeDef::DOUTR11"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR12) as usize - ptr as usize
        },
        432usize,
        "Offset of field: MDIOS_TypeDef::DOUTR12"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR13) as usize - ptr as usize
        },
        436usize,
        "Offset of field: MDIOS_TypeDef::DOUTR13"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR14) as usize - ptr as usize
        },
        440usize,
        "Offset of field: MDIOS_TypeDef::DOUTR14"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR15) as usize - ptr as usize
        },
        444usize,
        "Offset of field: MDIOS_TypeDef::DOUTR15"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR16) as usize - ptr as usize
        },
        448usize,
        "Offset of field: MDIOS_TypeDef::DOUTR16"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR17) as usize - ptr as usize
        },
        452usize,
        "Offset of field: MDIOS_TypeDef::DOUTR17"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR18) as usize - ptr as usize
        },
        456usize,
        "Offset of field: MDIOS_TypeDef::DOUTR18"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR19) as usize - ptr as usize
        },
        460usize,
        "Offset of field: MDIOS_TypeDef::DOUTR19"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR20) as usize - ptr as usize
        },
        464usize,
        "Offset of field: MDIOS_TypeDef::DOUTR20"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR21) as usize - ptr as usize
        },
        468usize,
        "Offset of field: MDIOS_TypeDef::DOUTR21"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR22) as usize - ptr as usize
        },
        472usize,
        "Offset of field: MDIOS_TypeDef::DOUTR22"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR23) as usize - ptr as usize
        },
        476usize,
        "Offset of field: MDIOS_TypeDef::DOUTR23"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR24) as usize - ptr as usize
        },
        480usize,
        "Offset of field: MDIOS_TypeDef::DOUTR24"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR25) as usize - ptr as usize
        },
        484usize,
        "Offset of field: MDIOS_TypeDef::DOUTR25"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR26) as usize - ptr as usize
        },
        488usize,
        "Offset of field: MDIOS_TypeDef::DOUTR26"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR27) as usize - ptr as usize
        },
        492usize,
        "Offset of field: MDIOS_TypeDef::DOUTR27"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR28) as usize - ptr as usize
        },
        496usize,
        "Offset of field: MDIOS_TypeDef::DOUTR28"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR29) as usize - ptr as usize
        },
        500usize,
        "Offset of field: MDIOS_TypeDef::DOUTR29"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR30) as usize - ptr as usize
        },
        504usize,
        "Offset of field: MDIOS_TypeDef::DOUTR30"
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DOUTR31) as usize - ptr as usize
        },
        508usize,
        "Offset of field: MDIOS_TypeDef::DOUTR31"
    );
}
pub mod IRQn_Type {
    pub type Type = ::core::ffi::c_int;
    pub const NonMaskableInt_IRQn: Type = -14;
    pub const HardFault_IRQn: Type = -13;
    pub const MemoryManagement_IRQn: Type = -12;
    pub const BusFault_IRQn: Type = -11;
    pub const UsageFault_IRQn: Type = -10;
    pub const SVCall_IRQn: Type = -5;
    pub const DebugMonitor_IRQn: Type = -4;
    pub const PendSV_IRQn: Type = -2;
    pub const SysTick_IRQn: Type = -1;
    pub const WWDG_IRQn: Type = 0;
    pub const PVD_AVD_IRQn: Type = 1;
    pub const TAMP_STAMP_IRQn: Type = 2;
    pub const RTC_WKUP_IRQn: Type = 3;
    pub const FLASH_IRQn: Type = 4;
    pub const RCC_IRQn: Type = 5;
    pub const EXTI0_IRQn: Type = 6;
    pub const EXTI1_IRQn: Type = 7;
    pub const EXTI2_IRQn: Type = 8;
    pub const EXTI3_IRQn: Type = 9;
    pub const EXTI4_IRQn: Type = 10;
    pub const DMA1_Stream0_IRQn: Type = 11;
    pub const DMA1_Stream1_IRQn: Type = 12;
